#language: ru

@tree
@быстрые проврки

Функциональность: Дымовые тесты для 2 пунктов

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Открытие формы объекта "ABCXYZАнализНоменклатуры"

	Дано Я открываю основную форму отчета "ABCXYZАнализНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ABCXYZАнализНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ABCXYZРаспределениеКлиентов"

	Дано Я открываю основную форму отчета "ABCXYZРаспределениеКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ABCXYZРаспределениеКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализВерсийОбъектов"

	Дано Я открываю основную форму отчета "АнализВерсийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВерсийОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализВзносовВФонды"

	Дано Я открываю основную форму отчета "АнализВзносовВФонды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВзносовВФонды"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализВыполненияМаршрутныхЛистов"

	Дано Я открываю основную форму отчета "АнализВыполненияМаршрутныхЛистов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВыполненияМаршрутныхЛистов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализДоходовРасходов"

	Дано Я открываю основную форму отчета "АнализДоходовРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализДоходовРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЖурналаРегистрации"

	Дано Я открываю основную форму отчета "АнализЖурналаРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЖурналаРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЗависимостиОтКлиентовABC"

	Дано Я открываю основную форму отчета "АнализЗависимостиОтКлиентовABC"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЗависимостиОтКлиентовABC"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЗадолженностиПоЗарплате"

	Дано Я открываю основную форму отчета "АнализЗадолженностиПоЗарплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЗадолженностиПоЗарплате"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЗатрат"

	Дано Я открываю основную форму отчета "АнализЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЗатрат"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализИзмененийЛичныхДанныхСотрудников"

	Дано Я открываю основную форму отчета "АнализИзмененийЛичныхДанныхСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализИзмененийЛичныхДанныхСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализИсполненияАссортимента"

	Дано Я открываю основную форму отчета "АнализИсполненияАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализИсполненияАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализКлиентскойБазыBCG"

	Дано Я открываю основную форму отчета "АнализКлиентскойБазыBCG"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализКлиентскойБазыBCG"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализКорреспонденцийОперативногоУчета"

	Дано Я открываю основную форму отчета "АнализКорреспонденцийОперативногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализКорреспонденцийОперативногоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЛояльностиКлиентовXYZ"

	Дано Я открываю основную форму отчета "АнализЛояльностиКлиентовXYZ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЛояльностиКлиентовXYZ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализНачисленийИУдержаний"

	Дано Я открываю основную форму отчета "АнализНачисленийИУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализНачисленийИУдержаний"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализНачисленийИУдержанийАвансом"

	Дано Я открываю основную форму отчета "АнализНачисленийИУдержанийАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализНачисленийИУдержанийАвансом"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализНачисленийНДССАвансовПолученных"

	Дано Я открываю основную форму отчета "АнализНачисленийНДССАвансовПолученных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализНачисленийНДССАвансовПолученных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализНДФЛ"

	Дано Я открываю основную форму отчета "АнализНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализНДФЛДетальный"

	Дано Я открываю основную форму отчета "АнализНДФЛДетальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализНДФЛДетальный"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОбязательствПоНДФЛ"

	Дано Я открываю основную форму отчета "АнализОбязательствПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОбязательствПоНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОпроса"

	Дано Я открываю основную форму отчета "АнализОпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОпроса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОстатковТоваровОрганизаций"

	Дано Я открываю основную форму отчета "АнализОстатковТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОстатковТоваровОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПервичногоИнтереса"

	Дано Я открываю основную форму отчета "АнализПервичногоИнтереса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПервичногоИнтереса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПервичногоСпроса"

	Дано Я открываю основную форму отчета "АнализПервичногоСпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПервичногоСпроса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПлановыхНачислений"

	Дано Я открываю основную форму отчета "АнализПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПлановыхНачислений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПооперационногоРасписания"

	Дано Я открываю основную форму отчета "АнализПооперационногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПооперационногоРасписания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПооперационногоРасписания2_2"

	Дано Я открываю основную форму отчета "АнализПооперационногоРасписания2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПооперационногоРасписания2_2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПравДоступа"

	Дано Я открываю основную форму отчета "АнализПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПравДоступа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПретензийКлиентов"

	Дано Я открываю основную форму отчета "АнализПретензийКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПретензийКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПричинЗадержекВыполненияМаршрутныхЛистов"

	Дано Я открываю основную форму отчета "АнализПричинЗадержекВыполненияМаршрутныхЛистов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПричинЗадержекВыполненияМаршрутныхЛистов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПричинОтменыЗаказовКлиентов"

	Дано Я открываю основную форму отчета "АнализПричинОтменыЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПричинОтменыЗаказовКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПричинОтменыЗаказовПоставщикам"

	Дано Я открываю основную форму отчета "АнализПричинОтменыЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПричинОтменыЗаказовПоставщикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПричинОтменыЗаказовПоставщикамПоДокументу"

	Дано Я открываю основную форму отчета "АнализПричинОтменыЗаказовПоставщикамПоДокументу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПричинОтменыЗаказовПоставщикамПоДокументу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПричинПроигрышаСделок"

	Дано Я открываю основную форму отчета "АнализПричинПроигрышаСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПричинПроигрышаСделок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРаспределенияНачальныхОстатковНЗП"

	Дано Я открываю основную форму отчета "АнализРаспределенияНачальныхОстатковНЗП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРаспределенияНачальныхОстатковНЗП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРаспределенияНДС"

	Дано Я открываю основную форму отчета "АнализРаспределенияНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРаспределенияНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасходовПриУСН"

	Дано Я открываю основную форму отчета "АнализРасходовПриУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасходовПриУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриВыводеИзОборотаИСМП"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриВыводеИзОборотаИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриВыводеИзОборотаИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриДвиженииАлкогольнойПродукции"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриДвиженииАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриДвиженииАлкогольнойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриИнвентаризацииПродукцииВЕТИС"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриИнвентаризацииПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриИнвентаризацииПродукцииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриМаркировкеТоваровИСМП"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриМаркировкеТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриМаркировкеТоваровИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриОтгрузкеАлкогольнойПродукции"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриОтгрузкеАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриОтгрузкеАлкогольнойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриОтгрузкеПродукцииВЕТИС"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриОтгрузкеПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриОтгрузкеПродукцииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриПоступленииАлкогольнойПродукции"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриПоступленииАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриПоступленииАлкогольнойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриПоступленииПродукцииВЕТИС"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриПоступленииПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриПоступленииПродукцииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриПроизводствеПродукцииВЕТИС"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриПроизводствеПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриПроизводствеПродукцииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСебестоимостиВыпущеннойПродукции"

	Дано Я открываю основную форму отчета "АнализСебестоимостиВыпущеннойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСебестоимостиВыпущеннойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСебестоимостиТоваровРасширенный"

	Дано Я открываю основную форму отчета "АнализСебестоимостиТоваровРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСебестоимостиТоваровРасширенный"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСостоянияНалоговогоУчетаПоНалогуНаПрибыль"

	Дано Я открываю основную форму отчета "АнализСостоянияНалоговогоУчетаПоНалогуНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСостоянияНалоговогоУчетаПоНалогуНаПрибыль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСостоянияНалоговогоУчетаПоНДС"

	Дано Я открываю основную форму отчета "АнализСостоянияНалоговогоУчетаПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСостоянияНалоговогоУчетаПоНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСубконто"

	Дано Я открываю основную форму отчета "АнализСубконто"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСубконто"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСуточнойЗагрузки"

	Дано Я открываю основную форму отчета "АнализСуточнойЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСуточнойЗагрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСчета"

	Дано Я открываю основную форму отчета "АнализСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализУведомления"

	Дано Я открываю основную форму отчета "АнализУведомления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализУведомления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализУплатыНДФЛ"

	Дано Я открываю основную форму отчета "АнализУплатыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализУплатыНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализУчетаНДСПриЗачетеАвансовВыданных"

	Дано Я открываю основную форму отчета "АнализУчетаНДСПриЗачетеАвансовВыданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализУчетаНДСПриЗачетеАвансовВыданных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализУчетаНДСПриЗачетеАвансовПолученных"

	Дано Я открываю основную форму отчета "АнализУчетаНДСПриЗачетеАвансовПолученных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализУчетаНДСПриЗачетеАвансовПолученных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализФинансовыхРезультатов"

	Дано Я открываю основную форму отчета "АнализФинансовыхРезультатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализФинансовыхРезультатов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЦенПоставщиков"

	Дано Я открываю основную форму отчета "АнализЦенПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЦенПоставщиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЭкономииОтПониженногоТарифаСтраховыхВзносов"

	Дано Я открываю основную форму отчета "АнализЭкономииОтПониженногоТарифаСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЭкономииОтПониженногоТарифаСтраховыхВзносов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЭффективностиРаботыТорговыхПредставителей"

	Дано Я открываю основную форму отчета "АнализЭффективностиРаботыТорговыхПредставителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЭффективностиРаботыТорговыхПредставителей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АналитическийОтчетПоАнкетированию"

	Дано Я открываю основную форму отчета "АналитическийОтчетПоАнкетированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АналитическийОтчетПоАнкетированию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АрендованныеОС"

	Дано Я открываю основную форму отчета "АрендованныеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АрендованныеОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БазаРаспределенияМатериаловИРабот"

	Дано Я открываю основную форму отчета "БазаРаспределенияМатериаловИРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БазаРаспределенияМатериаловИРабот"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БазаРаспределенияПроизводственныхРасходов"

	Дано Я открываю основную форму отчета "БазаРаспределенияПроизводственныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БазаРаспределенияПроизводственныхРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БизнесПроцессы"

	Дано Я открываю основную форму отчета "БизнесПроцессы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БизнесПроцессы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БонусныеБаллы"

	Дано Я открываю основную форму отчета "БонусныеБаллы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БонусныеБаллы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БухгалтерскаяОтчетностьВБанк"

	Дано Я открываю основную форму отчета "БухгалтерскаяОтчетностьВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БухгалтерскаяОтчетностьВБанк"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БухгалтерскийОтчетМеждународный"

	Дано Я открываю основную форму отчета "БухгалтерскийОтчетМеждународный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БухгалтерскийОтчетМеждународный"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БюджетныйОтчет"

	Дано Я открываю основную форму отчета "БюджетныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БюджетныйОтчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВаловаяПрибыльПоОплаченнымОтгрузкам"

	Дано Я открываю основную форму отчета "ВаловаяПрибыльПоОплаченнымОтгрузкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВаловаяПрибыльПоОплаченнымОтгрузкам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьБезналичныхДенежныхСредств"

	Дано Я открываю основную форму отчета "ВедомостьБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьБезналичныхДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоДенежнымДокументам"

	Дано Я открываю основную форму отчета "ВедомостьПоДенежнымДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоДенежнымДокументам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоДенежнымСредствам"

	Дано Я открываю основную форму отчета "ВедомостьПоДенежнымСредствам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоДенежнымСредствам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоДенежнымСредствамУПодотчетныхЛиц"

	Дано Я открываю основную форму отчета "ВедомостьПоДенежнымСредствамУПодотчетныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоДенежнымСредствамУПодотчетныхЛиц"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоДисконтированнойЗадолженности"

	Дано Я открываю основную форму отчета "ВедомостьПоДисконтированнойЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоДисконтированнойЗадолженности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоНМА_МУ"

	Дано Я открываю основную форму отчета "ВедомостьПоНМА_МУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоНМА_МУ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоНМА2_4"

	Дано Я открываю основную форму отчета "ВедомостьПоНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоНМА2_4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоОС"

	Дано Я открываю основную форму отчета "ВедомостьПоОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоОС_МУ"

	Дано Я открываю основную форму отчета "ВедомостьПоОС_МУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоОС_МУ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоОС2_4"

	Дано Я открываю основную форму отчета "ВедомостьПоОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоОС2_4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоПартиямТоваров"

	Дано Я открываю основную форму отчета "ВедомостьПоПартиямТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоПартиямТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоПереданнойВозвратнойТаре"

	Дано Я открываю основную форму отчета "ВедомостьПоПереданнойВозвратнойТаре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоПереданнойВозвратнойТаре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоПринятойВозвратнойТаре"

	Дано Я открываю основную форму отчета "ВедомостьПоПринятойВозвратнойТаре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоПринятойВозвратнойТаре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоРезервамПредстоящихРасходов"

	Дано Я открываю основную форму отчета "ВедомостьПоРезервамПредстоящихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоРезервамПредстоящихРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоСериямНоменклатуры"

	Дано Я открываю основную форму отчета "ВедомостьПоСериямНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоСериямНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоТоварамНаСкладах"

	Дано Я открываю основную форму отчета "ВедомостьПоТоварамНаСкладах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоТоварамНаСкладах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры"

	Дано Я открываю основную форму отчета "ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоТоварамОрганизаций"

	Дано Я открываю основную форму отчета "ВедомостьПоТоварамОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоТоварамОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры"

	Дано Я открываю основную форму отчета "ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПрослеживаемыхТоваровВСоставеОС"

	Дано Я открываю основную форму отчета "ВедомостьПрослеживаемыхТоваровВСоставеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПрослеживаемыхТоваровВСоставеОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовМеждуОрганизациями"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовМеждуОрганизациями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовПоАренде"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовПоАренде"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовПоФинансовымИнструментам"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовПоФинансовымИнструментам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовСКлиентами"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовСПартнерами"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовСПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовСПартнерами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовСПоставщиками"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовСПоставщиками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьТМЦВЭксплуатации"

	Дано Я открываю основную форму отчета "ВедомостьТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьТМЦВЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВероятностныйПрогноз"

	Дано Я открываю основную форму отчета "ВероятностныйПрогноз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВероятностныйПрогноз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВзаимозависимыеЛицаКонтролируемыхСделок"

	Дано Я открываю основную форму отчета "ВзаимозависимыеЛицаКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВзаимозависимыеЛицаКонтролируемыхСделок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВнеоборотныеАктивыСОбесценением"

	Дано Я открываю основную форму отчета "ВнеоборотныеАктивыСОбесценением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВнеоборотныеАктивыСОбесценением"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВоинскийУчетБронирование"

	Дано Я открываю основную форму отчета "ВоинскийУчетБронирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВоинскийУчетБронирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВоинскийУчетОбщий"

	Дано Я открываю основную форму отчета "ВоинскийУчетОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВоинскийУчетОбщий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВоронкаПродаж"

	Дано Я открываю основную форму отчета "ВоронкаПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВоронкаПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыплатыНезарплатныхДоходов"

	Дано Я открываю основную форму отчета "ВыплатыНезарплатныхДоходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыплатыНезарплатныхДоходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеЗадачБюджетногоПроцесса"

	Дано Я открываю основную форму отчета "ВыполнениеЗадачБюджетногоПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыполнениеЗадачБюджетногоПроцесса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеУсловийСоглашенийСКлиентами"

	Дано Я открываю основную форму отчета "ВыполнениеУсловийСоглашенийСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыполнениеУсловийСоглашенийСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыпускПродукции"

	Дано Я открываю основную форму отчета "ВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыпускПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыручкаИСебестоимостьПродаж"

	Дано Я открываю основную форму отчета "ВыручкаИСебестоимостьПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыручкаИСебестоимостьПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыручкаИСебестоимостьРозничныхПродаж"

	Дано Я открываю основную форму отчета "ВыручкаИСебестоимостьРозничныхПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыручкаИСебестоимостьРозничныхПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГлавнаяКнига"

	Дано Я открываю основную форму отчета "ГлавнаяКнига"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ГлавнаяКнига"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрафикОтпусков"

	Дано Я открываю основную форму отчета "ГрафикОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ГрафикОтпусков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрафикПроизводстваПродукции"

	Дано Я открываю основную форму отчета "ГрафикПроизводстваПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ГрафикПроизводстваПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрафикПроизводстваПродукции2_2"

	Дано Я открываю основную форму отчета "ГрафикПроизводстваПродукции2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ГрафикПроизводстваПродукции2_2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДанныеДляБазыРаспределенияРасходов"

	Дано Я открываю основную форму отчета "ДанныеДляБазыРаспределенияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДанныеДляБазыРаспределенияРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаЗагрузки"

	Дано Я открываю основную форму отчета "ДатыЗапретаЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаЗагрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму отчета "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаИзменения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвижениеМатериаловПолуфабрикатовРаботВПроизводстве"

	Дано Я открываю основную форму отчета "ДвижениеМатериаловПолуфабрикатовРаботВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвижениеМатериаловПолуфабрикатовРаботВПроизводстве"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвижениеСерииНоменклатуры"

	Дано Я открываю основную форму отчета "ДвижениеСерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвижениеСерииНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияДенежныхСредств"

	Дано Я открываю основную форму отчета "ДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияДокумента"

	Дано Я открываю основную форму отчета "ДвиженияДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияМеждуРегистрамиЕГАИС"

	Дано Я открываю основную форму отчета "ДвиженияМеждуРегистрамиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияМеждуРегистрамиЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияПоСправке2ЕГАИС"

	Дано Я открываю основную форму отчета "ДвиженияПоСправке2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияПоСправке2ЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДебиторскаяЗадолженность"

	Дано Я открываю основную форму отчета "ДебиторскаяЗадолженность"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДебиторскаяЗадолженность"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДебиторскаяЗадолженностьДоляПросрочки"

	Дано Я открываю основную форму отчета "ДебиторскаяЗадолженностьДоляПросрочки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДебиторскаяЗадолженностьДоляПросрочки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДеревоСебестоимостиПродукции"

	Дано Я открываю основную форму отчета "ДеревоСебестоимостиПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДеревоСебестоимостиПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДефектыУзловОбъектовЭксплуатации"

	Дано Я открываю основную форму отчета "ДефектыУзловОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДефектыУзловОбъектовЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиагностикаЭтапаПроизводства"

	Дано Я открываю основную форму отчета "ДиагностикаЭтапаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДиагностикаЭтапаПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиаграммаПооперационногоРасписания"

	Дано Я открываю основную форму отчета "ДиаграммаПооперационногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДиаграммаПооперационногоРасписания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиаграммаПооперационногоРасписания2_2"

	Дано Я открываю основную форму отчета "ДиаграммаПооперационногоРасписания2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДиаграммаПооперационногоРасписания2_2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиаграммаПроизводстваЗаказа"

	Дано Я открываю основную форму отчета "ДиаграммаПроизводстваЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДиаграммаПроизводстваЗаказа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиаграммаПроизводстваПартииЗапуска"

	Дано Я открываю основную форму отчета "ДиаграммаПроизводстваПартииЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДиаграммаПроизводстваПартииЗапуска"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиаграммаСмежныхЭтаповПроизводства"

	Дано Я открываю основную форму отчета "ДиаграммаСмежныхЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДиаграммаСмежныхЭтаповПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиаграммаСостоянияЭДО"

	Дано Я открываю основную форму отчета "ДиаграммаСостоянияЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДиаграммаСостоянияЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаИзмененияЦенНоменклатуры"

	Дано Я открываю основную форму отчета "ДинамикаИзмененияЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаИзмененияЦенНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаИзмененияЦенНоменклатуры2_5"

	Дано Я открываю основную форму отчета "ДинамикаИзмененияЦенНоменклатуры2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаИзмененияЦенНоменклатуры2_5"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаИзмененияЦенНоменклатурыПоставщика"

	Дано Я открываю основную форму отчета "ДинамикаИзмененияЦенНоменклатурыПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаИзмененияЦенНоменклатурыПоставщика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаОбновленияЧерезКопию"

	Дано Я открываю основную форму отчета "ДинамикаОбновленияЧерезКопию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаОбновленияЧерезКопию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаПлановыхНачислений"

	Дано Я открываю основную форму отчета "ДинамикаПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаПлановыхНачислений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаПоказателейРаботыТорговыхПредставителей"

	Дано Я открываю основную форму отчета "ДинамикаПоказателейРаботыТорговыхПредставителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаПоказателейРаботыТорговыхПредставителей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Договорники"

	Дано Я открываю основную форму отчета "Договорники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Договорники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоступностьВариантовАнализаЦелевыхПоказателей"

	Дано Я открываю основную форму отчета "ДоступностьВариантовАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДоступностьВариантовАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДосьеКонтрагента"

	Дано Я открываю основную форму отчета "ДосьеКонтрагента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДосьеКонтрагента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДосьеПартнера"

	Дано Я открываю основную форму отчета "ДосьеПартнера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДосьеПартнера"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаИсполнительныхДокументов"

	Дано Я открываю основную форму отчета "ЖурналУчетаИсполнительныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаИсполнительныхДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаРозничнойПродажиАлкогольнойПродукции"

	Дано Я открываю основную форму отчета "ЖурналУчетаРозничнойПродажиАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаРозничнойПродажиАлкогольнойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаСчетовФактур"

	Дано Я открываю основную форму отчета "ЖурналУчетаСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаСчетовФактур"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаТМЦСданныхНаХранение"

	Дано Я открываю основную форму отчета "ЖурналУчетаТМЦСданныхНаХранение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаТМЦСданныхНаХранение"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналФискальныхОпераций"

	Дано Я открываю основную форму отчета "ЖурналФискальныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналФискальныхОпераций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаблокированныеЯчейки"

	Дано Я открываю основную форму отчета "ЗаблокированныеЯчейки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаблокированныеЯчейки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗависшиеЗадачи"

	Дано Я открываю основную форму отчета "ЗависшиеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗависшиеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаВидовРабочихЦентров"

	Дано Я открываю основную форму отчета "ЗагрузкаВидовРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗагрузкаВидовРабочихЦентров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаОборудованияПоМоделиГрафикаПроизводства"

	Дано Я открываю основную форму отчета "ЗагрузкаОборудованияПоМоделиГрафикаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗагрузкаОборудованияПоМоделиГрафикаПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаРабочихЦентров"

	Дано Я открываю основную форму отчета "ЗагрузкаРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗагрузкаРабочихЦентров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задания"

	Дано Я открываю основную форму отчета "Задания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задачи"

	Дано Я открываю основную форму отчета "Задачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадачиИстекающиеНаДату"

	Дано Я открываю основную форму отчета "ЗадачиИстекающиеНаДату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадачиИстекающиеНаДату"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадолженностьКлиентов"

	Дано Я открываю основную форму отчета "ЗадолженностьКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадолженностьКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадолженностьКлиентовПоСрокам"

	Дано Я открываю основную форму отчета "ЗадолженностьКлиентовПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадолженностьКлиентовПоСрокам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадолженностьПоВзысканиям"

	Дано Я открываю основную форму отчета "ЗадолженностьПоВзысканиям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадолженностьПоВзысканиям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадолженностьПоставщикам"

	Дано Я открываю основную форму отчета "ЗадолженностьПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадолженностьПоставщикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадолженностьПоставщикамПоСрокам"

	Дано Я открываю основную форму отчета "ЗадолженностьПоставщикамПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадолженностьПоставщикамПоСрокам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаймыСотрудникам"

	Дано Я открываю основную форму отчета "ЗаймыСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаймыСотрудникам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеСвойствПартнеров"

	Дано Я открываю основную форму отчета "ЗаполнениеСвойствПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаполнениеСвойствПартнеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполненностьСклада"

	Дано Я открываю основную форму отчета "ЗаполненностьСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаполненностьСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаявлениеДСВ1"

	Дано Я открываю основную форму отчета "ЗаявлениеДСВ1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаявлениеДСВ1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗначенияНефинансовыхПоказателей"

	Дано Я открываю основную форму отчета "ЗначенияНефинансовыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗначенияНефинансовыхПоказателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИзменениеABCXYZРаспределенияКлиентов"

	Дано Я открываю основную форму отчета "ИзменениеABCXYZРаспределенияКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИзменениеABCXYZРаспределенияКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИзменениеШтатногоРасписания"

	Дано Я открываю основную форму отчета "ИзменениеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИзменениеШтатногоРасписания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИмпортныеТоварыКОформлению"

	Дано Я открываю основную форму отчета "ИмпортныеТоварыКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИмпортныеТоварыКОформлению"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнвентарнаяКнигаОС"

	Дано Я открываю основную форму отчета "ИнвентарнаяКнигаОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИнвентарнаяКнигаОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИндексыСПАРКРиски"

	Дано Я открываю основную форму отчета "ИндексыСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИндексыСПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИндексыЦенНоменклатуры"

	Дано Я открываю основную форму отчета "ИндексыЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИндексыЦенНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИндексыЦенПоставщиков"

	Дано Я открываю основную форму отчета "ИндексыЦенПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИндексыЦенПоставщиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнформацияОбОрганизацииЕГАИС"

	Дано Я открываю основную форму отчета "ИнформацияОбОрганизацииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИнформацияОбОрганизацииЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеКонтрактовГОЗ"

	Дано Я открываю основную форму отчета "ИсполнениеКонтрактовГОЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеКонтрактовГОЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеПланаВнутреннихПотреблений"

	Дано Я открываю основную форму отчета "ИсполнениеПланаВнутреннихПотреблений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеПланаВнутреннихПотреблений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеПланаЗакупок"

	Дано Я открываю основную форму отчета "ИсполнениеПланаЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеПланаЗакупок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеПланаПродаж"

	Дано Я открываю основную форму отчета "ИсполнениеПланаПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеПланаПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеПланаПроизводства"

	Дано Я открываю основную форму отчета "ИсполнениеПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеПланаПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеПланаСборкиРазборки"

	Дано Я открываю основную форму отчета "ИсполнениеПланаСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеПланаСборкиРазборки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеРаспоряженийНаПеремещениеСборку"

	Дано Я открываю основную форму отчета "ИсполнениеРаспоряженийНаПеремещениеСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеРаспоряженийНаПеремещениеСборку"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнительныеДокументы"

	Дано Я открываю основную форму отчета "ИсполнительныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнительныеДокументы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИспользованиеСчетовИСубконтоМеждународныйУчет"

	Дано Я открываю основную форму отчета "ИспользованиеСчетовИСубконтоМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИспользованиеСчетовИСубконтоМеждународныйУчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИспользуемыеВнешниеРесурсы"

	Дано Я открываю основную форму отчета "ИспользуемыеВнешниеРесурсы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИспользуемыеВнешниеРесурсы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсторияСправок2ЕГАИС"

	Дано Я открываю основную форму отчета "ИсторияСправок2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсторияСправок2ЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КадроваяИсторияСотрудников"

	Дано Я открываю основную форму отчета "КадроваяИсторияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КадроваяИсторияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КалендарьСобытий"

	Дано Я открываю основную форму отчета "КалендарьСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КалендарьСобытий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КартаПродаж"

	Дано Я открываю основную форму отчета "КартаПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КартаПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаНМАМеждународныйУчет"

	Дано Я открываю основную форму отчета "КарточкаНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаНМАМеждународныйУчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаОбъектаЭксплуатации"

	Дано Я открываю основную форму отчета "КарточкаОбъектаЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаОбъектаЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаОСМеждународныйУчет"

	Дано Я открываю основную форму отчета "КарточкаОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаОСМеждународныйУчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаПартииПоВидамНалогообложения"

	Дано Я открываю основную форму отчета "КарточкаПартииПоВидамНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаПартииПоВидамНалогообложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовПоПереданнойВозвратнойТаре"

	Дано Я открываю основную форму отчета "КарточкаРасчетовПоПереданнойВозвратнойТаре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовПоПереданнойВозвратнойТаре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовПоПринятойВозвратнойТаре"

	Дано Я открываю основную форму отчета "КарточкаРасчетовПоПринятойВозвратнойТаре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовПоПринятойВозвратнойТаре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовСКлиентами"

	Дано Я открываю основную форму отчета "КарточкаРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовСКлиентами24"

	Дано Я открываю основную форму отчета "КарточкаРасчетовСКлиентами24"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовСКлиентами24"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовСПоставщиками"

	Дано Я открываю основную форму отчета "КарточкаРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовСПоставщиками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовСПоставщиками24"

	Дано Я открываю основную форму отчета "КарточкаРасчетовСПоставщиками24"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовСПоставщиками24"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаСубконто"

	Дано Я открываю основную форму отчета "КарточкаСубконто"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаСубконто"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаСчета"

	Дано Я открываю основную форму отчета "КарточкаСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаСчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаСчетаМеждународный"

	Дано Я открываю основную форму отчета "КарточкаСчетаМеждународный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаСчетаМеждународный"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаУчетаПоСтраховымВзносам"

	Дано Я открываю основную форму отчета "КарточкаУчетаПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаУчетаПоСтраховымВзносам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КвалификационныеКатегорииСотрудников"

	Дано Я открываю основную форму отчета "КвалификационныеКатегорииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КвалификационныеКатегорииСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаПокупок"

	Дано Я открываю основную форму отчета "КнигаПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаПокупок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаПродаж"

	Дано Я открываю основную форму отчета "КнигаПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаУчетаДепонентов"

	Дано Я открываю основную форму отчета "КнигаУчетаДепонентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаУчетаДепонентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаУчетаДоходовИРасходов"

	Дано Я открываю основную форму отчета "КнигаУчетаДоходовИРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаУчетаДоходовИРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаУчетаДоходовПатент"

	Дано Я открываю основную форму отчета "КнигаУчетаДоходовПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаУчетаДоходовПатент"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КодыМаркировкиДляДекларацииИСМП"

	Дано Я открываю основную форму отчета "КодыМаркировкиДляДекларацииИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КодыМаркировкиДляДекларацииИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтактнаяИнформация"

	Дано Я открываю основную форму отчета "КонтактнаяИнформация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтактнаяИнформация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтактнаяИнформацияСотрудников"

	Дано Я открываю основную форму отчета "КонтактнаяИнформацияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтактнаяИнформацияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтролируемыеСделкиДляВключенияВУведомление"

	Дано Я открываю основную форму отчета "КонтролируемыеСделкиДляВключенияВУведомление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтролируемыеСделкиДляВключенияВУведомление"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольВыданныхПодотчетномуЛицуАвансовПоЗаявке"

	Дано Я открываю основную форму отчета "КонтрольВыданныхПодотчетномуЛицуАвансовПоЗаявке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольВыданныхПодотчетномуЛицуАвансовПоЗаявке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольДвиженияПродукцииИМатериаловПоЭтапуПроизводства"

	Дано Я открываю основную форму отчета "КонтрольДвиженияПродукцииИМатериаловПоЭтапуПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольДвиженияПродукцииИМатериаловПоЭтапуПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольКорректностиЗаполненияОбъектовЭксплуатации"

	Дано Я открываю основную форму отчета "КонтрольКорректностиЗаполненияОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольКорректностиЗаполненияОбъектовЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольНомеровГТДТоваров"

	Дано Я открываю основную форму отчета "КонтрольНомеровГТДТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольНомеровГТДТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольОперацийСДенежнымиСредствами"

	Дано Я открываю основную форму отчета "КонтрольОперацийСДенежнымиСредствами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольОперацийСДенежнымиСредствами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольОформленияДокументовТовародвижений"

	Дано Я открываю основную форму отчета "КонтрольОформленияДокументовТовародвижений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольОформленияДокументовТовародвижений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольОформленияТоваровВПутиИНеотфактурованныхПоставок"

	Дано Я открываю основную форму отчета "КонтрольОформленияТоваровВПутиИНеотфактурованныхПоставок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольОформленияТоваровВПутиИНеотфактурованныхПоставок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольПередачиПродукцииДавальцу"

	Дано Я открываю основную форму отчета "КонтрольПередачиПродукцииДавальцу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольПередачиПродукцииДавальцу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольПередачиСырьяИМатериаловПереработчику"

	Дано Я открываю основную форму отчета "КонтрольПередачиСырьяИМатериаловПереработчику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольПередачиСырьяИМатериаловПереработчику"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольПередачТоваровМеждуОрганизациями"

	Дано Я открываю основную форму отчета "КонтрольПередачТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольПередачТоваровМеждуОрганизациями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольПлатежаНаСоответствие275ФЗ"

	Дано Я открываю основную форму отчета "КонтрольПлатежаНаСоответствие275ФЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольПлатежаНаСоответствие275ФЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольПоставкиПродукцииПереработчиком"

	Дано Я открываю основную форму отчета "КонтрольПоставкиПродукцииПереработчиком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольПоставкиПродукцииПереработчиком"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольПоставкиСырьяИМатериаловДавальцем"

	Дано Я открываю основную форму отчета "КонтрольПоставкиСырьяИМатериаловДавальцем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольПоставкиСырьяИМатериаловДавальцем"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонфликтыВОчередиЗаказовНаПроизводство"

	Дано Я открываю основную форму отчета "КонфликтыВОчередиЗаказовНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонфликтыВОчередиЗаказовНаПроизводство"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КредиторскаяЗадолженность"

	Дано Я открываю основную форму отчета "КредиторскаяЗадолженность"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КредиторскаяЗадолженность"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛимитыРасходаДенежныхСредств"

	Дано Я открываю основную форму отчета "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛимитыРасходаДенежныхСредствПоДаннымБюджетирования"

	Дано Я открываю основную форму отчета "ЛимитыРасходаДенежныхСредствПоДаннымБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЛимитыРасходаДенежныхСредствПоДаннымБюджетирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛицевыеСчетаСотрудников"

	Дано Я открываю основную форму отчета "ЛицевыеСчетаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЛицевыеСчетаСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МатериалыВПроизводствеПоСрокамГодности"

	Дано Я открываю основную форму отчета "МатериалыВПроизводствеПоСрокамГодности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МатериалыВПроизводствеПоСрокамГодности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МеждународныйОтчет"

	Дано Я открываю основную форму отчета "МеждународныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МеждународныйОтчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МестаИспользованияСсылок"

	Дано Я открываю основную форму отчета "МестаИспользованияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МестаИспользованияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МониторБюджетныхПроцессов"

	Дано Я открываю основную форму отчета "МониторБюджетныхПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МониторБюджетныхПроцессов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МониторЦелевыхПоказателей"

	Дано Я открываю основную форму отчета "МониторЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МониторЦелевыхПоказателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НаградыСотрудников"

	Дано Я открываю основную форму отчета "НаградыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НаградыСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НадежностьВходящегоНДССПАРКРиски"

	Дано Я открываю основную форму отчета "НадежностьВходящегоНДССПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НадежностьВходящегоНДССПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НадежностьДебиторовСПАРКРиски"

	Дано Я открываю основную форму отчета "НадежностьДебиторовСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НадежностьДебиторовСПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НаличиеСчетовФактур"

	Дано Я открываю основную форму отчета "НаличиеСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НаличиеСчетовФактур"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НалогиИВзносыКратко"

	Дано Я открываю основную форму отчета "НалогиИВзносыКратко"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НалогиИВзносыКратко"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаСписка"

	Дано Я открываю основную форму отчета "НастройкаСписка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НастройкаСписка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиПрограммыЗарплатаКадры"

	Дано Я открываю основную форму отчета "НастройкиПрограммыЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НастройкиПрограммыЗарплатаКадры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НачисленныеДоходыВОтчетахПоНДФЛ"

	Дано Я открываю основную форму отчета "НачисленныеДоходыВОтчетахПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НачисленныеДоходыВОтчетахПоНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НачисленныеИПолученныеДоходыВОтчетахПоНДФЛ"

	Дано Я открываю основную форму отчета "НачисленныеИПолученныеДоходыВОтчетахПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НачисленныеИПолученныеДоходыВОтчетахПоНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НеобработанныеТТНЕГАИС"

	Дано Я открываю основную форму отчета "НеобработанныеТТНЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НеобработанныеТТНЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборачиваемостьЗапасов"

	Дано Я открываю основную форму отчета "ОборачиваемостьЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборачиваемостьЗапасов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотнаяВедомостьБюджетирования"

	Дано Я открываю основную форму отчета "ОборотнаяВедомостьБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотнаяВедомостьБюджетирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотноСальдоваяВедомость"

	Дано Я открываю основную форму отчета "ОборотноСальдоваяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотноСальдоваяВедомость"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотноСальдоваяВедомостьАктивовПассивов"

	Дано Я открываю основную форму отчета "ОборотноСальдоваяВедомостьАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотноСальдоваяВедомостьАктивовПассивов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотноСальдоваяВедомостьБюджетирования"

	Дано Я открываю основную форму отчета "ОборотноСальдоваяВедомостьБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотноСальдоваяВедомостьБюджетирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотноСальдоваяВедомостьПоСчету"

	Дано Я открываю основную форму отчета "ОборотноСальдоваяВедомостьПоСчету"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотноСальдоваяВедомостьПоСчету"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотыМеждуСубконто"

	Дано Я открываю основную форму отчета "ОборотыМеждуСубконто"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотыМеждуСубконто"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотыПоНДС"

	Дано Я открываю основную форму отчета "ОборотыПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотыПоНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотыСчета"

	Дано Я открываю основную форму отчета "ОборотыСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотыСчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбработанныеЧекиЕГАИС"

	Дано Я открываю основную форму отчета "ОбработанныеЧекиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбработанныеЧекиЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбразованияСотрудников"

	Дано Я открываю основную форму отчета "ОбразованияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбразованияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбъемНенужныхФайлов"

	Дано Я открываю основную форму отчета "ОбъемНенужныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбъемНенужныхФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОплатаЗаявокНаРасходованиеДенежныхСредств"

	Дано Я открываю основную форму отчета "ОплатаЗаявокНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОплатаЗаявокНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОрганизационнаяСтруктура"

	Дано Я открываю основную форму отчета "ОрганизационнаяСтруктура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОрганизационнаяСтруктура"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиАкцизныхМарокЕГАИС"

	Дано Я открываю основную форму отчета "ОстаткиАкцизныхМарокЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиАкцизныхМарокЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму отчета "ОстаткиАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиИДвиженияДенежныхСредствВКассахККМ"

	Дано Я открываю основную форму отчета "ОстаткиИДвиженияДенежныхСредствВКассахККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиИДвиженияДенежныхСредствВКассахККМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиИДоступностьТоваров"

	Дано Я открываю основную форму отчета "ОстаткиИДоступностьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиИДоступностьТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиОтпусков"

	Дано Я открываю основную форму отчета "ОстаткиОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиОтпусков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиПрослеживаемыхТоваровВСоставеОСНепринятыхКУчету"

	Дано Я открываю основную форму отчета "ОстаткиПрослеживаемыхТоваровВСоставеОСНепринятыхКУчету"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиПрослеживаемыхТоваровВСоставеОСНепринятыхКУчету"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТМЦВЭксплуатации"

	Дано Я открываю основную форму отчета "ОстаткиТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТМЦВЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТМЦВЭксплуатацииУТ"

	Дано Я открываю основную форму отчета "ОстаткиТМЦВЭксплуатацииУТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТМЦВЭксплуатацииУТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваровОрганизаций"

	Дано Я открываю основную форму отчета "ОстаткиТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваровОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваровПереданныхНаКомиссию"

	Дано Я открываю основную форму отчета "ОстаткиТоваровПереданныхНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваровПереданныхНаКомиссию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваровПереданныхПереработчикам"

	Дано Я открываю основную форму отчета "ОстаткиТоваровПереданныхПереработчикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваровПереданныхПереработчикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваровПоСрокамХранения"

	Дано Я открываю основную форму отчета "ОстаткиТоваровПоСрокамХранения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваровПоСрокамХранения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваровПринятыхНаКомиссию"

	Дано Я открываю основную форму отчета "ОстаткиТоваровПринятыхНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваровПринятыхНаКомиссию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтклонениеЗаказаФактаОтКалькуляции"

	Дано Я открываю основную форму отчета "ОтклонениеЗаказаФактаОтКалькуляции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтклонениеЗаказаФактаОтКалькуляции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтклоненияВыпускаПродукцииОтГрафика"

	Дано Я открываю основную форму отчета "ОтклоненияВыпускаПродукцииОтГрафика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтклоненияВыпускаПродукцииОтГрафика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтклоненияОтУсловийЗакупок"

	Дано Я открываю основную форму отчета "ОтклоненияОтУсловийЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтклоненияОтУсловийЗакупок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтклоненияОтУсловийПродаж"

	Дано Я открываю основную форму отчета "ОтклоненияОтУсловийПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтклоненияОтУсловийПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтпускаСотрудников"

	Дано Я открываю основную форму отчета "ОтпускаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтпускаСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтражениеЗарплатыВФинансовомУчете"

	Дано Я открываю основную форму отчета "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтрицательныеОстаткиТоваровИРезервовОрганизаций"

	Дано Я открываю основную форму отчета "ОтрицательныеОстаткиТоваровИРезервовОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтрицательныеОстаткиТоваровИРезервовОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтрицательныеОстаткиТоваровОрганизаций"

	Дано Я открываю основную форму отчета "ОтрицательныеОстаткиТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтрицательныеОстаткиТоваровОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтчетПоНекорректнымКонтрагентам"

	Дано Я открываю основную форму отчета "ОтчетПоНекорректнымКонтрагентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтчетПоНекорректнымКонтрагентам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтчетПоПроводкам"

	Дано Я открываю основную форму отчета "ОтчетПоПроводкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтчетПоПроводкам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтчетыПоСотрудникам"

	Дано Я открываю основную форму отчета "ОтчетыПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтчетыПоСотрудникам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОформлениеИзлишковНедостачТоваров"

	Дано Я открываю основную форму отчета "ОформлениеИзлишковНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОформлениеИзлишковНедостачТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОформлениеОтчетовКомитенту"

	Дано Я открываю основную форму отчета "ОформлениеОтчетовКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОформлениеОтчетовКомитенту"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаПроизводительности"

	Дано Я открываю основную форму отчета "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаРентабельностиПродаж"

	Дано Я открываю основную форму отчета "ОценкаРентабельностиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаРентабельностиПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаРентабельностиПродаж2_5"

	Дано Я открываю основную форму отчета "ОценкаРентабельностиПродаж2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаРентабельностиПродаж2_5"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаРискаНалоговойПроверки"

	Дано Я открываю основную форму отчета "ОценкаРискаНалоговойПроверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаРискаНалоговойПроверки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОшибкиВДанныхРаспределенияОстатковНЗП"

	Дано Я открываю основную форму отчета "ОшибкиВДанныхРаспределенияОстатковНЗП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОшибкиВДанныхРаспределенияОстатковНЗП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОшибкиНастройкиШаблоновПроводок"

	Дано Я открываю основную форму отчета "ОшибкиНастройкиШаблоновПроводок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОшибкиНастройкиШаблоновПроводок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОшибкиПубликацииКабинетСотрудника"

	Дано Я открываю основную форму отчета "ОшибкиПубликацииКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОшибкиПубликацииКабинетСотрудника"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОшибкиРасчетаКалькуляцииПродукции"

	Дано Я открываю основную форму отчета "ОшибкиРасчетаКалькуляцииПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОшибкиРасчетаКалькуляцииПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОшибкиУточненияСчетов"

	Дано Я открываю основную форму отчета "ОшибкиУточненияСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОшибкиУточненияСчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПараметрыПроизводственныхОпераций"

	Дано Я открываю основную форму отчета "ПараметрыПроизводственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПараметрыПроизводственныхОпераций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПартииВПроизводстве"

	Дано Я открываю основную форму отчета "ПартииВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПартииВПроизводстве"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПартнерыКоторымОтгрузкаЗапрещена"

	Дано Я открываю основную форму отчета "ПартнерыКоторымОтгрузкаЗапрещена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПартнерыКоторымОтгрузкаЗапрещена"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПаспортКонтракта"

	Дано Я открываю основную форму отчета "ПаспортКонтракта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПаспортКонтракта"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереданнаяВозвратнаяТара"

	Дано Я открываю основную форму отчета "ПереданнаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПереданнаяВозвратнаяТара"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереданныеВАрендуОС"

	Дано Я открываю основную форму отчета "ПереданныеВАрендуОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПереданныеВАрендуОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПередачаМатериаловПоЗаказу"

	Дано Я открываю основную форму отчета "ПередачаМатериаловПоЗаказу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПередачаМатериаловПоЗаказу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПересечениеПравилРасчетаРезервовПодОбесценение"

	Дано Я открываю основную форму отчета "ПересечениеПравилРасчетаРезервовПодОбесценение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПересечениеПравилРасчетаРезервовПодОбесценение"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПересеченияСегментаНоменклатуры"

	Дано Я открываю основную форму отчета "ПересеченияСегментаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПересеченияСегментаНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПересеченияСегментаПартнеров"

	Дано Я открываю основную форму отчета "ПересеченияСегментаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПересеченияСегментаПартнеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПересеченияШтрихкодовНоменклатурыСоСпецКодами"

	Дано Я открываю основную форму отчета "ПересеченияШтрихкодовНоменклатурыСоСпецКодами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПересеченияШтрихкодовНоменклатурыСоСпецКодами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаСправкаОСреднемЗаработке"

	Дано Я открываю основную форму отчета "ПечатнаяФормаСправкаОСреднемЗаработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаСправкаОСреднемЗаработке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ1"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ11"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ11"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ1а"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ1а"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ1а"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ5"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ5"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ5а"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ5а"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ5а"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ6"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ6"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ6а"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ6а"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ6а"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ8"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ8"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ8"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ8а"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ8а"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ8а"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ9"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ9"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ9"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТ9а"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТ9а"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТ9а"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатнаяФормаТрудовойДоговорМикропредприятий"

	Дано Я открываю основную форму отчета "ПечатнаяФормаТрудовойДоговорМикропредприятий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПечатнаяФормаТрудовойДоговорМикропредприятий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановаяИФактическаяСебестоимостьВыпущеннойПродукции"

	Дано Я открываю основную форму отчета "ПлановаяИФактическаяСебестоимостьВыпущеннойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановаяИФактическаяСебестоимостьВыпущеннойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановаяИФактическаяСебестоимостьПродукции"

	Дано Я открываю основную форму отчета "ПлановаяИФактическаяСебестоимостьПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановаяИФактическаяСебестоимостьПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановаяПотребностьВВидахРЦ"

	Дано Я открываю основную форму отчета "ПлановаяПотребностьВВидахРЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановаяПотребностьВВидахРЦ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановаяПотребностьВМатериалах"

	Дано Я открываю основную форму отчета "ПлановаяПотребностьВМатериалах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановаяПотребностьВМатериалах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановаяПотребностьВПолуфабрикатах"

	Дано Я открываю основную форму отчета "ПлановаяПотребностьВПолуфабрикатах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановаяПотребностьВПолуфабрикатах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановаяПотребностьВТрудовыхРесурсах"

	Дано Я открываю основную форму отчета "ПлановаяПотребностьВТрудовыхРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановаяПотребностьВТрудовыхРесурсах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановаяСебестоимостьПродукции"

	Дано Я открываю основную форму отчета "ПлановаяСебестоимостьПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановаяСебестоимостьПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановыеИФактическиеЗатратыПеределов"

	Дано Я открываю основную форму отчета "ПлановыеИФактическиеЗатратыПеределов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановыеИФактическиеЗатратыПеределов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановыеИФактическиеНормативыПроизводственныхРасходов"

	Дано Я открываю основную форму отчета "ПлановыеИФактическиеНормативыПроизводственныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановыеИФактическиеНормативыПроизводственныхРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановыеУдержанияСотрудников"

	Дано Я открываю основную форму отчета "ПлановыеУдержанияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановыеУдержанияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланПроизводстваПродукцииИПолуфабрикатов"

	Дано Я открываю основную форму отчета "ПланПроизводстваПродукцииИПолуфабрикатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланПроизводстваПродукцииИПолуфабрикатов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализМатериаловРаботВСебестоимостиВыпущеннойПродукции"

	Дано Я открываю основную форму отчета "ПланФактныйАнализМатериаловРаботВСебестоимостиВыпущеннойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализМатериаловРаботВСебестоимостиВыпущеннойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализОплатИНачисленийПоАренде"

	Дано Я открываю основную форму отчета "ПланФактныйАнализОплатИНачисленийПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализОплатИНачисленийПоАренде"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству"

	Дано Я открываю основную форму отчета "ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализРаботыТорговыхПредставителейПоСумме"

	Дано Я открываю основную форму отчета "ПланФактныйАнализРаботыТорговыхПредставителейПоСумме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализРаботыТорговыхПредставителейПоСумме"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализФинансовыхИнструментов"

	Дано Я открываю основную форму отчета "ПланФактныйАнализФинансовыхИнструментов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализФинансовыхИнструментов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализФинансовыхИнструментовУТ"

	Дано Я открываю основную форму отчета "ПланФактныйАнализФинансовыхИнструментовУТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализФинансовыхИнструментовУТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлатежнаяДисциплинаКлиентов"

	Дано Я открываю основную форму отчета "ПлатежнаяДисциплинаКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлатежнаяДисциплинаКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлатежнаяДисциплинаКлиентов24"

	Дано Я открываю основную форму отчета "ПлатежнаяДисциплинаКлиентов24"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлатежнаяДисциплинаКлиентов24"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПовторныеПродажи"

	Дано Я открываю основную форму отчета "ПовторныеПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПовторныеПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Подработки"

	Дано Я открываю основную форму отчета "Подработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Подработки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоступленияБезДокументовГИСМ"

	Дано Я открываю основную форму отчета "ПоступленияБезДокументовГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПоступленияБезДокументовГИСМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПотребностиКФормированиюЭтаповПроизводства"

	Дано Я открываю основную форму отчета "ПотребностиКФормированиюЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПотребностиКФормированиюЭтаповПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПотребностьВМатериалахПоМоделиГрафикаПроизводства"

	Дано Я открываю основную форму отчета "ПотребностьВМатериалахПоМоделиГрафикаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПотребностьВМатериалахПоМоделиГрафикаПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПраваДоступа"

	Дано Я открываю основную форму отчета "ПраваДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПраваДоступа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрайсЛист"

	Дано Я открываю основную форму отчета "ПрайсЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрайсЛист"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрайсЛист2_5"

	Дано Я открываю основную форму отчета "ПрайсЛист2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрайсЛист2_5"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрайсЛистДляПриемаЗаказов"

	Дано Я открываю основную форму отчета "ПрайсЛистДляПриемаЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрайсЛистДляПриемаЗаказов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПредметыКонтролируемыхСделок"

	Дано Я открываю основную форму отчета "ПредметыКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПредметыКонтролируемыхСделок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрименениеПравилаРасчетаРезервовПодОбесценение"

	Дано Я открываю основную форму отчета "ПрименениеПравилаРасчетаРезервовПодОбесценение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрименениеПравилаРасчетаРезервовПодОбесценение"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрименениеСерииНоменклатуры"

	Дано Я открываю основную форму отчета "ПрименениеСерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрименениеСерииНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПримененныеСкидкиВДокументе"

	Дано Я открываю основную форму отчета "ПримененныеСкидкиВДокументе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПримененныеСкидкиВДокументе"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПринятаяВозвратнаяТара"

	Дано Я открываю основную форму отчета "ПринятаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПринятаяВозвратнаяТара"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПричиныЗапретаОтгрузки"

	Дано Я открываю основную форму отчета "ПричиныЗапретаОтгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПричиныЗапретаОтгрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроблемыПроверкиКонтрагентов"

	Дано Я открываю основную форму отчета "ПроблемыПроверкиКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроблемыПроверкиКонтрагентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаСвязейПоказателейБюджетов"

	Дано Я открываю основную форму отчета "ПроверкаСвязейПоказателейБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроверкаСвязейПоказателейБюджетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаЦелостностиТома"

	Дано Я открываю основную форму отчета "ПроверкаЦелостностиТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроверкаЦелостностиТома"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогрессОбновленияОбластейДанных"

	Дано Я открываю основную форму отчета "ПрогрессОбновленияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОбновленияОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогрессОтложенногоОбновления"

	Дано Я открываю основную форму отчета "ПрогрессОтложенногоОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОтложенногоОбновления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПродажиМеждуОрганизациями"

	Дано Я открываю основную форму отчета "ПродажиМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПродажиМеждуОрганизациями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПродажиСравнениеАналогичныхПериодов"

	Дано Я открываю основную форму отчета "ПродажиСравнениеАналогичныхПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПродажиСравнениеАналогичныхПериодов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПродажиСравнениеДвухПериодов"

	Дано Я открываю основную форму отчета "ПродажиСравнениеДвухПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПродажиСравнениеДвухПериодов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроизводительностьРаботниковСклада"

	Дано Я открываю основную форму отчета "ПроизводительностьРаботниковСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроизводительностьРаботниковСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроизводственныеЗатраты"

	Дано Я открываю основную форму отчета "ПроизводственныеЗатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроизводственныеЗатраты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроизводственныеЗатратыПоПартиямПроизводства"

	Дано Я открываю основную форму отчета "ПроизводственныеЗатратыПоПартиямПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроизводственныеЗатратыПоПартиямПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроизводственныеЗатратыПостатейные"

	Дано Я открываю основную форму отчета "ПроизводственныеЗатратыПостатейные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроизводственныеЗатратыПостатейные"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроизводственныеЗатратыТМЦ"

	Дано Я открываю основную форму отчета "ПроизводственныеЗатратыТМЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроизводственныеЗатратыТМЦ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПросроченныеДействияСПечатнымиФормами"

	Дано Я открываю основную форму отчета "ПросроченныеДействияСПечатнымиФормами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПросроченныеДействияСПечатнымиФормами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПросроченныеЗадачи"

	Дано Я открываю основную форму отчета "ПросроченныеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПросроченныеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПубликуемыеТорговыеПредложения"

	Дано Я открываю основную форму отчета "ПубликуемыеТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПубликуемыеТорговыеПредложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РазвернутоеСальдоПоВидамЗапасовИНомерамГТД"

	Дано Я открываю основную форму отчета "РазвернутоеСальдоПоВидамЗапасовИНомерамГТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РазвернутоеСальдоПоВидамЗапасовИНомерамГТД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаспределениеТорговыхПредставителей"

	Дано Я открываю основную форму отчета "РаспределениеТорговыхПредставителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РаспределениеТорговыхПредставителей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыМеждуОрганизациями"

	Дано Я открываю основную форму отчета "РасчетыМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыМеждуОрганизациями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСКлиентами"

	Дано Я открываю основную форму отчета "РасчетыСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСПартнерами"

	Дано Я открываю основную форму отчета "РасчетыСПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСПартнерами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСПоставщиками"

	Дано Я открываю основную форму отчета "РасчетыСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСПоставщиками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Расшифровка4ФСС"

	Дано Я открываю основную форму отчета "Расшифровка4ФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Расшифровка4ФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Расшифровка6_НДФЛ"

	Дано Я открываю основную форму отчета "Расшифровка6_НДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Расшифровка6_НДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Расшифровка6НДФЛ"

	Дано Я открываю основную форму отчета "Расшифровка6НДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Расшифровка6НДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаПоказателейНДС"

	Дано Я открываю основную форму отчета "РасшифровкаПоказателейНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаПоказателейНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаПоступлениеМатериаловВПроизводство"

	Дано Я открываю основную форму отчета "РасшифровкаПоступлениеМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаПоступлениеМатериаловВПроизводство"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаПоступленийПоНоменклатуре"

	Дано Я открываю основную форму отчета "РасшифровкаПоступленийПоНоменклатуре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаПоступленийПоНоменклатуре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаРасходовНаПроизводство"

	Дано Я открываю основную форму отчета "РасшифровкаРасходовНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаРасходовНаПроизводство"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаРСВ"

	Дано Я открываю основную форму отчета "РасшифровкаРСВ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаРСВ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаРСВ1"

	Дано Я открываю основную форму отчета "РасшифровкаРСВ1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаРСВ1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаСостоянияВыполненияЗаказовПереработчикам"

	Дано Я открываю основную форму отчета "РасшифровкаСостоянияВыполненияЗаказовПереработчикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаСостоянияВыполненияЗаказовПереработчикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаСтатистики"

	Дано Я открываю основную форму отчета "РасшифровкаСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаСтатистики"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаСтоимостиПереработки"

	Дано Я открываю основную форму отчета "РасшифровкаСтоимостиПереработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаСтоимостиПереработки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаФормулыБюджетногоОтчета"

	Дано Я открываю основную форму отчета "РасшифровкаФормулыБюджетногоОтчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаФормулыБюджетногоОтчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкиБухгалтерскойОтчетности"

	Дано Я открываю основную форму отчета "РасшифровкиБухгалтерскойОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкиБухгалтерскойОтчетности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрИнформацииОбОбъектеОС"

	Дано Я открываю основную форму отчета "РегистрИнформацииОбОбъектеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегистрИнформацииОбОбъектеОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрНалоговогоУчетаПоНДФЛ"

	Дано Я открываю основную форму отчета "РегистрНалоговогоУчетаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегистрНалоговогоУчетаПоНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрНалоговогоУчетаФинРезультатовОтРеализацииАмортизируемогоИмущества"

	Дано Я открываю основную форму отчета "РегистрНалоговогоУчетаФинРезультатовОтРеализацииАмортизируемогоИмущества"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегистрНалоговогоУчетаФинРезультатовОтРеализацииАмортизируемогоИмущества"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрыНалоговогоУчета"

	Дано Я открываю основную форму отчета "РегистрыНалоговогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегистрыНалоговогоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеБумажныеФормы"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеБумажныеФормы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеБумажныеФормы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеВозвратНалога"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеВозвратНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеВозвратНалога"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеВыборНалоговогоОргана"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеВыборНалоговогоОргана"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеВыборНалоговогоОргана"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеВыборНалоговогоОрганаНДФЛ"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеВыборНалоговогоОрганаНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеВыборНалоговогоОрганаНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеВыдачаСправкиПоРасчетам"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеВыдачаСправкиПоРасчетам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеВыдачаСправкиПоРасчетам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеВыплатаДоходаЛицуНеИмеющемуПраваПолучения"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеВыплатаДоходаЛицуНеИмеющемуПраваПолучения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеВыплатаДоходаЛицуНеИмеющемуПраваПолучения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеВыплатыПодразделенийФизЛицам"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеВыплатыПодразделенийФизЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеВыплатыПодразделенийФизЛицам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеГибельИмущества"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеГибельИмущества"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеГибельИмущества"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеГибельТС"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеГибельТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеГибельТС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеДекларацияХарактеристикаОбъекта"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеДекларацияХарактеристикаОбъекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеДекларацияХарактеристикаОбъекта"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД1"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД2"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД3"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД4"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЖалоба"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЖалоба"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЖалоба"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЗакрытиеОбособленныхПодразделений"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЗакрытиеОбособленныхПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЗакрытиеОбособленныхПодразделений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЗапретПредставленияУполномоченнымиЛицами"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЗапретПредставленияУполномоченнымиЛицами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЗапретПредставленияУполномоченнымиЛицами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЗапросСведений"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЗапросСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЗапросСведений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЗачетНалога"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЗачетНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЗачетНалога"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЗаявлениеНаСубсидиюДляЗарплаты"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЗаявлениеНаСубсидиюДляЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЗаявлениеНаСубсидиюДляЗарплаты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЗаявлениеНаСубсидиюПрофилактика"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЗаявлениеНаСубсидиюПрофилактика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЗаявлениеНаСубсидиюПрофилактика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеИзменениеПараметраУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеИзменениеПараметраУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеИзменениеПараметраУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеИзменениеРегиональныхНалогов"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеИзменениеРегиональныхНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеИзменениеРегиональныхНалогов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеИзъятиеТС"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеИзъятиеТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеИзъятиеТС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеИсключениеПроверки"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеИсключениеПроверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеИсключениеПроверки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеКИК"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеКИК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеКИК"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеКонтролирующиеЛица"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеКонтролирующиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеКонтролирующиеЛица"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЛьготаПоНалогуНаИмущество"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЛьготаПоНалогуНаИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЛьготаПоНалогуНаИмущество"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЛьготаТранспортЗемля"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЛьготаТранспортЗемля"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЛьготаТранспортЗемля"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеНалоговаяЛьготаРегИнвестПроекты"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеНалоговаяЛьготаРегИнвестПроекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеНалоговаяЛьготаРегИнвестПроекты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеНевозможностьПредоставления"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеНевозможностьПредоставления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеНевозможностьПредоставления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеОбИзмененииРеквизитовСчета"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеОбИзмененииРеквизитовСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеОбИзмененииРеквизитовСчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеОбОткрытииЗакрытииСчета"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеОбОткрытииЗакрытииСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеОбОткрытииЗакрытииСчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеОДДС"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеОДДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеОДДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеОНаличииСчета"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеОНаличииСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеОНаличииСчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеОсвобождениеОтУплатыНДДДУС"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеОсвобождениеОтУплатыНДДДУС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеОсвобождениеОтУплатыНДДДУС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеОсвобождениеОтУплатыСтраховыхВзносов"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеОсвобождениеОтУплатыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеОсвобождениеОтУплатыСтраховыхВзносов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеОтказОтУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеОтказОтУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеОтказОтУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПередачаСообщенийОСуммахНалогов"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПередачаСообщенийОСуммахНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПередачаСообщенийОСуммахНалогов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПереходНаЕСХН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПереходНаЕСХН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПереходНаЕСХН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПереходНаУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПереходНаУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПереходНаУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПереходСНПД"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПереходСНПД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПереходСНПД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПолучениеДокументаНалоговогоРезидента"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПолучениеДокументаНалоговогоРезидента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПолучениеДокументаНалоговогоРезидента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПолучениеПатента"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПолучениеПатента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПолучениеПатента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПорядокИсчисленияАвансовПрибыль"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПорядокИсчисленияАвансовПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПорядокИсчисленияАвансовПрибыль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПорядокПредставленияДекларацииИмущество"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПорядокПредставленияДекларацииИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПорядокПредставленияДекларацииИмущество"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПорядокУплатыПрибыль"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПорядокУплатыПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПорядокУплатыПрибыль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПостановкаОбъектаНВОС"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПостановкаОбъектаНВОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПостановкаОбъектаНВОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПостановкаСнятиеВКачествеАгента"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПостановкаСнятиеВКачествеАгента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПостановкаСнятиеВКачествеАгента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПредоставлениеРассрочки"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПредоставлениеРассрочки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПредоставлениеРассрочки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПрекращениеЕСХН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПрекращениеЕСХН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПрекращениеЕСХН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПрекращениеПатент"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПрекращениеПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПрекращениеПатент"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПрекращениеУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПрекращениеУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПрекращениеУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеРанееПредставленныеДокументы"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеРанееПредставленныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеРанееПредставленныеДокументы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеРассрочкаПоНалогам"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеРассрочкаПоНалогам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеРассрочкаПоНалогам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеРеестрДокументовПодтверждающихЛьготы"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеРеестрДокументовПодтверждающихЛьготы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеРеестрДокументовПодтверждающихЛьготы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеРеестрЛьготИмущество"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеРеестрЛьготИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеРеестрЛьготИмущество"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеРеорганизацияЛиквидация"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеРеорганизацияЛиквидация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеРеорганизацияЛиквидация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеС_ИО"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеС_ИО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеС_ИО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСверкаРасчетовПоНалогам"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСверкаРасчетовПоНалогам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСверкаРасчетовПоНалогам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСогласиеНаИнформирование"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСогласиеНаИнформирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСогласиеНаИнформирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСогласиеНаРаскрытиеНалоговойТайны"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСогласиеНаРаскрытиеНалоговойТайны"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСогласиеНаРаскрытиеНалоговойТайны"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСогласованиеРасходовНДДДУС"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСогласованиеРасходовНДДДУС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСогласованиеРасходовНДДДУС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСозданиеОбособленныхПодразделений"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСозданиеОбособленныхПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСозданиеОбособленныхПодразделений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСообщениеОбУчастии"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСообщениеОбУчастии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСообщениеОбУчастии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСообщениеТранспортЗемля"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСообщениеТранспортЗемля"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСообщениеТранспортЗемля"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСубсидияПострадавшимМСП"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСубсидияПострадавшимМСП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСубсидияПострадавшимМСП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеТС1"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеТС1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеТС1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеТС2"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеТС2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеТС2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУ_ИО"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУ_ИО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУ_ИО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУменьшениеНалогаККТ"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУменьшениеНалогаККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУменьшениеНалогаККТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУменьшениеНалогаНаСтраховыеВзносы"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУменьшениеНалогаНаСтраховыеВзносы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУменьшениеНалогаНаСтраховыеВзносы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУтратаПраваПатент"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУтратаПраваПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУтратаПраваПатент"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУтратаПраваУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУтратаПраваУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУтратаПраваУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУчастникаСколковоОсвобождениеНалогообложения"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУчастникаСколковоОсвобождениеНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУчастникаСколковоОсвобождениеНалогообложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеФормаР11001"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеФормаР11001"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеФормаР11001"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеФормаР13001"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеФормаР13001"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеФормаР13001"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеФормаР13014"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеФормаР13014"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеФормаР13014"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеФормаР14001"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеФормаР14001"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеФормаР14001"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеФормаР21001"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеФормаР21001"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеФормаР21001"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеФормаР24001"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеФормаР24001"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеФормаР24001"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЭлементДляВыпускаНовыхПатчей"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЭлементДляВыпускаНовыхПатчей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЭлементДляВыпускаНовыхПатчей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет3НДФЛ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет3НДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет3НДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет4аФСС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет4аФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет4аФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет4НДФЛ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет4НДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет4НДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет4ФСС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет4ФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет4ФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет6_НДФЛ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет6_НДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет6_НДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет6НДФЛ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет6НДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет6НДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАвансыИмущество"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАвансыИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАвансыИмущество"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАкцизыАлкоголь"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАкцизыАлкоголь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАкцизыАлкоголь"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАкцизыГСМ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАкцизыГСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАкцизыГСМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАкцизыНефтяноеСырье"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАкцизыНефтяноеСырье"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАкцизыНефтяноеСырье"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАкцизыПриложение1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАкцизыПриложение1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАкцизыПриложение1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАкцизыПриложение5"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАкцизыПриложение5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАкцизыПриложение5"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАкцизыПриложение7"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАкцизыПриложение7"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАкцизыПриложение7"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАкцизыТабак"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАкцизыТабак"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАкцизыТабак"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоЗаявлениеОКорректировке"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоЗаявлениеОКорректировке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоЗаявлениеОКорректировке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение10"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение10"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение10"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение11"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение11"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение12"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение12"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение12"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение13"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение13"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение13"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение14"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение14"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение14"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение15"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение15"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение15"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение16"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение16"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение16"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение17"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение17"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение17"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение18"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение18"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение18"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение19"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение19"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение19"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение2"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение20"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение20"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение20"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение21"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение21"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение21"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение22"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение22"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение22"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение23"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение23"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение23"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение24"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение24"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение24"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение25"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение25"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение25"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение26"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение26"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение26"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение27"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение27"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение27"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение28"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение28"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение28"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение29"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение29"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение29"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение3"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение30"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение30"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение30"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение31"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение31"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение31"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение4"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение5"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение5"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение6"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение6"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение7"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение7"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение7"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение8"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение8"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение8"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение9"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение9"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение9"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоУведомлениеВыездногоОбслуживания"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоУведомлениеВыездногоОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоУведомлениеВыездногоОбслуживания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетБухОтчетность"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетБухОтчетность"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетБухОтчетность"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетБухОтчетностьМП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетБухОтчетностьМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетБухОтчетностьМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетБухОтчетностьСОНКО"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетБухОтчетностьСОНКО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетБухОтчетностьСОНКО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетВода"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетВода"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетВода"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетВодныеБиоресурсы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетВодныеБиоресурсы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетВодныеБиоресурсы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетВодныеБиоресурсыПрилов"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетВодныеБиоресурсыПрилов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетВодныеБиоресурсыПрилов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетДвижениеСредствПоСчетуВБанкеЗаПределамиРФ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетДвижениеСредствПоСчетуВБанкеЗаПределамиРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетДвижениеСредствПоСчетуВБанкеЗаПределамиРФ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетДекларацияОВоздействииНаОкружающуюСреду"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетДекларацияОВоздействииНаОкружающуюСреду"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетДекларацияОВоздействииНаОкружающуюСреду"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетДекларацияПлатаНВОС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетДекларацияПлатаНВОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетДекларацияПлатаНВОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетДеятельностьИнОргВРФ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетДеятельностьИнОргВРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетДеятельностьИнОргВРФ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетДоходыЗаПределамиРФ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетДоходыЗаПределамиРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетДоходыЗаПределамиРФ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетДоходыИностраннымОрганизациям"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетДоходыИностраннымОрганизациям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетДоходыИностраннымОрганизациям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетДоходыОтДеятельностиМузеяТеатраБиблиотеки"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетДоходыОтДеятельностиМузеяТеатраБиблиотеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетДоходыОтДеятельностиМузеяТеатраБиблиотеки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетДоходыОтТуристскоРекреационнойДеятельности"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетДоходыОтТуристскоРекреационнойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетДоходыОтТуристскоРекреационнойДеятельности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетЕСХН"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетЕСХН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетЕСХН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетЕУНД"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетЕУНД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетЕУНД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетЖивотныйМир"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетЖивотныйМир"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетЖивотныйМир"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетЖивотныйМирСведенияОВыданныхЛицензиях"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетЖивотныйМирСведенияОВыданныхЛицензиях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетЖивотныйМирСведенияОВыданныхЛицензиях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетЗаявлениеОВвозеТоваров"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетЗаявлениеОВвозеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетЗаявлениеОВвозеТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетЗемельныйНалог"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетЗемельныйНалог"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетЗемельныйНалог"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетИзвещениеОбОсвАвансовогоПлатежаАкциза"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетИзвещениеОбОсвАвансовогоПлатежаАкциза"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетИзвещениеОбОсвАвансовогоПлатежаАкциза"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетИзвещениеОбУплатеАвансовогоПлатежаАкциза"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетИзвещениеОбУплатеАвансовогоПлатежаАкциза"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетИзвещениеОбУплатеАвансовогоПлатежаАкциза"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетИмущество"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетИмущество"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетИнОргНДСУслугиВЭлектроннойФорме"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетИнОргНДСУслугиВЭлектроннойФорме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетИнОргНДСУслугиВЭлектроннойФорме"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетИсполнениеКонтрактовГОЗ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетИсполнениеКонтрактовГОЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетИсполнениеКонтрактовГОЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетКоличествоТоваровПодлежащихУтилизации"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетКоличествоТоваровПодлежащихУтилизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетКоличествоТоваровПодлежащихУтилизации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетКосвенныеНалогиТамСоюз"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетКосвенныеНалогиТамСоюз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетКосвенныеНалогиТамСоюз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетНалогНаИгорныйБизнес"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетНалогНаИгорныйБизнес"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетНалогНаИгорныйБизнес"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетНДДУ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетНДДУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетНДДУ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетНДПИ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетНДПИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетНДПИ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетНДС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетНедра"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетНедра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетНедра"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетОтходыСубъектовМСП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетОтходыСубъектовМСП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетОтходыСубъектовМСП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПереченьЗаявленийОВвозеТоваров"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПереченьЗаявленийОВвозеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПереченьЗаявленийОВвозеТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПодтверждениеВидаДеятельности"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПодтверждениеВидаДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПодтверждениеВидаДеятельности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПодтверждениеРазмещенияОтчетаНИОКРвГИС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПодтверждениеРазмещенияОтчетаНИОКРвГИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПодтверждениеРазмещенияОтчетаНИОКРвГИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПрибыль"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПрибыль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПрибыльИностраннойОрганизации"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПрибыльИностраннойОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПрибыльИностраннойОрганизации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПрибыльСколковоРасчетНалоговойБазы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПрибыльСколковоРасчетНалоговойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПрибыльСколковоРасчетНалоговойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПрибыльСколковоРасчетПрибыли"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПрибыльСколковоРасчетПрибыли"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПрибыльСколковоРасчетПрибыли"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПрибыльСРП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПрибыльСРП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПрибыльСРП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПрослеживаемыеТоварыВвоз"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПрослеживаемыеТоварыВвоз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПрослеживаемыеТоварыВвоз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПрослеживаемыеТоварыОстатки"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПрослеживаемыеТоварыОстатки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПрослеживаемыеТоварыОстатки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПрослеживаемыеТоварыОтчетОбОперациях"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПрослеживаемыеТоварыОтчетОбОперациях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПрослеживаемыеТоварыОтчетОбОперациях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПрослеживаемыеТоварыПеремещение"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПрослеживаемыеТоварыПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПрослеживаемыеТоварыПеремещение"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРасчетПлатыОкрСредаСвод"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРасчетПлатыОкрСредаСвод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРасчетПлатыОкрСредаСвод"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРасчетПоОплатеЗаВоду"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРасчетПоОплатеЗаВоду"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРасчетПоОплатеЗаВоду"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРасчетПоСтраховымВзносам"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРасчетПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРасчетПоСтраховымВзносам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРасчетСовокупногоРазмераПрибыли"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРасчетСовокупногоРазмераПрибыли"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРасчетСовокупногоРазмераПрибыли"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРасчетЧистыхАктивов"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРасчетЧистыхАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРасчетЧистыхАктивов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРасчетЭкологическийСбор"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРасчетЭкологическийСбор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРасчетЭкологическийСбор"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРВ3"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРВ3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРВ3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрАкцизыВычетыВиноград"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрАкцизыВычетыВиноград"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрАкцизыВычетыВиноград"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрАкцизыВычетыВиноматериалы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрАкцизыВычетыВиноматериалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрАкцизыВычетыВиноматериалы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрАкцизыВычетыВиноматериалыВиногрИФруктСусло"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрАкцизыВычетыВиноматериалыВиногрИФруктСусло"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрАкцизыВычетыВиноматериалыВиногрИФруктСусло"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрАкцизыВычетыДенатурированныйЭтиловыйСпирт"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрАкцизыВычетыДенатурированныйЭтиловыйСпирт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрАкцизыВычетыДенатурированныйЭтиловыйСпирт"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрАкцизыВычетыЭтиловыйСпирт"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрАкцизыВычетыЭтиловыйСпирт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрАкцизыВычетыЭтиловыйСпирт"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрАкцизыПриложение1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрАкцизыПриложение1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрАкцизыПриложение1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрАкцизыПриложение2"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрАкцизыПриложение2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрАкцизыПриложение2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСДекларацииИТаможенныеДекларации23"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСДекларацииИТаможенныеДекларации23"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСДекларацииИТаможенныеДекларации23"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСДекларацииНаЭкспрессГрузы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСДекларацииНаЭкспрессГрузы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСДекларацииНаЭкспрессГрузы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСДокументыДляКомпенсацииНалога"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСДокументыДляКомпенсацииНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСДокументыДляКомпенсацииНалога"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение10"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение10"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение10"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение11"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение11"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение12"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение12"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение12"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение13"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение13"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение13"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение14"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение14"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение14"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение2"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение3"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение4"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение5"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение5"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение6"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение6"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение7"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение7"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение7"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение8"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение8"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение8"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрНДСПриложение9"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрНДСПриложение9"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрНДСПриложение9"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФНаПереработкуБензина"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФНаПереработкуБензина"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФНаПереработкуБензина"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФПоАвиационномуКеросину"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФПоАвиационномуКеросину"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФПоАвиационномуКеросину"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФПоБензинуИзДавальческогоСырья"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФПоБензинуИзДавальческогоСырья"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФПоБензинуИзДавальческогоСырья"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФПоБензинуИзСобственногоСырья"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФПоБензинуИзСобственногоСырья"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФПоБензинуИзСобственногоСырья"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФПоБензолуПараксилолуОртоксилолу"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФПоБензолуПараксилолуОртоксилолу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФПоБензолуПараксилолуОртоксилолу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФПоВиноматериалам"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФПоВиноматериалам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФПоВиноматериалам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФПоДенатурированномуЭтиловомуСпирту"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФПоДенатурированномуЭтиловомуСпирту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФПоДенатурированномуЭтиловомуСпирту"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФПоНефтяномуСырью"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФПоНефтяномуСырью"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФПоНефтяномуСырью"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФПоСреднимДистиллятам"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФПоСреднимДистиллятам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФПоСреднимДистиллятам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРеестрСФПоЭтиловомуСпирту"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРеестрСФПоЭтиловомуСпирту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРеестрСФПоЭтиловомуСпирту"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРозничныеЦеныНаТабак"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРозничныеЦеныНаТабак"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРозничныеЦеныНаТабак"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРСВ1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРСВ1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРСВ1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРСВ2"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРСВ2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРСВ2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСведенияОДолеДоходовОрганизацииПоСоцУслугам"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСведенияОДолеДоходовОрганизацииПоСоцУслугам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСведенияОДолеДоходовОрганизацииПоСоцУслугам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСведенияОДолеДоходовОтОбразовательнойИлиМедДеятельности"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСведенияОДолеДоходовОтОбразовательнойИлиМедДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСведенияОДолеДоходовОтОбразовательнойИлиМедДеятельности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСведенияОрублевыхСчетах"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСведенияОрублевыхСчетах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСведенияОрублевыхСчетах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСведенияОСчетахвВиностраннойВалюте"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСведенияОСчетахвВиностраннойВалюте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСведенияОСчетахвВиностраннойВалюте"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСоответствиеУсловийТруда"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСоответствиеУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСоответствиеУсловийТруда"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистика1Квотирование"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистика1Квотирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистика1Квотирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаБухОтчетность"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаБухОтчетность"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаБухОтчетность"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаПрочиеФормы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаПрочиеФормы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаПрочиеФормы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма11"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма11"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма11К"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма11К"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма11К"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма11НА"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма11НА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма11НА"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма11Сделка"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма11Сделка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма11Сделка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма11ТЭР"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма11ТЭР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма11ТЭР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма11ФСС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма11ФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма11ФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма12Строительство"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма12Строительство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма12Строительство"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма12Ф"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма12Ф"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма12Ф"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма14МЕТлом"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма14МЕТлом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма14МЕТлом"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма14ФОМС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма14ФОМС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма14ФОМС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма18КС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма18КС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма18КС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Автотранс"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Автотранс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Автотранс"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Администрация"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Администрация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Администрация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Алкоголь"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Алкоголь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Алкоголь"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1АлкогольОпт"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1АлкогольОпт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1АлкогольОпт"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Вывоз"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Вывоз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Вывоз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ВЭС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ВЭС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ВЭС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ГС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ГС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ГС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ДАП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ДАП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ДАП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ДАуслуги"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ДАуслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ДАуслуги"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ДМ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ДМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ДМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Закупки"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Закупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Закупки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1И"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1И"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1И"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ИЖС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ИЖС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ИЖС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ИПАвтогруз"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ИПАвтогруз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ИПАвтогруз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ИПмес"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ИПмес"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ИПмес"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ИПсвед"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ИПсвед"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ИПсвед"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ИПуслуги"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ИПуслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ИПуслуги"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Кадры"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Кадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Кадры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Контракт"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Контракт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Контракт"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Конъюнктура"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Конъюнктура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Конъюнктура"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1КонъюнктураОпт"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1КонъюнктураОпт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1КонъюнктураОпт"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1КСР"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1КСР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1КСР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1КСРКраткая"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1КСРКраткая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1КСРКраткая"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1КХ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1КХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1КХ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ЛХ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ЛХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ЛХ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1МБ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1МБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1МБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1МО"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1МО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1МО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1МС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1МС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1МС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1НАНО"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1НАНО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1НАНО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1НатураБМ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1НатураБМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1НатураБМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1НКО"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1НКО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1НКО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1П"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1П"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1П"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ПР"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ПР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ПР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Предприниматель"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Предприниматель"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Предприниматель"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1РабочаяСила"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1РабочаяСила"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1РабочаяСила"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1РЖ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1РЖ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1РЖ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1РП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1РП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1РП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1РЦ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1РЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1РЦ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1СОНКО"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1СОНКО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1СОНКО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1СХцены"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1СХцены"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1СХцены"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Т"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Т"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Т"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ТГМС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ТГМС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ТГМС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ТГС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ТГС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ТГС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ТЕП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ТЕП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ТЕП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Технология"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Технология"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Технология"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ТМС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ТМС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ТМС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ТОРГ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ТОРГ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ТОРГ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Тпроф"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Тпроф"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Тпроф"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ТРавто"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ТРавто"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ТРавто"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Туст"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Туст"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Туст"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Тчзп"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Тчзп"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Тчзп"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Услуги"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Услуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Услуги"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Учет"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Учет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Учет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Фермер"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Фермер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Фермер"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ФП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ФП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ФП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ФПинд"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ФПинд"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ФПинд"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ЦеныПриобр"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ЦеныПриобр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ЦеныПриобр"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ЦеныПроизв"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ЦеныПроизв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ЦеныПроизв"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма22ЖКХжилище"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма22ЖКХжилище"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма22ЖКХжилище"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма22ЖКХресурсы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма22ЖКХресурсы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма22ЖКХресурсы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма22ЖКХсв"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма22ЖКХсв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма22ЖКХсв"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма24Энергетика"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма24Энергетика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма24Энергетика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма26ЖКХ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма26ЖКХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма26ЖКХ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2ГСГЗ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2ГСГЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2ГСГЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2ДМ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2ДМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2ДМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2ДМДавальческоеСырье"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2ДМДавальческоеСырье"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2ДМДавальческоеСырье"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2ДМприл"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2ДМприл"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2ДМприл"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2МПинн"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2МПинн"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2МПинн"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2МС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2МС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2МС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2Наука"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2Наука"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2Наука"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2НаукаКр"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2НаукаКр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2НаукаКр"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2Приватизация"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2Приватизация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2Приватизация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2РЦ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2РЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2РЦ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2СБСеверСр"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2СБСеверСр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2СБСеверСр"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2ТПВоздух"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2ТПВоздух"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2ТПВоздух"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2ТПОхота"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2ТПОхота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2ТПОхота"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2ЦеныПриобр"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2ЦеныПриобр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2ЦеныПриобр"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма30"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма30"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма30"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма3Информ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма3Информ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма3Информ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма3Приватизация"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма3Приватизация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма3Приватизация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма3СБвывоз"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма3СБвывоз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма3СБвывоз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма3ТОРГПМ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма3ТОРГПМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма3ТОРГПМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма3Ф"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма3Ф"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма3Ф"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма4ДМ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма4ДМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма4ДМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма4Запасы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма4Запасы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма4Запасы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма4Инновация"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма4Инновация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма4Инновация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма4ОС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма4ОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма4ОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма4ТЭР"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма4ТЭР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма4ТЭР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма57Т"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма57Т"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма57Т"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма5З"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма5З"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма5З"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма65Автотранс"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма65Автотранс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма65Автотранс"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма6Нефть"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма6Нефть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма6Нефть"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма7Травматизм"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма7Травматизм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма7Травматизм"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма85К"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма85К"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма85К"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма8ВЭСТрусл"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма8ВЭСТрусл"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма8ВЭСТрусл"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма8ВЭСуслуги"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма8ВЭСуслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма8ВЭСуслуги"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма9КС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма9КС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма9КС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма9ФОМС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма9ФОМС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма9ФОМС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма9ФПФ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма9ФПФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма9ФПФ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма9ФСС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма9ФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма9ФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаДАППМ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаДАППМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаДАППМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаДАС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаДАС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаДАС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаДАФЛ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаДАФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаДАФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПЗдрав"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПЗдрав"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПЗдрав"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПКультура"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПКультура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПКультура"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПНаука"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПНаука"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПНаука"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПОбразование"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПОбразование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПОбразование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПСоц"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПСоц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПСоц"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПФизическаяКультураИСпорт"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПФизическаяКультураИСпорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПФизическаяКультураИСпорт"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаИАП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаИАП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаИАП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаИЖС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаИЖС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаИЖС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаМГОЗ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаМГОЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаМГОЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаМПм"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаМПм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаМПм"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаМПмикронатура"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаМПмикронатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаМПмикронатура"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаМПмсх"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаМПмсх"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаМПмсх"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаМПСП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаМПСП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаМПСП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП1Приложение3"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП1Приложение3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП1Приложение3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП1СХ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП1СХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП1СХ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП2"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП2инв"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП2инв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП2инв"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП2к"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП2к"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП2к"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП3"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП4"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП4НЗ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП4НЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП4НЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП5М"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП5М"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП5М"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП6"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП6"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаПМ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаПМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаПМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаПМ1Автогруз"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаПМ1Автогруз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаПМ1Автогруз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаПМПром"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаПМПром"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаПМПром"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаПМТорг"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаПМТорг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаПМТорг"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаПУслуги"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаПУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаПУслуги"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаС1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаС1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаС1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаС2"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаС2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаС2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаТЗВбюджет"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаТЗВбюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаТЗВбюджет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаТЗВМП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаТЗВМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаТЗВМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаТОРГм"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаТОРГм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаТОРГм"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтраховыеВзносыНСИПЗ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтраховыеВзносыНСИПЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтраховыеВзносыНСИПЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетТранспортныйНалог"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетТранспортныйНалог"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетТранспортныйНалог"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетУСН"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетУтилизационныйСбор"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетУтилизационныйСбор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетУтилизационныйСбор"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетУтилизационныйСборСамоходныеМашины"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетУтилизационныйСборСамоходныеМашины"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетУтилизационныйСборСамоходныеМашины"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетФинансовыйРезультатИнвестиционногоТоварищества"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетФинансовыйРезультатИнвестиционногоТоварищества"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетФинансовыйРезультатИнвестиционногоТоварищества"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетФорма1ГОЗ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетФорма1ГОЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетФорма1ГОЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетФорма2ТПОтходы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетФорма2ТПОтходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетФорма2ТПОтходы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетФорма2ТПРекультивация"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетФорма2ТПРекультивация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетФорма2ТПРекультивация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетФормаОН0001"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетФормаОН0001"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетФормаОН0001"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетФормаОН0002"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетФормаОН0002"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетФормаОН0002"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетФормаОН0003"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетФормаОН0003"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетФормаОН0003"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетФормаОР0001"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетФормаОР0001"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетФормаОР0001"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетЭкологическийКонтроль"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетЭкологическийКонтроль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетЭкологическийКонтроль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрДокументовПодтверждающихНалоговуюЛьготуПоНДС"

	Дано Я открываю основную форму отчета "РеестрДокументовПодтверждающихНалоговуюЛьготуПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрДокументовПодтверждающихНалоговуюЛьготуПоНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрКредитовИДепозитов"

	Дано Я открываю основную форму отчета "РеестрКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрКредитовИДепозитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрНормативноСправочнойИнформации"

	Дано Я открываю основную форму отчета "РеестрНормативноСправочнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрНормативноСправочнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрОС"

	Дано Я открываю основную форму отчета "РеестрОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрОС_МУ"

	Дано Я открываю основную форму отчета "РеестрОС_МУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрОС_МУ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрПлатежей"

	Дано Я открываю основную форму отчета "РеестрПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрПлатежей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрПолучателейСтраховогоОбеспечения"

	Дано Я открываю основную форму отчета "РеестрПолучателейСтраховогоОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрПолучателейСтраховогоОбеспечения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрСчетовФактурДляСверки"

	Дано Я открываю основную форму отчета "РеестрСчетовФактурДляСверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрСчетовФактурДляСверки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрТорговыхДокументов"

	Дано Я открываю основную форму отчета "РеестрТорговыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрТорговыхДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрУчетныхДанных"

	Дано Я открываю основную форму отчета "РеестрУчетныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрУчетныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрыСтимулирующихВыплатМедицинскимИСоциальнымРаботникам"

	Дано Я открываю основную форму отчета "РеестрыСтимулирующихВыплатМедицинскимИСоциальнымРаботникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрыСтимулирующихВыплатМедицинскимИСоциальнымРаботникам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатРаботыПравилПолученияФактическихДанных"

	Дано Я открываю основную форму отчета "РезультатРаботыПравилПолученияФактическихДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатРаботыПравилПолученияФактическихДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСогласованияЗакупки"

	Дано Я открываю основную форму отчета "РезультатыСогласованияЗакупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыСогласованияЗакупки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСогласованияЗаявкиНаВозвратТоваровОтКлиента"

	Дано Я открываю основную форму отчета "РезультатыСогласованияЗаявкиНаВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыСогласованияЗаявкиНаВозвратТоваровОтКлиента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСогласованияПродажи"

	Дано Я открываю основную форму отчета "РезультатыСогласованияПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыСогласованияПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСогласованияЦенНоменклатуры"

	Дано Я открываю основную форму отчета "РезультатыСогласованияЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыСогласованияЦенНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыТестирования"

	Дано Я открываю основную форму отчета "РезультатыТестирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыТестирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РекомендацииПоПовышениюСкоростиРасчетаЭкземпляраБюджета"

	Дано Я открываю основную форму отчета "РекомендацииПоПовышениюСкоростиРасчетаЭкземпляраБюджета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РекомендацииПоПовышениюСкоростиРасчетаЭкземпляраБюджета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СбалансированностьПлановУП"

	Дано Я открываю основную форму отчета "СбалансированностьПлановУП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СбалансированностьПлановУП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СбалансированностьПлановУТ"

	Дано Я открываю основную форму отчета "СбалансированностьПлановУТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СбалансированностьПлановУТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СведенияОбИзмененияхДляВоенкомата"

	Дано Я открываю основную форму отчета "СведенияОбИзмененияхДляВоенкомата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОбИзмененияхДляВоенкомата"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СведенияОКооперации"

	Дано Я открываю основную форму отчета "СведенияОКооперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОКооперации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму отчета "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОПользователях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаДанныхОУиБУ"

	Дано Я открываю основную форму отчета "СверкаДанныхОУиБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СверкаДанныхОУиБУ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаДанныхПартионногоУчетаИСебестоимости"

	Дано Я открываю основную форму отчета "СверкаДанныхПартионногоУчетаИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СверкаДанныхПартионногоУчетаИСебестоимости"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаОборотовМУиБУ"

	Дано Я открываю основную форму отчета "СверкаОборотовМУиБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СверкаОборотовМУиБУ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаОстатковОперативногоУчетаИСебестоимости"

	Дано Я открываю основную форму отчета "СверкаОстатковОперативногоУчетаИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СверкаОстатковОперативногоУчетаИСебестоимости"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаРасчетаАмортизации"

	Дано Я открываю основную форму отчета "СверкаРасчетаАмортизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СверкаРасчетаАмортизации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаРасчетовСПартнерами"

	Дано Я открываю основную форму отчета "СверкаРасчетовСПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СверкаРасчетовСПартнерами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СводныеПроводки"

	Дано Я открываю основную форму отчета "СводныеПроводки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СводныеПроводки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СводныйОтчетЕГАИС"

	Дано Я открываю основную форму отчета "СводныйОтчетЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СводныйОтчетЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СвязиПоказателейБюджетов"

	Дано Я открываю основную форму отчета "СвязиПоказателейБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СвязиПоказателейБюджетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СертификатыНоменклатурыСИстекающимСрокомДействия"

	Дано Я открываю основную форму отчета "СертификатыНоменклатурыСИстекающимСрокомДействия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СертификатыНоменклатурыСИстекающимСрокомДействия"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СобытияМониторингаСПАРКРиски"

	Дано Я открываю основную форму отчета "СобытияМониторингаСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СобытияМониторингаСПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхДействующие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхДействующие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхДействующие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхИстекающие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхИстекающие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхИстекающие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СоответствиеСчетовМеждународногоИРегламентированногоУчета"

	Дано Я открываю основную форму отчета "СоответствиеСчетовМеждународногоИРегламентированногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СоответствиеСчетовМеждународногоИРегламентированногоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СоставПродажи"

	Дано Я открываю основную форму отчета "СоставПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СоставПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СоставСегмента"

	Дано Я открываю основную форму отчета "СоставСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СоставСегмента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СоставыСемейСотрудников"

	Дано Я открываю основную форму отчета "СоставыСемейСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СоставыСемейСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеАссортимента"

	Дано Я открываю основную форму отчета "СостояниеАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеВыполненияДокументов"

	Дано Я открываю основную форму отчета "СостояниеВыполненияДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеВыполненияДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеВыполненияЗаказовНаПроизводство"

	Дано Я открываю основную форму отчета "СостояниеВыполненияЗаказовНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеВыполненияЗаказовНаПроизводство"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеКассовыхСмен"

	Дано Я открываю основную форму отчета "СостояниеКассовыхСмен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеКассовыхСмен"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеОбъектовЭксплуатации"

	Дано Я открываю основную форму отчета "СостояниеОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеОбъектовЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСКлиентами"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСКлиентамиСамообслуживание"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСКлиентамиСамообслуживание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСКлиентамиСамообслуживание"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСКомиссионерами"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСКомиссионерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСКомиссионерами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСКомитентами"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСКомитентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСКомитентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСПоставщиками"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСПоставщиками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеУзловОбъектовЭксплуатации"

	Дано Я открываю основную форму отчета "СостояниеУзловОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеУзловОбъектовЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеУзловОбъектовЭксплуатацииКонтекст"

	Дано Я открываю основную форму отчета "СостояниеУзловОбъектовЭксплуатацииКонтекст"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеУзловОбъектовЭксплуатацииКонтекст"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеУчетнойЗаписиDSS"

	Дано Я открываю основную форму отчета "СостояниеУчетнойЗаписиDSS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеУчетнойЗаписиDSS"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеШтатногоРасписания"

	Дано Я открываю основную форму отчета "СостояниеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеШтатногоРасписания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостоянияСотрудников"

	Дано Я открываю основную форму отчета "СостоянияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостоянияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СписокКонтролируемыхСделок"

	Дано Я открываю основную форму отчета "СписокКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СписокКонтролируемыхСделок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаПоОтпускам"

	Дано Я открываю основную форму отчета "СправкаПоОтпускам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаПоОтпускам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетАмортизации"

	Дано Я открываю основную форму отчета "СправкаРасчетАмортизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетАмортизации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетАмортизацииНМА_МУ"

	Дано Я открываю основную форму отчета "СправкаРасчетАмортизацииНМА_МУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетАмортизацииНМА_МУ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетАмортизацииНМА2_4"

	Дано Я открываю основную форму отчета "СправкаРасчетАмортизацииНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетАмортизацииНМА2_4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетАмортизацииОС_МУ"

	Дано Я открываю основную форму отчета "СправкаРасчетАмортизацииОС_МУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетАмортизацииОС_МУ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетАмортизацииОС2_4"

	Дано Я открываю основную форму отчета "СправкаРасчетАмортизацииОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетАмортизацииОС2_4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетАмортизационнойПремии"

	Дано Я открываю основную форму отчета "СправкаРасчетАмортизационнойПремии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетАмортизационнойПремии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетДвиженияРезервовПодОбесценение"

	Дано Я открываю основную форму отчета "СправкаРасчетДвиженияРезервовПодОбесценение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетДвиженияРезервовПодОбесценение"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетДолиНалоговойБазы"

	Дано Я открываю основную форму отчета "СправкаРасчетДолиНалоговойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетДолиНалоговойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетЗемельногоНалога"

	Дано Я открываю основную форму отчета "СправкаРасчетЗемельногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетЗемельногоНалога"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетНалогаНаИмущество"

	Дано Я открываю основную форму отчета "СправкаРасчетНалогаНаИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетНалогаНаИмущество"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетНалогаНаПрибыль"

	Дано Я открываю основную форму отчета "СправкаРасчетНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетНалогаНаПрибыль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетНалогаУСН"

	Дано Я открываю основную форму отчета "СправкаРасчетНалогаУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетНалогаУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетНачисленияПроцентныхРасходовДисконтирования"

	Дано Я открываю основную форму отчета "СправкаРасчетНачисленияПроцентныхРасходовДисконтирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетНачисленияПроцентныхРасходовДисконтирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетНормированияРасходов"

	Дано Я открываю основную форму отчета "СправкаРасчетНормированияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетНормированияРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетОтложенногоНалога"

	Дано Я открываю основную форму отчета "СправкаРасчетОтложенногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетОтложенногоНалога"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетПереоценкиВалютныхСредств"

	Дано Я открываю основную форму отчета "СправкаРасчетПереоценкиВалютныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетПереоценкиВалютныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетПересчетСтоимостиОтложенныхНалоговыхАктивовИОбязательств"

	Дано Я открываю основную форму отчета "СправкаРасчетПересчетСтоимостиОтложенныхНалоговыхАктивовИОбязательств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетПересчетСтоимостиОтложенныхНалоговыхАктивовИОбязательств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетПоказателяБюджетов"

	Дано Я открываю основную форму отчета "СправкаРасчетПоказателяБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетПоказателяБюджетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетПостоянныхИВременныхРазниц"

	Дано Я открываю основную форму отчета "СправкаРасчетПостоянныхИВременныхРазниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетПостоянныхИВременныхРазниц"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетПризнаниеРасходовПоАрендованнымОС"

	Дано Я открываю основную форму отчета "СправкаРасчетПризнаниеРасходовПоАрендованнымОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетПризнаниеРасходовПоАрендованнымОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетПризнанияРасходовПоНИОКР"

	Дано Я открываю основную форму отчета "СправкаРасчетПризнанияРасходовПоНИОКР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетПризнанияРасходовПоНИОКР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетРасходаПоНалогуНаПрибыль"

	Дано Я открываю основную форму отчета "СправкаРасчетРасходаПоНалогуНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетРасходаПоНалогуНаПрибыль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетРезервовПодОбесценениеЗапасов"

	Дано Я открываю основную форму отчета "СправкаРасчетРезервовПодОбесценениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетРезервовПодОбесценениеЗапасов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетРезервыОтпусков"

	Дано Я открываю основную форму отчета "СправкаРасчетРезервыОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетРезервыОтпусков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетРезервыПоСомнительнымДолгам"

	Дано Я открываю основную форму отчета "СправкаРасчетРезервыПоСомнительнымДолгам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетРезервыПоСомнительнымДолгам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетСписанияПроцентныхРасходовДисконтирования"

	Дано Я открываю основную форму отчета "СправкаРасчетСписанияПроцентныхРасходовДисконтирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетСписанияПроцентныхРасходовДисконтирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетТорговогоСбора"

	Дано Я открываю основную форму отчета "СправкаРасчетТорговогоСбора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетТорговогоСбора"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетТранспортногоНалога"

	Дано Я открываю основную форму отчета "СправкаРасчетТранспортногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетТранспортногоНалога"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетТранспортныхРасходов"

	Дано Я открываю основную форму отчета "СправкаРасчетТранспортныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетТранспортныхРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетУбытковПрошлыхЛет"

	Дано Я открываю основную форму отчета "СправкаРасчетУбытковПрошлыхЛет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетУбытковПрошлыхЛет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетФСС"

	Дано Я открываю основную форму отчета "СправкаРасчетФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетЭффектаИзмененияСтавокНалогаНаПрибыль"

	Дано Я открываю основную форму отчета "СправкаРасчетЭффектаИзмененияСтавокНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетЭффектаИзмененияСтавокНалогаНаПрибыль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкиСотрудников"

	Дано Я открываю основную форму отчета "СправкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкиСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправочноеРазмещениеНоменклатуры"

	Дано Я открываю основную форму отчета "СправочноеРазмещениеНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправочноеРазмещениеНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеГрафиковКредитовИДепозитов"

	Дано Я открываю основную форму отчета "СравнениеГрафиковКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнениеГрафиковКредитовИДепозитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеКалькуляцииИРесурснойСпецификации"

	Дано Я открываю основную форму отчета "СравнениеКалькуляцииИРесурснойСпецификации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнениеКалькуляцииИРесурснойСпецификации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеНМА"

	Дано Я открываю основную форму отчета "СравнениеНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнениеНМА"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеОС"

	Дано Я открываю основную форму отчета "СравнениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнениеОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеПлановыхИФактическихНачислений"

	Дано Я открываю основную форму отчета "СравнениеПлановыхИФактическихНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнениеПлановыхИФактическихНачислений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеСегментовПартнеров"

	Дано Я открываю основную форму отчета "СравнениеСегментовПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнениеСегментовПартнеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнительныйАнализДинамикиАссортиментаИПродаж"

	Дано Я открываю основную форму отчета "СравнительныйАнализДинамикиАссортиментаИПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнительныйАнализДинамикиАссортиментаИПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнительныйАнализПоказателейРаботыМенеджеров"

	Дано Я открываю основную форму отчета "СравнительныйАнализПоказателейРаботыМенеджеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнительныйАнализПоказателейРаботыМенеджеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтажиСотрудников"

	Дано Я открываю основную форму отчета "СтажиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтажиСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтатистикаПерсонала"

	Дано Я открываю основную форму отчета "СтатистикаПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтатистикаПерсонала"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтоимостьМатериаловИРаботСпецификации"

	Дано Я открываю основную форму отчета "СтоимостьМатериаловИРаботСпецификации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтоимостьМатериаловИРаботСпецификации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтраховыеВзносыПереданныеВПФР"

	Дано Я открываю основную форму отчета "СтраховыеВзносыПереданныеВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтраховыеВзносыПереданныеВПФР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтруктураЗаказаНаПроизводство2_2"

	Дано Я открываю основную форму отчета "СтруктураЗаказаНаПроизводство2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтруктураЗаказаНаПроизводство2_2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтруктураЗатратНаКапитализацию"

	Дано Я открываю основную форму отчета "СтруктураЗатратНаКапитализацию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтруктураЗатратНаКапитализацию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтруктураЗатратПоОС"

	Дано Я открываю основную форму отчета "СтруктураЗатратПоОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтруктураЗатратПоОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтруктураСерииНоменклатуры"

	Дано Я открываю основную форму отчета "СтруктураСерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтруктураСерииНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СхемаМаршрутнойКарты"

	Дано Я открываю основную форму отчета "СхемаМаршрутнойКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СхемаМаршрутнойКарты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТекущаяНаполненностьАссортимента"

	Дано Я открываю основную форму отчета "ТекущаяНаполненностьАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТекущаяНаполненностьАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТекущиеКвотыАссортимента"

	Дано Я открываю основную форму отчета "ТекущиеКвотыАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТекущиеКвотыАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварныйКалендарь"

	Дано Я открываю основную форму отчета "ТоварныйКалендарь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварныйКалендарь"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварныйОтчетТОРГ29"

	Дано Я открываю основную форму отчета "ТоварныйОтчетТОРГ29"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварныйОтчетТОРГ29"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыВЯчейках"

	Дано Я открываю основную форму отчета "ТоварыВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыВЯчейках"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыКОтбору"

	Дано Я открываю основную форму отчета "ТоварыКОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыКОтбору"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыКОтгрузке"

	Дано Я открываю основную форму отчета "ТоварыКОтгрузке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыКОтгрузке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыКПоступлению"

	Дано Я открываю основную форму отчета "ТоварыКПоступлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыКПоступлению"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыНаСкладахПоСрокамГодности"

	Дано Я открываю основную форму отчета "ТоварыНаСкладахПоСрокамГодности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыНаСкладахПоСрокамГодности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыПереданныеНаКомиссию"

	Дано Я открываю основную форму отчета "ТоварыПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыПереданныеНаКомиссию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыПереданныеПереработчикам"

	Дано Я открываю основную форму отчета "ТоварыПереданныеПереработчикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыПереданныеПереработчикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыПринятыеНаКомиссию"

	Дано Я открываю основную форму отчета "ТоварыПринятыеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыПринятыеНаКомиссию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыПринятыеНаХранение"

	Дано Я открываю основную форму отчета "ТоварыПринятыеНаХранение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыПринятыеНаХранение"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыСИстекающимиСертификатами"

	Дано Я открываю основную форму отчета "ТоварыСИстекающимиСертификатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыСИстекающимиСертификатами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыСхемыОбеспечения"

	Дано Я открываю основную форму отчета "ТоварыСхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыСхемыОбеспечения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТрудоваяДеятельностьСотрудников"

	Дано Я открываю основную форму отчета "ТрудоваяДеятельностьСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТрудоваяДеятельностьСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалитьОстаткиИДоступностьТоваров"

	Дано Я открываю основную форму отчета "УдалитьОстаткиИДоступностьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УдалитьОстаткиИДоступностьТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалитьПоступлениеИОтгрузкаТоваров"

	Дано Я открываю основную форму отчета "УдалитьПоступлениеИОтгрузкаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УдалитьПоступлениеИОтгрузкаТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалитьТоварныйКалендарь"

	Дано Я открываю основную форму отчета "УдалитьТоварныйКалендарь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УдалитьТоварныйКалендарь"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОтчет"

	Дано Я открываю основную форму отчета "УниверсальныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УниверсальныйОтчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УнифицированнаяФормаТ13"

	Дано Я открываю основную форму отчета "УнифицированнаяФормаТ13"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УнифицированнаяФормаТ13"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УнифицированнаяФормаТ2"

	Дано Я открываю основную форму отчета "УнифицированнаяФормаТ2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УнифицированнаяФормаТ2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправленческийБаланс"

	Дано Я открываю основную форму отчета "УправленческийБаланс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УправленческийБаланс"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправленческийБалансКонтроль"

	Дано Я открываю основную форму отчета "УправленческийБалансКонтроль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УправленческийБалансКонтроль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УсловияЗакупок"

	Дано Я открываю основную форму отчета "УсловияЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УсловияЗакупок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УсловияПродаж"

	Дано Я открываю основную форму отчета "УсловияПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УсловияПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УсловияПродаж2_5"

	Дано Я открываю основную форму отчета "УсловияПродаж2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УсловияПродаж2_5"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УчетныеПолитикиОрганизаций"

	Дано Я открываю основную форму отчета "УчетныеПолитикиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УчетныеПолитикиОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФактическаяСебестоимостьПродукции"

	Дано Я открываю основную форму отчета "ФактическаяСебестоимостьПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ФактическаяСебестоимостьПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФактическиеОтпускаСотрудников"

	Дано Я открываю основную форму отчета "ФактическиеОтпускаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ФактическиеОтпускаСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФинансовоеСостояние"

	Дано Я открываю основную форму отчета "ФинансовоеСостояние"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ФинансовоеСостояние"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФинансовыйАнализ"

	Дано Я открываю основную форму отчета "ФинансовыйАнализ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ФинансовыйАнализ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ХодВыполненияПроизводственныхОпераций"

	Дано Я открываю основную форму отчета "ХодВыполненияПроизводственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ХодВыполненияПроизводственныхОпераций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ХодРемонтныхМероприятий"

	Дано Я открываю основную форму отчета "ХодРемонтныхМероприятий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ХодРемонтныхМероприятий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ШахматнаяВедомость"

	Дано Я открываю основную форму отчета "ШахматнаяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ШахматнаяВедомость"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ШахматнаяВедомостьМеждународный"

	Дано Я открываю основную форму отчета "ШахматнаяВедомостьМеждународный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ШахматнаяВедомостьМеждународный"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ШтатноеРасписание"

	Дано Я открываю основную форму отчета "ШтатноеРасписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ШтатноеРасписание"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ШтатноеРасписаниеНачисления"

	Дано Я открываю основную форму отчета "ШтатноеРасписаниеНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ШтатноеРасписаниеНачисления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЭффективностьСделокСКлиентами"

	Дано Я открываю основную форму отчета "ЭффективностьСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЭффективностьСделокСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АвтоматическоеИзвлечениеТекстов"

	Дано Я открываю основную форму обработки "АвтоматическоеИзвлечениеТекстов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АвтоматическоеИзвлечениеТекстов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АктивныеЗаказыСУЗ"

	Дано Я открываю основную форму обработки "АктивныеЗаказыСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АктивныеЗаказыСУЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АктивныеПользователи"

	Дано Я открываю основную форму обработки "АктивныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АктивныеПользователи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализНДФЛКВозврату"

	Дано Я открываю основную форму обработки "АнализНДФЛКВозврату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АнализНДФЛКВозврату"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АрхивированиеУдалениеЧековККМ"

	Дано Я открываю основную форму обработки "АрхивированиеУдалениеЧековККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АрхивированиеУдалениеЧековККМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БизнесСеть"

	Дано Я открываю основную форму обработки "БизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки БизнесСеть"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БлокировкаРаботыПользователей"

	Дано Я открываю основную форму обработки "БлокировкаРаботыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки БлокировкаРаботыПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "ВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВводКорректировкиЗаказаМатериалов"

	Дано Я открываю основную форму обработки "ВводКорректировкиЗаказаМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВводКорректировкиЗаказаМатериалов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВводФактаПоМаршрутномуЛисту"

	Дано Я открываю основную форму обработки "ВводФактаПоМаршрутномуЛисту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВводФактаПоМаршрутномуЛисту"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВиртуальнаяАгрегацияУпаковокИСМП"

	Дано Я открываю основную форму обработки "ВиртуальнаяАгрегацияУпаковокИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВиртуальнаяАгрегацияУпаковокИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВозмещениеРасходовФондомСоциальногоСтрахования"

	Дано Я открываю основную форму обработки "ВозмещениеРасходовФондомСоциальногоСтрахования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВозмещениеРасходовФондомСоциальногоСтрахования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВходящиеСообщенияУТМЕГАИС"

	Дано Я открываю основную форму обработки "ВходящиеСообщенияУТМЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВходящиеСообщенияУТМЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаБазыТоваровВТСД"

	Дано Я открываю основную форму обработки "ВыгрузкаБазыТоваровВТСД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаБазыТоваровВТСД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаEnterpriseData"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаEnterpriseData"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаEnterpriseData"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхГрафЗависимостейСловарейСопоставленияСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхГрафЗависимостейСловарейСопоставленияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхГрафЗависимостейСловарейСопоставленияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиНастроекПользователей"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиНастроекПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиНастроекПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиНастроекПользователей"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиНастроекПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиНастроекПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковЗагрузкиДанных"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковЗагрузкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковЗагрузкиДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерПересозданияСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерПересозданияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерПересозданияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерСопоставленияСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерСопоставленияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерСопоставленияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЗаписиДанныхИнформационнойБазы"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЗаписиДанныхИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЗаписиДанныхИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЗаписиПересоздаваемыхСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЗаписиПересоздаваемыхСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЗаписиПересоздаваемыхСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЗаписиСопоставляемыхСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЗаписиСопоставляемыхСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЗаписиСопоставляемыхСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЧтенияДанныхИнформационнойБазы"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЧтенияДанныхИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЧтенияДанныхИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеМаршрутныхЛистов"

	Дано Я открываю основную форму обработки "ВыполнениеМаршрутныхЛистов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеМаршрутныхЛистов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеОбменаДанными"

	Дано Я открываю основную форму обработки "ВыполнениеОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеОпераций"

	Дано Я открываю основную форму обработки "ВыполнениеОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеОпераций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеОпераций2_2"

	Дано Я открываю основную форму обработки "ВыполнениеОпераций2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеОпераций2_2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеОперацийПриПланировании"

	Дано Я открываю основную форму обработки "ВыполнениеОперацийПриПланировании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеОперацийПриПланировании"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеЭтаповПроизводства"

	Дано Я открываю основную форму обработки "ВыполнениеЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеЭтаповПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГенерацияТопологииСклада"

	Дано Я открываю основную форму обработки "ГенерацияТопологииСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГенерацияТопологииСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГенерацияШтрихкодовУпаковок"

	Дано Я открываю основную форму обработки "ГенерацияШтрихкодовУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГенерацияШтрихкодовУпаковок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрупповоеИзменениеРеквизитов"

	Дано Я открываю основную форму обработки "ГрупповоеИзменениеРеквизитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГрупповоеИзменениеРеквизитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрупповоеИзменениеЭлементовАмортизации"

	Дано Я открываю основную форму обработки "ГрупповоеИзменениеЭлементовАмортизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГрупповоеИзменениеЭлементовАмортизации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрупповоеРедактированиеНачислений"

	Дано Я открываю основную форму обработки "ГрупповоеРедактированиеНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГрупповоеРедактированиеНачислений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияАктивовПассивов"

	Дано Я открываю основную форму обработки "ДвиженияАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДвиженияАктивовПассивов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДелениеПартииПроизводства"

	Дано Я открываю основную форму обработки "ДелениеПартииПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДелениеПартииПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДеревоРесурсныхСпецификаций"

	Дано Я открываю основную форму обработки "ДеревоРесурсныхСпецификаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДеревоРесурсныхСпецификаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиагностикаЭДО"

	Дано Я открываю основную форму обработки "ДиагностикаЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДиагностикаЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиспетчированиеГрафикаПроизводства"

	Дано Я открываю основную форму обработки "ДиспетчированиеГрафикаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДиспетчированиеГрафикаПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиспетчированиеПроизводства"

	Дано Я открываю основную форму обработки "ДиспетчированиеПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДиспетчированиеПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиспетчированиеПроизводстваПооперационное"

	Дано Я открываю основную форму обработки "ДиспетчированиеПроизводстваПооперационное"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДиспетчированиеПроизводстваПооперационное"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиспетчированиеСборкаИДоставка"

	Дано Я открываю основную форму обработки "ДиспетчированиеСборкаИДоставка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДиспетчированиеСборкаИДоставка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДокументооборотСКонтролирующимиОрганами"

	Дано Я открываю основную форму обработки "ДокументооборотСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДокументооборотСКонтролирующимиОрганами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДокументыПоПартнеруИСделке"

	Дано Я открываю основную форму обработки "ДокументыПоПартнеруИСделке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДокументыПоПартнеруИСделке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоступностьВидовРабочихЦентров"

	Дано Я открываю основную форму обработки "ДоступностьВидовРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДоступностьВидовРабочихЦентров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоступныеАнкеты"

	Дано Я открываю основную форму обработки "ДоступныеАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДоступныеАнкеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналБилетовИБронирований"

	Дано Я открываю основную форму обработки "ЖурналБилетовИБронирований"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналБилетовИБронирований"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовАвансовыеОтчеты"

	Дано Я открываю основную форму обработки "ЖурналДокументовАвансовыеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовАвансовыеОтчеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовАренды"

	Дано Я открываю основную форму обработки "ЖурналДокументовАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовАренды"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовБезналичныеПлатежи"

	Дано Я открываю основную форму обработки "ЖурналДокументовБезналичныеПлатежи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовБезналичныеПлатежи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовВводаНачальныхОстатков"

	Дано Я открываю основную форму обработки "ЖурналДокументовВводаНачальныхОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовВводаНачальныхОстатков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовВнутреннегоТовародвижения"

	Дано Я открываю основную форму обработки "ЖурналДокументовВнутреннегоТовародвижения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовВнутреннегоТовародвижения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовДенежныеДокументы"

	Дано Я открываю основную форму обработки "ЖурналДокументовДенежныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовДенежныеДокументы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовЗакупки"

	Дано Я открываю основную форму обработки "ЖурналДокументовЗакупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовЗакупки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовИнтеркампани"

	Дано Я открываю основную форму обработки "ЖурналДокументовИнтеркампани"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовИнтеркампани"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовНДС"

	Дано Я открываю основную форму обработки "ЖурналДокументовНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовНМА"

	Дано Я открываю основную форму обработки "ЖурналДокументовНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовНМА"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовНМА2_4"

	Дано Я открываю основную форму обработки "ЖурналДокументовНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовНМА2_4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовНМАМеждународныйУчет"

	Дано Я открываю основную форму обработки "ЖурналДокументовНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовНМАМеждународныйУчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовОС"

	Дано Я открываю основную форму обработки "ЖурналДокументовОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовОС2_4"

	Дано Я открываю основную форму обработки "ЖурналДокументовОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовОС2_4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовОСМеждународныйУчет"

	Дано Я открываю основную форму обработки "ЖурналДокументовОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовОСМеждународныйУчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовОтчетыКомиссионеров"

	Дано Я открываю основную форму обработки "ЖурналДокументовОтчетыКомиссионеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовОтчетыКомиссионеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовОтчетыКомитентам"

	Дано Я открываю основную форму обработки "ЖурналДокументовОтчетыКомитентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовОтчетыКомитентам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПереработки"

	Дано Я открываю основную форму обработки "ЖурналДокументовПереработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПереработки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПлатежи"

	Дано Я открываю основную форму обработки "ЖурналДокументовПлатежи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПлатежи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПоТМЦВЭксплуатации"

	Дано Я открываю основную форму обработки "ЖурналДокументовПоТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПоТМЦВЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПродажи"

	Дано Я открываю основную форму обработки "ЖурналДокументовПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПроизводства"

	Дано Я открываю основную форму обработки "ЖурналДокументовПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПрослеживаемости"

	Дано Я открываю основную форму обработки "ЖурналДокументовПрослеживаемости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПрослеживаемости"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовТОиР"

	Дано Я открываю основную форму обработки "ЖурналДокументовТОиР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовТОиР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналРегистрации"

	Дано Я открываю основную форму обработки "ЖурналРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналСкладскихАктов"

	Дано Я открываю основную форму обработки "ЖурналСкладскихАктов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналСкладскихАктов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаОригиналовПервичныхДокументов"

	Дано Я открываю основную форму обработки "ЖурналУчетаОригиналовПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналУчетаОригиналовПервичныхДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаДанныхИзФайла"

	Дано Я открываю основную форму обработки "ЗагрузкаДанныхИзФайла"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаДанныхИзФайла"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаКлассификатораБанков"

	Дано Я открываю основную форму обработки "ЗагрузкаКлассификатораБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКлассификатораБанков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаКурсовВалют"

	Дано Я открываю основную форму обработки "ЗагрузкаКурсовВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКурсовВалют"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаКурсовВалютЕЦБ"

	Дано Я открываю основную форму обработки "ЗагрузкаКурсовВалютЕЦБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКурсовВалютЕЦБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаОтчетаБанкаПоЭквайрингу"

	Дано Я открываю основную форму обработки "ЗагрузкаОтчетаБанкаПоЭквайрингу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаОтчетаБанкаПоЭквайрингу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаПравилРегистрацииОбъектов"

	Дано Я открываю основную форму обработки "ЗагрузкаПравилРегистрацииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаПравилРегистрацииОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаТоваровИзВнешнихФайлов"

	Дано Я открываю основную форму обработки "ЗагрузкаТоваровИзВнешнихФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаТоваровИзВнешнихФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаЦенПоставщикаИзВнешнихФайлов"

	Дано Я открываю основную форму обработки "ЗагрузкаЦенПоставщикаИзВнешнихФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаЦенПоставщикаИзВнешнихФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаменаИОбъединениеЭлементов"

	Дано Я открываю основную форму обработки "ЗаменаИОбъединениеЭлементов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаменаИОбъединениеЭлементов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеАктаОНесоответствииВЕТИС"

	Дано Я открываю основную форму обработки "ЗаполнениеАктаОНесоответствииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеАктаОНесоответствииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеГрафиковРаботы"

	Дано Я открываю основную форму обработки "ЗаполнениеГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеГрафиковРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеКалендарныхГрафиков"

	Дано Я открываю основную форму обработки "ЗаполнениеКалендарныхГрафиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеКалендарныхГрафиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеКорректировкиНазначения"

	Дано Я открываю основную форму обработки "ЗаполнениеКорректировкиНазначения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеКорректировкиНазначения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеРегистровВзаиморасчетов"

	Дано Я открываю основную форму обработки "ЗаполнениеРегистровВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеРегистровВзаиморасчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеТрудовыхФункцийВПозицияхШтатногоРасписания"

	Дано Я открываю основную форму обработки "ЗаполнениеТрудовыхФункцийВПозицияхШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеТрудовыхФункцийВПозицияхШтатногоРасписания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеФактическойСтоимостиВНАПриОтключенномУчетеСебестоимости"

	Дано Я открываю основную форму обработки "ЗаполнениеФактическойСтоимостиВНАПриОтключенномУчетеСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеФактическойСтоимостиВНАПриОтключенномУчетеСебестоимости"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗапросКоличестваИСерий"

	Дано Я открываю основную форму обработки "ЗапросКоличестваИСерий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗапросКоличестваИСерий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗапросыКоммерческихПредложений"

	Дано Я открываю основную форму обработки "ЗапросыКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗапросыКоммерческихПредложений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗащитаПерсональныхДанных"

	Дано Я открываю основную форму обработки "ЗащитаПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗащитаПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"

	Дано Я открываю основную форму обработки "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИмпортСведенийОТрудовойДеятельности"

	Дано Я открываю основную форму обработки "ИмпортСведенийОТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИмпортСведенийОТрудовойДеятельности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнструкцияПоИспользованиюПроверкиКонтрагента"

	Дано Я открываю основную форму обработки "ИнструкцияПоИспользованиюПроверкиКонтрагента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнструкцияПоИспользованиюПроверкиКонтрагента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтеграцияБРО_ЭДО"

	Дано Я открываю основную форму обработки "ИнтеграцияБРО_ЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтеграцияБРО_ЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтеграцияС1СДокументооборот"

	Дано Я открываю основную форму обработки "ИнтеграцияС1СДокументооборот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтеграцияС1СДокументооборот"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтеграцияС1СОблачнаяКартаПрикладныхРешений"

	Дано Я открываю основную форму обработки "ИнтеграцияС1СОблачнаяКартаПрикладныхРешений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтеграцияС1СОблачнаяКартаПрикладныхРешений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтеграцияССППР"

	Дано Я открываю основную форму обработки "ИнтеграцияССППР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтеграцияССППР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтерактивноеИзменениеВыгрузки"

	Дано Я открываю основную форму обработки "ИнтерактивноеИзменениеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтерактивноеИзменениеВыгрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтерфейсДокументовЭДО"

	Дано Я открываю основную форму обработки "ИнтерфейсДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтерфейсДокументовЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнформационныйЦентр"

	Дано Я открываю основную форму обработки "ИнформационныйЦентр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнформационныйЦентр"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнформацияПриЗапуске"

	Дано Я открываю основную форму обработки "ИнформацияПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнформацияПриЗапуске"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсправлениеОшибокВРегистреСведенийРаспределениеЗапасов"

	Дано Я открываю основную форму обработки "ИсправлениеОшибокВРегистреСведенийРаспределениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИсправлениеОшибокВРегистреСведенийРаспределениеЗапасов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсправлениеПроблемыСПрисоединеннымиФайлами"

	Дано Я открываю основную форму обработки "ИсправлениеПроблемыСПрисоединеннымиФайлами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИсправлениеПроблемыСПрисоединеннымиФайлами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсправлениеРеестраДокументов"

	Дано Я открываю основную форму обработки "ИсправлениеРеестраДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИсправлениеРеестраДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсточникиДанныхПланирования"

	Дано Я открываю основную форму обработки "ИсточникиДанныхПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИсточникиДанныхПланирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсточникиДанныхПланированияКА"

	Дано Я открываю основную форму обработки "ИсточникиДанныхПланированияКА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИсточникиДанныхПланированияКА"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсточникиДанныхПланированияУП"

	Дано Я открываю основную форму обработки "ИсточникиДанныхПланированияУП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИсточникиДанныхПланированияУП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КалендарьБухгалтера"

	Дано Я открываю основную форму обработки "КалендарьБухгалтера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КалендарьБухгалтера"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КартаМаршрутаБизнесПроцесса"

	Дано Я открываю основную форму обработки "КартаМаршрутаБизнесПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КартаМаршрутаБизнесПроцесса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КлассификаторыВЕТИС"

	Дано Я открываю основную форму обработки "КлассификаторыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КлассификаторыВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Классификация"

	Дано Я открываю основную форму обработки "Классификация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Классификация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КлиентБанк"

	Дано Я открываю основную форму обработки "КлиентБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КлиентБанк"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовXDTO"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовXDTO"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовРаспределенныхИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонсолидацияОтчетностиПоНДС"

	Дано Я открываю основную форму обработки "КонсолидацияОтчетностиПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонсолидацияОтчетностиПоНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонструкторФормул"

	Дано Я открываю основную форму обработки "КонструкторФормул"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонструкторФормул"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольВеденияКадровогоУчета"

	Дано Я открываю основную форму обработки "КонтрольВеденияКадровогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонтрольВеденияКадровогоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольВеденияКадровогоУчетаРасширенная"

	Дано Я открываю основную форму обработки "КонтрольВеденияКадровогоУчетаРасширенная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонтрольВеденияКадровогоУчетаРасширенная"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольШтатногоРасписания"

	Дано Я открываю основную форму обработки "КонтрольШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонтрольШтатногоРасписания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КриптографияБЭД"

	Дано Я открываю основную форму обработки "КриптографияБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КриптографияБЭД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛегальностьПолученияОбновлений"

	Дано Я открываю основную форму обработки "ЛегальностьПолученияОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЛегальностьПолученияОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МастерПереходаВОблако"

	Дано Я открываю основную форму обработки "МастерПереходаВОблако"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МастерПереходаВОблако"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МеждународныйКлассификаторВалют"

	Дано Я открываю основную форму обработки "МеждународныйКлассификаторВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МеждународныйКлассификаторВалют"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МенеджерДанныхУчетаВремениСотрудников"

	Дано Я открываю основную форму обработки "МенеджерДанныхУчетаВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МенеджерДанныхУчетаВремениСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МенеджерДанныхУчетаВремениСотрудниковАрхивный"

	Дано Я открываю основную форму обработки "МенеджерДанныхУчетаВремениСотрудниковАрхивный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МенеджерДанныхУчетаВремениСотрудниковАрхивный"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МенеджерМобильныхПриложений"

	Дано Я открываю основную форму обработки "МенеджерМобильныхПриложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МенеджерМобильныхПриложений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МенеджерРасчетаЗарплаты"

	Дано Я открываю основную форму обработки "МенеджерРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МенеджерРасчетаЗарплаты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МенеджерРасчетаЗарплатыАрхивный"

	Дано Я открываю основную форму обработки "МенеджерРасчетаЗарплатыАрхивный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МенеджерРасчетаЗарплатыАрхивный"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МобильноеРабочееМестоСборкиИКурьерскойДоставки"

	Дано Я открываю основную форму обработки "МобильноеРабочееМестоСборкиИКурьерскойДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МобильноеРабочееМестоСборкиИКурьерскойДоставки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МониторПортала1СИТС"

	Дано Я открываю основную форму обработки "МониторПортала1СИТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МониторПортала1СИТС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаЗначенийПоказателейДляРаспределенияРасходов"

	Дано Я открываю основную форму обработки "НастройкаЗначенийПоказателейДляРаспределенияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаЗначенийПоказателейДляРаспределенияРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаОтраженияДокументовВРеглУчете"

	Дано Я открываю основную форму обработки "НастройкаОтраженияДокументовВРеглУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаОтраженияДокументовВРеглУчете"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаПередачиМатериаловВПроизводство"

	Дано Я открываю основную форму обработки "НастройкаПередачиМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаПередачиМатериаловВПроизводство"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаПоддержанияЗапасов"

	Дано Я открываю основную форму обработки "НастройкаПоддержанияЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаПоддержанияЗапасов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаПостановкиКонтрагентовНаМониторингСПАРК"

	Дано Я открываю основную форму обработки "НастройкаПостановкиКонтрагентовНаМониторингСПАРК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаПостановкиКонтрагентовНаМониторингСПАРК"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаПравилОбработкиЗаявокСотрудников"

	Дано Я открываю основную форму обработки "НастройкаПравилОбработкиЗаявокСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаПравилОбработкиЗаявокСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаПравилПолученияФактаБюджетирования"

	Дано Я открываю основную форму обработки "НастройкаПравилПолученияФактаБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаПравилПолученияФактаБюджетирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму обработки "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму обработки "НастройкаРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРезервногоКопированияИБ"

	Дано Я открываю основную форму обработки "НастройкаРезервногоКопированияИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРезервногоКопированияИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаСоответствияСчетовИОборотовМеждународногоУчета"

	Дано Я открываю основную форму обработки "НастройкаСоответствияСчетовИОборотовМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаСоответствияСчетовИОборотовМеждународногоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаСпособовОбеспеченияПотребностей"

	Дано Я открываю основную форму обработки "НастройкаСпособовОбеспеченияПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаСпособовОбеспеченияПотребностей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаСчетовМеждународногоУчета"

	Дано Я открываю основную форму обработки "НастройкаСчетовМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаСчетовМеждународногоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаХозяйственныхОпераций"

	Дано Я открываю основную форму обработки "НастройкаХозяйственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаХозяйственныхОпераций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаШаблоновПроводокДляМеждународногоУчета"

	Дано Я открываю основную форму обработки "НастройкаШаблоновПроводокДляМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаШаблоновПроводокДляМеждународногоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиВнутреннегоЭДО"

	Дано Я открываю основную форму обработки "НастройкиВнутреннегоЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиВнутреннегоЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиОтправкиЭДО"

	Дано Я открываю основную форму обработки "НастройкиОтправкиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиОтправкиЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиПользователей"

	Дано Я открываю основную форму обработки "НастройкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиСбораЗаказовИКурьерскойДоставки"

	Дано Я открываю основную форму обработки "НастройкиСбораЗаказовИКурьерскойДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиСбораЗаказовИКурьерскойДоставки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиЦентраМониторинга"

	Дано Я открываю основную форму обработки "НастройкиЦентраМониторинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиЦентраМониторинга"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиЭДО"

	Дано Я открываю основную форму обработки "НастройкиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НерекомендуемаяВерсияПлатформы"

	Дано Я открываю основную форму обработки "НерекомендуемаяВерсияПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НерекомендуемаяВерсияПлатформы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбеспечениеПотребностей"

	Дано Я открываю основную форму обработки "ОбеспечениеПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбеспечениеПотребностей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменДаннымиСМобильнымиПриложениями"

	Дано Я открываю основную форму обработки "ОбменДаннымиСМобильнымиПриложениями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменДаннымиСМобильнымиПриложениями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменСБанками"

	Дано Я открываю основную форму обработки "ОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменСБанками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменСБанкамиПоЗарплатнымПроектам"

	Дано Я открываю основную форму обработки "ОбменСБанкамиПоЗарплатнымПроектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменСБанкамиПоЗарплатнымПроектам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменСКонтрагентами"

	Дано Я открываю основную форму обработки "ОбменСКонтрагентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменСКонтрагентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменСОфлайнОборудованием"

	Дано Я открываю основную форму обработки "ОбменСОфлайнОборудованием"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменСОфлайнОборудованием"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменССайтами"

	Дано Я открываю основную форму обработки "ОбменССайтами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменССайтами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбновлениеКлассификаторов"

	Дано Я открываю основную форму обработки "ОбновлениеКлассификаторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеКлассификаторов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбновлениеПрограммы"

	Дано Я открываю основную форму обработки "ОбновлениеПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеПрограммы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбновлениеРегламентированнойОтчетности"

	Дано Я открываю основную форму обработки "ОбновлениеРегламентированнойОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеРегламентированнойОтчетности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбновлениеЧерезКопию"

	Дано Я открываю основную форму обработки "ОбновлениеЧерезКопию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеЧерезКопию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбработкаНеисправностейБЭД"

	Дано Я открываю основную форму обработки "ОбработкаНеисправностейБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбработкаНеисправностейБЭД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбходКоллекции"

	Дано Я открываю основную форму обработки "ОбходКоллекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбходКоллекции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбщегоНазначенияБЭД"

	Дано Я открываю основную форму обработки "ОбщегоНазначенияБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбщегоНазначенияБЭД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбщиеОбъектыРеглОтчетности"

	Дано Я открываю основную форму обработки "ОбщиеОбъектыРеглОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбщиеОбъектыРеглОтчетности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбщиеФормыСЭДОФСС"

	Дано Я открываю основную форму обработки "ОбщиеФормыСЭДОФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбщиеФормыСЭДОФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбъединениеКарточекСЛичнымиДанными"

	Дано Я открываю основную форму обработки "ОбъединениеКарточекСЛичнымиДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбъединениеКарточекСЛичнымиДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОнлайнСервисыРегламентированнойОтчетности"

	Дано Я открываю основную форму обработки "ОнлайнСервисыРегламентированнойОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОнлайнСервисыРегламентированнойОтчетности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОперацииЗакрытияМесяца"

	Дано Я открываю основную форму обработки "ОперацииЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОперацииЗакрытияМесяца"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОписаниеОбработчиковОбновления"

	Дано Я открываю основную форму обработки "ОписаниеОбработчиковОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОписаниеОбработчиковОбновления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОповещениеОСобытияхЭДО"

	Дано Я открываю основную форму обработки "ОповещениеОСобытияхЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОповещениеОСобытияхЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтложеннаяЗаписьУзла"

	Дано Я открываю основную форму обработки "ОтложеннаяЗаписьУзла"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОтложеннаяЗаписьУзла"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтражениеДокументовВМеждународномУчете"

	Дано Я открываю основную форму обработки "ОтражениеДокументовВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОтражениеДокументовВМеждународномУчете"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтражениеДокументовВРеглУчете"

	Дано Я открываю основную форму обработки "ОтражениеДокументовВРеглУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОтражениеДокументовВРеглУчете"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОформлениеПроизводстваБезЗаказов"

	Дано Я открываю основную форму обработки "ОформлениеПроизводстваБезЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОформлениеПроизводстваБезЗаказов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаПроизводительности"

	Дано Я открываю основную форму обработки "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОчисткаДвиженийПриОтключенномУчетеСебестоимости"

	Дано Я открываю основную форму обработки "ОчисткаДвиженийПриОтключенномУчетеСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОчисткаДвиженийПриОтключенномУчетеСебестоимости"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБИД"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБИД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБИД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБСП"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБСПВМоделиСервиса"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСПВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСПВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБЭД"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБЭД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияВЕТИС"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияГИСМ"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияГИСМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияЕГАИС"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияЗаказы"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияЗаказы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияЗаказы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияИСМП"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияКА"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияКА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияКА"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияОбменаССайтом"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияОбменаССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияОбменаССайтом"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияСППР"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияСППР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияСППР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияУП"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияУП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияУП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияУТ"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияУТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияУТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияУчетПрослеживаемыхТоваров"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияУчетПрослеживаемыхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияУчетПрослеживаемыхТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельНастроекЗарплатаКадры"

	Дано Я открываю основную форму обработки "ПанельНастроекЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельНастроекЗарплатаКадры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельОбменВЕТИС"

	Дано Я открываю основную форму обработки "ПанельОбменВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельОбменВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельОбменГИСМ"

	Дано Я открываю основную форму обработки "ПанельОбменГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельОбменГИСМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельОбменЕГАИС"

	Дано Я открываю основную форму обработки "ПанельОбменЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельОбменЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельОбменИСМП"

	Дано Я открываю основную форму обработки "ПанельОбменИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельОбменИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковБюджетирования"

	Дано Я открываю основную форму обработки "ПанельСправочниковБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковБюджетирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковВнеоборотныеАктивы"

	Дано Я открываю основную форму обработки "ПанельСправочниковВнеоборотныеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковВнеоборотныеАктивы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковЗарплата"

	Дано Я открываю основную форму обработки "ПанельСправочниковЗарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковЗарплата"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковКадры"

	Дано Я открываю основную форму обработки "ПанельСправочниковКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковКадры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковМаркетинг"

	Дано Я открываю основную форму обработки "ПанельСправочниковМаркетинг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковМаркетинг"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковМеждународныйФинансовыйУчет"

	Дано Я открываю основную форму обработки "ПанельСправочниковМеждународныйФинансовыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковМеждународныйФинансовыйУчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковНСИ"

	Дано Я открываю основную форму обработки "ПанельСправочниковНСИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковНСИ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковПроизводство"

	Дано Я открываю основную форму обработки "ПанельСправочниковПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковПроизводство"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковРегламентированныйУчет"

	Дано Я открываю основную форму обработки "ПанельСправочниковРегламентированныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковРегламентированныйУчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковСклад"

	Дано Я открываю основную форму обработки "ПанельСправочниковСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковСклад"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковФинансовыйРезультат"

	Дано Я открываю основную форму обработки "ПанельСправочниковФинансовыйРезультат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковФинансовыйРезультат"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПараметрыНазначенияСпецификаций"

	Дано Я открываю основную форму обработки "ПараметрыНазначенияСпецификаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПараметрыНазначенияСпецификаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПервоначальноеЗаполнениеРегистровПартионногоУчета"

	Дано Я открываю основную форму обработки "ПервоначальноеЗаполнениеРегистровПартионногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПервоначальноеЗаполнениеРегистровПартионногоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПерезаполнениеРегистрацийВНалоговомОргане"

	Дано Я открываю основную форму обработки "ПерезаполнениеРегистрацийВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПерезаполнениеРегистрацийВНалоговомОргане"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереносЖелаемойДатыОбеспеченияЭтаповПроизводства"

	Дано Я открываю основную форму обработки "ПереносЖелаемойДатыОбеспеченияЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПереносЖелаемойДатыОбеспеченияЭтаповПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереносФайлов"

	Дано Я открываю основную форму обработки "ПереносФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПереносФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПересчетПлановогоФОТ"

	Дано Я открываю основную форму обработки "ПересчетПлановогоФОТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПересчетПлановогоФОТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереходНаУправлениеПроизводствомВерсии22"

	Дано Я открываю основную форму обработки "ПереходНаУправлениеПроизводствомВерсии22"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПереходНаУправлениеПроизводствомВерсии22"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПеречислениеНДСВБюджетПоОтдельнымОперациям"

	Дано Я открываю основную форму обработки "ПеречислениеНДСВБюджетПоОтдельнымОперациям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПеречислениеНДСВБюджетПоОтдельнымОперациям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьАктОбОказанииУслуг"

	Дано Я открываю основную форму обработки "ПечатьАктОбОказанииУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьАктОбОказанииУслуг"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьАктыОРасхождениях"

	Дано Я открываю основную форму обработки "ПечатьАктыОРасхождениях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьАктыОРасхождениях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьБухгалтерскойСправки"

	Дано Я открываю основную форму обработки "ПечатьБухгалтерскойСправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьБухгалтерскойСправки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЗаданияНаОтборРазмещениеТоваров"

	Дано Я открываю основную форму обработки "ПечатьЗаданияНаОтборРазмещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЗаданияНаОтборРазмещениеТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЗаказовНаТоварыУслуги"

	Дано Я открываю основную форму обработки "ПечатьЗаказовНаТоварыУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЗаказовНаТоварыУслуги"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЗаявленияНаВозвратТоваровОтКлиента"

	Дано Я открываю основную форму обработки "ПечатьЗаявленияНаВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЗаявленияНаВозвратТоваровОтКлиента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьИзвещений"

	Дано Я открываю основную форму обработки "ПечатьИзвещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьИзвещений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьИНВ19"

	Дано Я открываю основную форму обработки "ПечатьИНВ19"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьИНВ19"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьИНВ22"

	Дано Я открываю основную форму обработки "ПечатьИНВ22"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьИНВ22"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьИНВ3"

	Дано Я открываю основную форму обработки "ПечатьИНВ3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьИНВ3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьКадровыхПриказов"

	Дано Я открываю основную форму обработки "ПечатьКадровыхПриказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьКадровыхПриказов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьКадровыхПриказовРасширенная"

	Дано Я открываю основную форму обработки "ПечатьКадровыхПриказовРасширенная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьКадровыхПриказовРасширенная"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьКМ3"

	Дано Я открываю основную форму обработки "ПечатьКМ3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьКМ3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьКМ6"

	Дано Я открываю основную форму обработки "ПечатьКМ6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьКМ6"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьМ11"

	Дано Я открываю основную форму обработки "ПечатьМ11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьМ11"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьОбщихФорм"

	Дано Я открываю основную форму обработки "ПечатьОбщихФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьОбщихФорм"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьОС1"

	Дано Я открываю основную форму обработки "ПечатьОС1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьОС1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьОС14"

	Дано Я открываю основную форму обработки "ПечатьОС14"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьОС14"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьОС4"

	Дано Я открываю основную форму обработки "ПечатьОС4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьОС4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьОтчетовПоКомиссии"

	Дано Я открываю основную форму обработки "ПечатьОтчетовПоКомиссии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьОтчетовПоКомиссии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьПодарочныхСертификатов"

	Дано Я открываю основную форму обработки "ПечатьПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьПодарочныхСертификатов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьПрямыеВыплатыПособийСоциальногоСтрахованияФСС"

	Дано Я открываю основную форму обработки "ПечатьПрямыеВыплатыПособийСоциальногоСтрахованияФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьПрямыеВыплатыПособийСоциальногоСтрахованияФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьРазделаБСправкиТТН"

	Дано Я открываю основную форму обработки "ПечатьРазделаБСправкиТТН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьРазделаБСправкиТТН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьРасчетаНачислений"

	Дано Я открываю основную форму обработки "ПечатьРасчетаНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьРасчетаНачислений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьРасчетаСреднегоЗаработка"

	Дано Я открываю основную форму обработки "ПечатьРасчетаСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьРасчетаСреднегоЗаработка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьРасчетаСреднегоЗаработкаФСС"

	Дано Я открываю основную форму обработки "ПечатьРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьСчетовНаОплату"

	Дано Я открываю основную форму обработки "ПечатьСчетовНаОплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьСчетовНаОплату"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьТоварногоЧека"

	Дано Я открываю основную форму обработки "ПечатьТоварногоЧека"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьТоварногоЧека"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьТОРГ16"

	Дано Я открываю основную форму обработки "ПечатьТОРГ16"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьТОРГ16"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьФормВоинскогоУчета"

	Дано Я открываю основную форму обработки "ПечатьФормВоинскогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьФормВоинскогоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЭтикетокВЕТИС"

	Дано Я открываю основную форму обработки "ПечатьЭтикетокВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЭтикетокВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЭтикетокИЦенников"

	Дано Я открываю основную форму обработки "ПечатьЭтикетокИЦенников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЭтикетокИЦенников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЭтикетокИЦенников2_5"

	Дано Я открываю основную форму обработки "ПечатьЭтикетокИЦенников2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЭтикетокИЦенников2_5"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЭтикетокОбъектовЭксплуатации"

	Дано Я открываю основную форму обработки "ПечатьЭтикетокОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЭтикетокОбъектовЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЭтикетокТМЦВЭксплуатации"

	Дано Я открываю основную форму обработки "ПечатьЭтикетокТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЭтикетокТМЦВЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЭтикетокУзловОбъектовЭксплуатации"

	Дано Я открываю основную форму обработки "ПечатьЭтикетокУзловОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЭтикетокУзловОбъектовЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланированиеГрафикаПроизводства2_2"

	Дано Я открываю основную форму обработки "ПланированиеГрафикаПроизводства2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПланированиеГрафикаПроизводства2_2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланированиеРемонтныхРабот"

	Дано Я открываю основную форму обработки "ПланированиеРемонтныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПланированиеРемонтныхРабот"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлатежиПоРезультатамРасчетаЗарплаты"

	Дано Я открываю основную форму обработки "ПлатежиПоРезультатамРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПлатежиПоРезультатамРасчетаЗарплаты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлатежныйКалендарь"

	Дано Я открываю основную форму обработки "ПлатежныйКалендарь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПлатежныйКалендарь"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборМногооборотнойТары"

	Дано Я открываю основную форму обработки "ПодборМногооборотнойТары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборМногооборотнойТары"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборПартнеровПоОтбору"

	Дано Я открываю основную форму обработки "ПодборПартнеровПоОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборПартнеровПоОтбору"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборПоТоварнымКатегориям"

	Дано Я открываю основную форму обработки "ПодборПоТоварнымКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборПоТоварнымКатегориям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборСерийВДокументы"

	Дано Я открываю основную форму обработки "ПодборСерийВДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборСерийВДокументы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоварныхКатегорийПоОтбору"

	Дано Я открываю основную форму обработки "ПодборТоварныхКатегорийПоОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоварныхКатегорийПоОтбору"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоваровВДокументЗакупки"

	Дано Я открываю основную форму обработки "ПодборТоваровВДокументЗакупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоваровВДокументЗакупки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоваровВДокументПродажи"

	Дано Я открываю основную форму обработки "ПодборТоваровВДокументПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоваровВДокументПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоваровПереданныхНаОтветственноеХранение"

	Дано Я открываю основную форму обработки "ПодборТоваровПереданныхНаОтветственноеХранение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоваровПереданныхНаОтветственноеХранение"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоваровПоОтбору"

	Дано Я открываю основную форму обработки "ПодборТоваровПоОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоваровПоОтбору"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоваровПринятыхНаОтветственноеХранение"

	Дано Я открываю основную форму обработки "ПодборТоваровПринятыхНаОтветственноеХранение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоваровПринятыхНаОтветственноеХранение"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодготовкаКвартальнойОтчетностиВПФР"

	Дано Я открываю основную форму обработки "ПодготовкаКвартальнойОтчетностиВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодготовкаКвартальнойОтчетностиВПФР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодготовкаСведенийВКаталогGS46"

	Дано Я открываю основную форму обработки "ПодготовкаСведенийВКаталогGS46"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодготовкаСведенийВКаталогGS46"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Подключение1СТакском"

	Дано Я открываю основную форму обработки "Подключение1СТакском"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Подключение1СТакском"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодключениеОбсуждений"

	Дано Я открываю основную форму обработки "ПодключениеОбсуждений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодключениеОбсуждений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодключениеСервисовСопровождения"

	Дано Я открываю основную форму обработки "ПодключениеСервисовСопровождения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодключениеСервисовСопровождения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодтверждениеПоступившихКиЗГИСМ"

	Дано Я открываю основную форму обработки "ПодтверждениеПоступившихКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодтверждениеПоступившихКиЗГИСМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоискИУдалениеДублей"

	Дано Я открываю основную форму обработки "ПоискИУдалениеДублей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПоискИУдалениеДублей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоискОбъектовПоШтрихкоду"

	Дано Я открываю основную форму обработки "ПоискОбъектовПоШтрихкоду"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПоискОбъектовПоШтрихкоду"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПолнотекстовыйПоискВДанных"

	Дано Я открываю основную форму обработки "ПолнотекстовыйПоискВДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПолнотекстовыйПоискВДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПолучениеИВозвратМатериалов"

	Дано Я открываю основную форму обработки "ПолучениеИВозвратМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПолучениеИВозвратМатериалов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникВыгрузкиЗагрузкиМоделиБюджетирования"

	Дано Я открываю основную форму обработки "ПомощникВыгрузкиЗагрузкиМоделиБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникВыгрузкиЗагрузкиМоделиБюджетирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникВыгрузкиЗагрузкиМоделиМеждународногоУчета"

	Дано Я открываю основную форму обработки "ПомощникВыгрузкиЗагрузкиМоделиМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникВыгрузкиЗагрузкиМоделиМеждународногоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникЗакрытияЗаказов"

	Дано Я открываю основную форму обработки "ПомощникЗакрытияЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникЗакрытияЗаказов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникЗаполненияЗаявленияНаПолучениеПатента"

	Дано Я открываю основную форму обработки "ПомощникЗаполненияЗаявленияНаПолучениеПатента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникЗаполненияЗаявленияНаПолучениеПатента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникЗачетаОплат"

	Дано Я открываю основную форму обработки "ПомощникЗачетаОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникЗачетаОплат"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИнтерактивногоОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИсправленияОстатковТоваровОрганизаций"

	Дано Я открываю основную форму обработки "ПомощникИсправленияОстатковТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИсправленияОстатковТоваровОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникКопированияНастроекУчетныхПолитик"

	Дано Я открываю основную форму обработки "ПомощникКопированияНастроекУчетныхПолитик"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникКопированияНастроекУчетныхПолитик"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникКорректировкиОстатковЕГАИС"

	Дано Я открываю основную форму обработки "ПомощникКорректировкиОстатковЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникКорректировкиОстатковЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникНастройкиПараметровБазовойВерсии"

	Дано Я открываю основную форму обработки "ПомощникНастройкиПараметровБазовойВерсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникНастройкиПараметровБазовойВерсии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникНастройкиПодключенияВнешнейСистемы"

	Дано Я открываю основную форму обработки "ПомощникНастройкиПодключенияВнешнейСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникНастройкиПодключенияВнешнейСистемы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"

	Дано Я открываю основную форму обработки "ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникОбращенияВТехническуюПоддержку"

	Дано Я открываю основную форму обработки "ПомощникОбращенияВТехническуюПоддержку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникОбращенияВТехническуюПоддержку"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникОформленияСкладскихАктов"

	Дано Я открываю основную форму обработки "ПомощникОформленияСкладскихАктов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникОформленияСкладскихАктов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереносаОперацийВРесурсныеСпецификации"

	Дано Я открываю основную форму обработки "ПомощникПереносаОперацийВРесурсныеСпецификации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереносаОперацийВРесурсныеСпецификации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаНаУчетВнеоборотныхАктивовВерсии24"

	Дано Я открываю основную форму обработки "ПомощникПереходаНаУчетВнеоборотныхАктивовВерсии24"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаНаУчетВнеоборотныхАктивовВерсии24"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаНаЦенообразованиеВерсии25"

	Дано Я открываю основную форму обработки "ПомощникПереходаНаЦенообразованиеВерсии25"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаНаЦенообразованиеВерсии25"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаСБухгалтерияПредприятия"

	Дано Я открываю основную форму обработки "ПомощникПереходаСБухгалтерияПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаСБухгалтерияПредприятия"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаСДругихКонфигураций"

	Дано Я открываю основную форму обработки "ПомощникПереходаСДругихКонфигураций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаСДругихКонфигураций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаСПрежнихПрограммЗарплатаКадры"

	Дано Я открываю основную форму обработки "ПомощникПереходаСПрежнихПрограммЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаСПрежнихПрограммЗарплатаКадры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаСТорговляИСклад77"

	Дано Я открываю основную форму обработки "ПомощникПереходаСТорговляИСклад77"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаСТорговляИСклад77"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаСУправлениеТорговлей103"

	Дано Я открываю основную форму обработки "ПомощникПереходаСУправлениеТорговлей103"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаСУправлениеТорговлей103"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПодготовкиУведомленияОКонтролируемыхСделках"

	Дано Я открываю основную форму обработки "ПомощникПодготовкиУведомленияОКонтролируемыхСделках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПодготовкиУведомленияОКонтролируемыхСделках"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПоУчетуНДС"

	Дано Я открываю основную форму обработки "ПомощникПоУчетуНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПоУчетуНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПродаж"

	Дано Я открываю основную форму обработки "ПомощникПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникСозданияАвтономногоРабочегоМеста"

	Дано Я открываю основную форму обработки "ПомощникСозданияАвтономногоРабочегоМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияАвтономногоРабочегоМеста"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникСозданияОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникСозданияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникФормированияКУДиР"

	Дано Я открываю основную форму обработки "ПомощникФормированияКУДиР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникФормированияКУДиР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникФормированияСкладскихДокументовПоВыводуИзАссортимента"

	Дано Я открываю основную форму обработки "ПомощникФормированияСкладскихДокументовПоВыводуИзАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникФормированияСкладскихДокументовПоВыводуИзАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПооперационноеПланирование"

	Дано Я открываю основную форму обработки "ПооперационноеПланирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПооперационноеПланирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПооперационноеПланирование2_2"

	Дано Я открываю основную форму обработки "ПооперационноеПланирование2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПооперационноеПланирование2_2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПособияВыплачиваемыеФСС"

	Дано Я открываю основную форму обработки "ПособияВыплачиваемыеФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПособияВыплачиваемыеФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПостроительXML"

	Дано Я открываю основную форму обработки "ПостроительXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПостроительXML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрайсЛист"

	Дано Я открываю основную форму обработки "ПрайсЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрайсЛист"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрайсЛистПоставщика"

	Дано Я открываю основную форму обработки "ПрайсЛистПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрайсЛистПоставщика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПредпросмотрЧека"

	Дано Я открываю основную форму обработки "ПредпросмотрЧека"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПредпросмотрЧека"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроведениеДокументовПоВидамУчета"

	Дано Я открываю основную форму обработки "ПроведениеДокументовПоВидамУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроведениеДокументовПоВидамУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаИПодборАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму обработки "ПроверкаИПодборАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаИПодборАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаИПодборПродукцииИСМП"

	Дано Я открываю основную форму обработки "ПроверкаИПодборПродукцииИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаИПодборПродукцииИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаИПодборТабачнойПродукцииМОТП"

	Дано Я открываю основную форму обработки "ПроверкаИПодборТабачнойПродукцииМОТП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаИПодборТабачнойПродукцииМОТП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаКодовМаркировкиИСМП"

	Дано Я открываю основную форму обработки "ПроверкаКодовМаркировкиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаКодовМаркировкиИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаКоличестваТоваровВДокументе"

	Дано Я открываю основную форму обработки "ПроверкаКоличестваТоваровВДокументе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаКоличестваТоваровВДокументе"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаКоличестваТоваровВПриходномОрдере"

	Дано Я открываю основную форму обработки "ПроверкаКоличестваТоваровВПриходномОрдере"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаКоличестваТоваровВПриходномОрдере"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму обработки "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПубликацияРасчетныхЛистковКабинетСотрудника"

	Дано Я открываю основную форму обработки "ПубликацияРасчетныхЛистковКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПубликацияРасчетныхЛистковКабинетСотрудника"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСАктамиРасхождений"

	Дано Я открываю основную форму обработки "РаботаСАктамиРасхождений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСАктамиРасхождений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСАкцизнымиМаркамиЕГАИС"

	Дано Я открываю основную форму обработки "РаботаСАкцизнымиМаркамиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСАкцизнымиМаркамиЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСВерсиямиEDI"

	Дано Я открываю основную форму обработки "РаботаСВерсиямиEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСВерсиямиEDI"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСКадрами"

	Дано Я открываю основную форму обработки "РаботаСКадрами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСКадрами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСКМПриПеремаркировкеТоваровИСМП"

	Дано Я открываю основную форму обработки "РаботаСКМПриПеремаркировкеТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСКМПриПеремаркировкеТоваровИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСНоменклатурой"

	Дано Я открываю основную форму обработки "РаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСНоменклатурой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСОблачнымиКлассификаторами"

	Дано Я открываю основную форму обработки "РаботаСОблачнымиКлассификаторами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСОблачнымиКлассификаторами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаССогласиемОПредоставленииИнформацииУчастникамОборотаТоваровГИСМТ"

	Дано Я открываю основную форму обработки "РаботаССогласиемОПредоставленииИнформацииУчастникамОборотаТоваровГИСМТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаССогласиемОПредоставленииИнформацииУчастникамОборотаТоваровГИСМТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСФайлами"

	Дано Я открываю основную форму обработки "РаботаСФайлами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСФайлами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РабочееМестоМенеджераПоДоставке"

	Дано Я открываю основную форму обработки "РабочееМестоМенеджераПоДоставке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РабочееМестоМенеджераПоДоставке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РабочееМестоРаботникаСклада"

	Дано Я открываю основную форму обработки "РабочееМестоРаботникаСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РабочееМестоРаботникаСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РассылкаПечатныхФорм"

	Дано Я открываю основную форму обработки "РассылкаПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РассылкаПечатныхФорм"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетБазыНачисленийУдержаний"

	Дано Я открываю основную форму обработки "РасчетБазыНачисленийУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасчетБазыНачисленийУдержаний"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетБазыНачисленийУдержанийАрхивный"

	Дано Я открываю основную форму обработки "РасчетБазыНачисленийУдержанийАрхивный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасчетБазыНачисленийУдержанийАрхивный"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетЗарплаты"

	Дано Я открываю основную форму обработки "РасчетЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасчетЗарплаты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетСтажаПоТрудовойДеятельности"

	Дано Я открываю основную форму обработки "РасчетСтажаПоТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасчетСтажаПоТрудовойДеятельности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасширенныйВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "РасширенныйВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасширенныйВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрацияИзмененийДляОбменаДанными"

	Дано Я открываю основную форму обработки "РегистрацияИзмененийДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегистрацияИзмененийДляОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрацияОбъектовКПубликацииКабинетСотрудника"

	Дано Я открываю основную форму обработки "РегистрацияОбъектовКПубликацииКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегистрацияОбъектовКПубликацииКабинетСотрудника"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированнаяОтчетностьСоотношенияПоказателей"

	Дано Я открываю основную форму обработки "РегламентированнаяОтчетностьСоотношенияПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегламентированнаяОтчетностьСоотношенияПоказателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентныеИФоновыеЗадания"

	Дано Я открываю основную форму обработки "РегламентныеИФоновыеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегламентныеИФоновыеЗадания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РедактированиеЗаконодательныхЗначений"

	Дано Я открываю основную форму обработки "РедактированиеЗаконодательныхЗначений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РедактированиеЗаконодательныхЗначений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РедактированиеНабора"

	Дано Я открываю основную форму обработки "РедактированиеНабора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РедактированиеНабора"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РедактированиеПоследовательностиЭтаповПроизводства"

	Дано Я открываю основную форму обработки "РедактированиеПоследовательностиЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РедактированиеПоследовательностиЭтаповПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РедактированиеСпецификацииСтрокиЗаказа"

	Дано Я открываю основную форму обработки "РедактированиеСпецификацииСтрокиЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РедактированиеСпецификацииСтрокиЗаказа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РедактированиеЭтаповПроизводства"

	Дано Я открываю основную форму обработки "РедактированиеЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РедактированиеЭтаповПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезервноеКопированиеИБ"

	Дано Я открываю основную форму обработки "РезервноеКопированиеИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезервноеКопированиеИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыОбновленияПрограммы"

	Дано Я открываю основную форму обработки "РезультатыОбновленияПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезультатыОбновленияПрограммы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСверкиКодовМаркировкиТОРГ2"

	Дано Я открываю основную форму обработки "РезультатыСверкиКодовМаркировкиТОРГ2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезультатыСверкиКодовМаркировкиТОРГ2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РекомендацияПоПовышениюСкоростиРаботы"

	Дано Я открываю основную форму обработки "РекомендацияПоПовышениюСкоростиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РекомендацияПоПовышениюСкоростиРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СамообслуживаниеПартнеров"

	Дано Я открываю основную форму обработки "СамообслуживаниеПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СамообслуживаниеПартнеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаДанныхУчетаНДС"

	Дано Я открываю основную форму обработки "СверкаДанныхУчетаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СверкаДанныхУчетаНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверткаИнформационнойБазы"

	Дано Я открываю основную форму обработки "СверткаИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СверткаИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СдвигГраницыИтогов"

	Дано Я открываю основную форму обработки "СдвигГраницыИтогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СдвигГраницыИтогов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СервисEDI"

	Дано Я открываю основную форму обработки "СервисEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СервисEDI"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СервисДоставки"

	Дано Я открываю основную форму обработки "СервисДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СервисДоставки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СинхронизацияЭДО"

	Дано Я открываю основную форму обработки "СинхронизацияЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СинхронизацияЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Сканирование"

	Дано Я открываю основную форму обработки "Сканирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Сканирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СкрытиеКонфиденциальнойИнформации"

	Дано Я открываю основную форму обработки "СкрытиеКонфиденциальнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СкрытиеКонфиденциальнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СозданиеВедомостейНаВыплатуЗарплаты"

	Дано Я открываю основную форму обработки "СозданиеВедомостейНаВыплатуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СозданиеВедомостейНаВыплатуЗарплаты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СозданиеВедомостейПрочихДоходов"

	Дано Я открываю основную форму обработки "СозданиеВедомостейПрочихДоходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СозданиеВедомостейПрочихДоходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СозданиеРеестровСтимулирующихВыплат"

	Дано Я открываю основную форму обработки "СозданиеРеестровСтимулирующихВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СозданиеРеестровСтимулирующихВыплат"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СокращениеПроизводства"

	Дано Я открываю основную форму обработки "СокращениеПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СокращениеПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СообщенияВКонтролирующийОрган"

	Дано Я открываю основную форму обработки "СообщенияВКонтролирующийОрган"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СообщенияВКонтролирующийОрган"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеКлассификаторовЕГАИС"

	Дано Я открываю основную форму обработки "СопоставлениеКлассификаторовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеКлассификаторовЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеНоменклатурыБЭД"

	Дано Я открываю основную форму обработки "СопоставлениеНоменклатурыБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеНоменклатурыБЭД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеНоменклатурыЕГАИС"

	Дано Я открываю основную форму обработки "СопоставлениеНоменклатурыЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеНоменклатурыЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "СопоставлениеОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеОбеспеченияЗаказов"

	Дано Я открываю основную форму обработки "СостояниеОбеспеченияЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СостояниеОбеспеченияЗаказов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеОбеспеченияЗаказовНаПроизводство"

	Дано Я открываю основную форму обработки "СостояниеОбеспеченияЗаказовНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СостояниеОбеспеченияЗаказовНаПроизводство"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаСПАРКРиски"

	Дано Я открываю основную форму обработки "СправкаСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СправкаСПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправочноеРазмещениеНоменклатуры"

	Дано Я открываю основную форму обработки "СправочноеРазмещениеНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СправочноеРазмещениеНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеСпецификаций"

	Дано Я открываю основную форму обработки "СравнениеСпецификаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СравнениеСпецификаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТекущиеДела"

	Дано Я открываю основную форму обработки "ТекущиеДела"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТекущиеДела"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТестированиеОперацийЗакрытийМесяца"

	Дано Я открываю основную форму обработки "ТестированиеОперацийЗакрытийМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТестированиеОперацийЗакрытийМесяца"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТестированиеПроведенияДокументовПартионныйУчет"

	Дано Я открываю основную форму обработки "ТестированиеПроведенияДокументовПартионныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТестированиеПроведенияДокументовПартионныйУчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТорговыеПредложения"

	Дано Я открываю основную форму обработки "ТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТорговыеПредложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортныеКонтейнерыЭДО"

	Дано Я открываю основную форму обработки "ТранспортныеКонтейнерыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортныеКонтейнерыЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаEMAIL"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаEMAIL"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаEMAIL"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаFILE"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFILE"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFILE"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаFTP"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFTP"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFTP"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаВнешняяСистема"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаВнешняяСистема"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаВнешняяСистема"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалениеНеиспользуемыхЭлементовСправочников"

	Дано Я открываю основную форму обработки "УдалениеНеиспользуемыхЭлементовСправочников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УдалениеНеиспользуемыхЭлементовСправочников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалениеПомеченныхОбъектов"

	Дано Я открываю основную форму обработки "УдалениеПомеченныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УдалениеПомеченныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОбменДаннымиXML"

	Дано Я открываю основную форму обработки "УниверсальныйОбменДаннымиXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УниверсальныйОбменДаннымиXML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеИтогамиИАгрегатами"

	Дано Я открываю основную форму обработки "УправлениеИтогамиИАгрегатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеИтогамиИАгрегатами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеНовостями"

	Дано Я открываю основную форму обработки "УправлениеНовостями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеНовостями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеОтгрузкой"

	Дано Я открываю основную форму обработки "УправлениеОтгрузкой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеОтгрузкой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПереданнойВозвратнойТарой"

	Дано Я открываю основную форму обработки "УправлениеПереданнойВозвратнойТарой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПереданнойВозвратнойТарой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПеремещениемОбособленныхТоваров"

	Дано Я открываю основную форму обработки "УправлениеПеремещениемОбособленныхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПеремещениемОбособленныхТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПерерасчетами"

	Дано Я открываю основную форму обработки "УправлениеПерерасчетами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПерерасчетами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПодключениемDSS"

	Дано Я открываю основную форму обработки "УправлениеПодключениемDSS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПодключениемDSS"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПоступлением"

	Дано Я открываю основную форму обработки "УправлениеПоступлением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПоступлением"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПринятойВозвратнойТарой"

	Дано Я открываю основную форму обработки "УправлениеПринятойВозвратнойТарой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПринятойВозвратнойТарой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПроцессомПланирования"

	Дано Я открываю основную форму обработки "УправлениеПроцессомПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПроцессомПланирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеСистемойВзаимодействия"

	Дано Я открываю основную форму обработки "УправлениеСистемойВзаимодействия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеСистемойВзаимодействия"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УсловияРегионализацииВЕТИС"

	Дано Я открываю основную форму обработки "УсловияРегионализацииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УсловияРегионализацииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УстановкаОбновлений"

	Дано Я открываю основную форму обработки "УстановкаОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УстановкаОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УчетныеЗаписиЭДО"

	Дано Я открываю основную форму обработки "УчетныеЗаписиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УчетныеЗаписиЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФайлыБТС"

	Дано Я открываю основную форму обработки "ФайлыБТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФайлыБТС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеДокументовНаВыплатуПоВедомостям"

	Дано Я открываю основную форму обработки "ФормированиеДокументовНаВыплатуПоВедомостям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеДокументовНаВыплатуПоВедомостям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеЗаказовНаПередачуВПроизводствоНаОсновании"

	Дано Я открываю основную форму обработки "ФормированиеЗаказовНаПередачуВПроизводствоНаОсновании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеЗаказовНаПередачуВПроизводствоНаОсновании"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеЗаказовНаПередачуВПроизводствоПоПлану"

	Дано Я открываю основную форму обработки "ФормированиеЗаказовНаПередачуВПроизводствоПоПлану"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеЗаказовНаПередачуВПроизводствоПоПлану"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеЗаказовНаПроизводствоПоПлану"

	Дано Я открываю основную форму обработки "ФормированиеЗаказовНаПроизводствоПоПлану"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеЗаказовНаПроизводствоПоПлану"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеЗаказовНаСборкуРазборкуПоПлану"

	Дано Я открываю основную форму обработки "ФормированиеЗаказовНаСборкуРазборкуПоПлану"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеЗаказовНаСборкуРазборкуПоПлану"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеЗаказовПоставщикам"

	Дано Я открываю основную форму обработки "ФормированиеЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеЗаказовПоставщикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеЗаказовПоставщикуПоПлану"

	Дано Я открываю основную форму обработки "ФормированиеЗаказовПоставщикуПоПлану"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеЗаказовПоставщикуПоПлану"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеПередачТоваровМеждуОрганизациямиИВыкупов"

	Дано Я открываю основную форму обработки "ФормированиеПередачТоваровМеждуОрганизациямиИВыкупов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеПередачТоваровМеждуОрганизациямиИВыкупов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеРасписанияРабочихЦентров"

	Дано Я открываю основную форму обработки "ФормированиеРасписанияРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеРасписанияРабочихЦентров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеСменныхЗаданий"

	Дано Я открываю основную форму обработки "ФормированиеСменныхЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеСменныхЗаданий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЭлектронноеВзаимодействие"

	Дано Я открываю основную форму обработки "ЭлектронноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЭлектронноеВзаимодействие"
	И Я закрываю текущее окно

