#language: ru

@tree
@быстрые проврки

Функциональность: Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "АвансовыйОтчет" 

	Дано Я открываю основную форму списка документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйОтчет"

	Дано Я открываю основную форму документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвансовыйПлатежИностранцаПоНДФЛ" 

	Дано Я открываю основную форму списка документа "АвансовыйПлатежИностранцаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйПлатежИностранцаПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйПлатежИностранцаПоНДФЛ"

	Дано Я открываю основную форму документа "АвансовыйПлатежИностранцаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйПлатежИностранцаПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктВыполненныхВнутреннихРабот" 

	Дано Я открываю основную форму списка документа "АктВыполненныхВнутреннихРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктВыполненныхВнутреннихРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктВыполненныхВнутреннихРабот"

	Дано Я открываю основную форму документа "АктВыполненныхВнутреннихРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктВыполненныхВнутреннихРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктВыполненныхРабот" 

	Дано Я открываю основную форму списка документа "АктВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктВыполненныхРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктВыполненныхРабот"

	Дано Я открываю основную форму документа "АктВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктВыполненныхРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеОтгрузки" 

	Дано Я открываю основную форму списка документа "АктОРасхожденияхПослеОтгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеОтгрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеОтгрузки"

	Дано Я открываю основную форму документа "АктОРасхожденияхПослеОтгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеОтгрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеПеремещения" 

	Дано Я открываю основную форму списка документа "АктОРасхожденияхПослеПеремещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеПеремещения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеПеремещения"

	Дано Я открываю основную форму документа "АктОРасхожденияхПослеПеремещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеПеремещения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеПриемки" 

	Дано Я открываю основную форму списка документа "АктОРасхожденияхПослеПриемки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеПриемки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеПриемки"

	Дано Я открываю основную форму документа "АктОРасхожденияхПослеПриемки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеПриемки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПостановкиНаБалансЕГАИС" 

	Дано Я открываю основную форму списка документа "АктПостановкиНаБалансЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПостановкиНаБалансЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПостановкиНаБалансЕГАИС"

	Дано Я открываю основную форму документа "АктПостановкиНаБалансЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПостановкиНаБалансЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПриемкиВыполненныхРаботОказанныхУслуг" 

	Дано Я открываю основную форму списка документа "АктПриемкиВыполненныхРаботОказанныхУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПриемкиВыполненныхРаботОказанныхУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПриемкиВыполненныхРаботОказанныхУслуг"

	Дано Я открываю основную форму документа "АктПриемкиВыполненныхРаботОказанныхУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПриемкиВыполненныхРаботОказанныхУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПроверкиСтраховыхВзносов" 

	Дано Я открываю основную форму списка документа "АктПроверкиСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПроверкиСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПроверкиСтраховыхВзносов"

	Дано Я открываю основную форму документа "АктПроверкиСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПроверкиСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктСписанияЕГАИС" 

	Дано Я открываю основную форму списка документа "АктСписанияЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСписанияЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктСписанияЕГАИС"

	Дано Я открываю основную форму документа "АктСписанияЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСписанияЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияНМА" 

	Дано Я открываю основную форму списка документа "АмортизацияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияНМА"

	Дано Я открываю основную форму документа "АмортизацияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияНМА2_4" 

	Дано Я открываю основную форму списка документа "АмортизацияНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияНМА2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияНМА2_4"

	Дано Я открываю основную форму документа "АмортизацияНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияНМА2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияНМАМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "АмортизацияНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияНМАМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияНМАМеждународныйУчет"

	Дано Я открываю основную форму документа "АмортизацияНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияНМАМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияОС" 

	Дано Я открываю основную форму списка документа "АмортизацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияОС"

	Дано Я открываю основную форму документа "АмортизацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияОС2_4" 

	Дано Я открываю основную форму списка документа "АмортизацияОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияОС2_4"

	Дано Я открываю основную форму документа "АмортизацияОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияОСМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "АмортизацияОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияОСМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияОСМеждународныйУчет"

	Дано Я открываю основную форму документа "АмортизацияОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияОСМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Анкета" 

	Дано Я открываю основную форму списка документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Анкета"

	Дано Я открываю основную форму документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АннулированиеПодарочныхСертификатов" 

	Дано Я открываю основную форму списка документа "АннулированиеПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АннулированиеПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АннулированиеПодарочныхСертификатов"

	Дано Я открываю основную форму документа "АннулированиеПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АннулированиеПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкаВычетаНДС" 

	Дано Я открываю основную форму списка документа "БлокировкаВычетаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БлокировкаВычетаНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкаВычетаНДС"

	Дано Я открываю основную форму документа "БлокировкаВычетаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БлокировкаВычетаНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БольничныйЛист" 

	Дано Я открываю основную форму списка документа "БольничныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БольничныйЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БольничныйЛист"

	Дано Я открываю основную форму документа "БольничныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БольничныйЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Бронирование" 

	Дано Я открываю основную форму списка документа "Бронирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бронирование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Бронирование"

	Дано Я открываю основную форму документа "Бронирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бронирование"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БронированиеГражданПребывающихВЗапасе" 

	Дано Я открываю основную форму списка документа "БронированиеГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БронированиеГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БронированиеГражданПребывающихВЗапасе"

	Дано Я открываю основную форму документа "БронированиеГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БронированиеГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетНачисленийСотрудников" 

	Дано Я открываю основную форму списка документа "БухучетНачисленийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БухучетНачисленийСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетНачисленийСотрудников"

	Дано Я открываю основную форму документа "БухучетНачисленийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БухучетНачисленийСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводВыводДенежныхСредствПоНаправлению" 

	Дано Я открываю основную форму списка документа "ВводВыводДенежныхСредствПоНаправлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводВыводДенежныхСредствПоНаправлению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводВыводДенежныхСредствПоНаправлению"

	Дано Я открываю основную форму документа "ВводВыводДенежныхСредствПоНаправлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводВыводДенежныхСредствПоНаправлению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводИнформацииОПрошлыхРемонтах" 

	Дано Я открываю основную форму списка документа "ВводИнформацииОПрошлыхРемонтах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводИнформацииОПрошлыхРемонтах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводИнформацииОПрошлыхРемонтах"

	Дано Я открываю основную форму документа "ВводИнформацииОПрошлыхРемонтах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводИнформацииОПрошлыхРемонтах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводНачальныхОстатковОтпусков" 

	Дано Я открываю основную форму списка документа "ВводНачальныхОстатковОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводНачальныхОстатковОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводНачальныхОстатковОтпусков"

	Дано Я открываю основную форму документа "ВводНачальныхОстатковОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводНачальныхОстатковОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатков" 

	Дано Я открываю основную форму списка документа "ВводОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатков"

	Дано Я открываю основную форму документа "ВводОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковВзаиморасчетов" 

	Дано Я открываю основную форму списка документа "ВводОстатковВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковВзаиморасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковВзаиморасчетов"

	Дано Я открываю основную форму документа "ВводОстатковВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковВзаиморасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковВзаиморасчетовПоАренде" 

	Дано Я открываю основную форму списка документа "ВводОстатковВзаиморасчетовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковВзаиморасчетовПоАренде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковВзаиморасчетовПоАренде"

	Дано Я открываю основную форму документа "ВводОстатковВзаиморасчетовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковВзаиморасчетовПоАренде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковВнеоборотныхАктивов" 

	Дано Я открываю основную форму списка документа "ВводОстатковВнеоборотныхАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковВнеоборотныхАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковВнеоборотныхАктивов"

	Дано Я открываю основную форму документа "ВводОстатковВнеоборотныхАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковВнеоборотныхАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковВнеоборотныхАктивов2_4" 

	Дано Я открываю основную форму списка документа "ВводОстатковВнеоборотныхАктивов2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковВнеоборотныхАктивов2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковВнеоборотныхАктивов2_4"

	Дано Я открываю основную форму документа "ВводОстатковВнеоборотныхАктивов2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковВнеоборотныхАктивов2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ВводОстатковДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковДенежныхСредств"

	Дано Я открываю основную форму документа "ВводОстатковДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковНДСПредъявленного" 

	Дано Я открываю основную форму списка документа "ВводОстатковНДСПредъявленного"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковНДСПредъявленного"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковНДСПредъявленного"

	Дано Я открываю основную форму документа "ВводОстатковНДСПредъявленного"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковНДСПредъявленного"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковНМАМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "ВводОстатковНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковНМАМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковНМАМеждународныйУчет"

	Дано Я открываю основную форму документа "ВводОстатковНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковНМАМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковОПродажахЗаПрошлыеПериоды" 

	Дано Я открываю основную форму списка документа "ВводОстатковОПродажахЗаПрошлыеПериоды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковОПродажахЗаПрошлыеПериоды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковОПродажахЗаПрошлыеПериоды"

	Дано Я открываю основную форму документа "ВводОстатковОПродажахЗаПрошлыеПериоды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковОПродажахЗаПрошлыеПериоды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковОСМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "ВводОстатковОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковОСМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковОСМеждународныйУчет"

	Дано Я открываю основную форму документа "ВводОстатковОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковОСМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковПоФинансовымИнструментам" 

	Дано Я открываю основную форму списка документа "ВводОстатковПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковПоФинансовымИнструментам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковПоФинансовымИнструментам"

	Дано Я открываю основную форму документа "ВводОстатковПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковПоФинансовымИнструментам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковПрочиеРасходы" 

	Дано Я открываю основную форму списка документа "ВводОстатковПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковПрочиеРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковПрочиеРасходы"

	Дано Я открываю основную форму документа "ВводОстатковПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковПрочиеРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковПрочихАктивовПассивов" 

	Дано Я открываю основную форму списка документа "ВводОстатковПрочихАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковПрочихАктивовПассивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковПрочихАктивовПассивов"

	Дано Я открываю основную форму документа "ВводОстатковПрочихАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковПрочихАктивовПассивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковРасходовПриУСН" 

	Дано Я открываю основную форму списка документа "ВводОстатковРасходовПриУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковРасходовПриУСН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковРасходовПриУСН"

	Дано Я открываю основную форму документа "ВводОстатковРасходовПриУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковРасходовПриУСН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковРасчетовПоЭквайрингу" 

	Дано Я открываю основную форму списка документа "ВводОстатковРасчетовПоЭквайрингу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковРасчетовПоЭквайрингу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковРасчетовПоЭквайрингу"

	Дано Я открываю основную форму документа "ВводОстатковРасчетовПоЭквайрингу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковРасчетовПоЭквайрингу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковСПодотчетниками" 

	Дано Я открываю основную форму списка документа "ВводОстатковСПодотчетниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковСПодотчетниками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковСПодотчетниками"

	Дано Я открываю основную форму документа "ВводОстатковСПодотчетниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковСПодотчетниками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка документа "ВводОстатковТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковТМЦВЭксплуатации"

	Дано Я открываю основную форму документа "ВводОстатковТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковТоваров" 

	Дано Я открываю основную форму списка документа "ВводОстатковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковТоваров"

	Дано Я открываю основную форму документа "ВводОстатковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыВБанк" 

	Дано Я открываю основную форму списка документа "ВедомостьНаВыплатуЗарплатыВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыВБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыВБанк"

	Дано Я открываю основную форму документа "ВедомостьНаВыплатуЗарплатыВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыВБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыВКассу" 

	Дано Я открываю основную форму списка документа "ВедомостьНаВыплатуЗарплатыВКассу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыВКассу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыВКассу"

	Дано Я открываю основную форму документа "ВедомостьНаВыплатуЗарплатыВКассу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыВКассу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыПеречислением" 

	Дано Я открываю основную форму списка документа "ВедомостьНаВыплатуЗарплатыПеречислением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыПеречислением"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыПеречислением"

	Дано Я открываю основную форму документа "ВедомостьНаВыплатуЗарплатыПеречислением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыПеречислением"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыРаздатчиком" 

	Дано Я открываю основную форму списка документа "ВедомостьНаВыплатуЗарплатыРаздатчиком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыРаздатчиком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыРаздатчиком"

	Дано Я открываю основную форму документа "ВедомостьНаВыплатуЗарплатыРаздатчиком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыРаздатчиком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьПрочихДоходовВБанк" 

	Дано Я открываю основную форму списка документа "ВедомостьПрочихДоходовВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьПрочихДоходовВБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьПрочихДоходовВБанк"

	Дано Я открываю основную форму документа "ВедомостьПрочихДоходовВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьПрочихДоходовВБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьПрочихДоходовВКассу" 

	Дано Я открываю основную форму списка документа "ВедомостьПрочихДоходовВКассу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьПрочихДоходовВКассу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьПрочихДоходовВКассу"

	Дано Я открываю основную форму документа "ВедомостьПрочихДоходовВКассу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьПрочихДоходовВКассу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьПрочихДоходовПеречислением" 

	Дано Я открываю основную форму списка документа "ВедомостьПрочихДоходовПеречислением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьПрочихДоходовПеречислением"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьПрочихДоходовПеречислением"

	Дано Я открываю основную форму документа "ВедомостьПрочихДоходовПеречислением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьПрочихДоходовПеречислением"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьУплатыАДВ_11" 

	Дано Я открываю основную форму списка документа "ВедомостьУплатыАДВ_11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьУплатыАДВ_11"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьУплатыАДВ_11"

	Дано Я открываю основную форму документа "ВедомостьУплатыАДВ_11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьУплатыАДВ_11"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаимозачетЗадолженности" 

	Дано Я открываю основную форму списка документа "ВзаимозачетЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВзаимозачетЗадолженности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаимозачетЗадолженности"

	Дано Я открываю основную форму документа "ВзаимозачетЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВзаимозачетЗадолженности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнесениеДенежныхСредствВКассуККМ" 

	Дано Я открываю основную форму списка документа "ВнесениеДенежныхСредствВКассуККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнесениеДенежныхСредствВКассуККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнесениеДенежныхСредствВКассуККМ"

	Дано Я открываю основную форму документа "ВнесениеДенежныхСредствВКассуККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнесениеДенежныхСредствВКассуККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнутреннееПотреблениеТоваров" 

	Дано Я открываю основную форму списка документа "ВнутреннееПотреблениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнутреннееПотреблениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнутреннееПотреблениеТоваров"

	Дано Я открываю основную форму документа "ВнутреннееПотреблениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнутреннееПотреблениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратВОборотИСМП" 

	Дано Я открываю основную форму списка документа "ВозвратВОборотИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратВОборотИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратВОборотИСМП"

	Дано Я открываю основную форму документа "ВозвратВОборотИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратВОборотИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратИзОтпускаПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка документа "ВозвратИзОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратИзОтпускаПоУходуЗаРебенком"

	Дано Я открываю основную форму документа "ВозвратИзОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратИзРегистра2ЕГАИС" 

	Дано Я открываю основную форму списка документа "ВозвратИзРегистра2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРегистра2ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратИзРегистра2ЕГАИС"

	Дано Я открываю основную форму документа "ВозвратИзРегистра2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРегистра2ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратМатериаловИзПроизводства" 

	Дано Я открываю основную форму списка документа "ВозвратМатериаловИзПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратМатериаловИзПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратМатериаловИзПроизводства"

	Дано Я открываю основную форму документа "ВозвратМатериаловИзПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратМатериаловИзПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратНДФЛ" 

	Дано Я открываю основную форму списка документа "ВозвратНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратНДФЛ"

	Дано Я открываю основную форму документа "ВозвратНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратОСИзАренды" 

	Дано Я открываю основную форму списка документа "ВозвратОСИзАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратОСИзАренды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратОСИзАренды"

	Дано Я открываю основную форму документа "ВозвратОСИзАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратОСИзАренды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратОСИзАренды2_4" 

	Дано Я открываю основную форму списка документа "ВозвратОСИзАренды2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратОСИзАренды2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратОСИзАренды2_4"

	Дано Я открываю основную форму документа "ВозвратОСИзАренды2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратОСИзАренды2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратПодарочныхСертификатов" 

	Дано Я открываю основную форму списка документа "ВозвратПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратПодарочныхСертификатов"

	Дано Я открываю основную форму документа "ВозвратПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратСырьяДавальцу" 

	Дано Я открываю основную форму списка документа "ВозвратСырьяДавальцу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратСырьяДавальцу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратСырьяДавальцу"

	Дано Я открываю основную форму документа "ВозвратСырьяДавальцу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратСырьяДавальцу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратСырьяОтПереработчика" 

	Дано Я открываю основную форму списка документа "ВозвратСырьяОтПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратСырьяОтПереработчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратСырьяОтПереработчика"

	Дано Я открываю основную форму документа "ВозвратСырьяОтПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратСырьяОтПереработчика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровМеждуОрганизациями" 

	Дано Я открываю основную форму списка документа "ВозвратТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровМеждуОрганизациями"

	Дано Я открываю основную форму документа "ВозвратТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровОтКлиента" 

	Дано Я открываю основную форму списка документа "ВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровОтКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровОтКлиента"

	Дано Я открываю основную форму документа "ВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровОтКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровПоставщику" 

	Дано Я открываю основную форму списка документа "ВозвратТоваровПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровПоставщику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровПоставщику"

	Дано Я открываю основную форму документа "ВозвратТоваровПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровПоставщику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозмещениеБольничныхВЧастиФБ" 

	Дано Я открываю основную форму списка документа "ВозмещениеБольничныхВЧастиФБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозмещениеБольничныхВЧастиФБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозмещениеБольничныхВЧастиФБ"

	Дано Я открываю основную форму документа "ВозмещениеБольничныхВЧастиФБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозмещениеБольничныхВЧастиФБ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВосстановлениеВДолжности" 

	Дано Я открываю основную форму списка документа "ВосстановлениеВДолжности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВосстановлениеВДолжности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВосстановлениеВДолжности"

	Дано Я открываю основную форму документа "ВосстановлениеВДолжности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВосстановлениеВДолжности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВосстановлениеНДСПоОбъектамНедвижимости" 

	Дано Я открываю основную форму списка документа "ВосстановлениеНДСПоОбъектамНедвижимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВосстановлениеНДСПоОбъектамНедвижимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВосстановлениеНДСПоОбъектамНедвижимости"

	Дано Я открываю основную форму документа "ВосстановлениеНДСПоОбъектамНедвижимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВосстановлениеНДСПоОбъектамНедвижимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Встреча" 

	Дано Я открываю основную форму списка документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Встреча"

	Дано Я открываю основную форму документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящаяСправкаОЗаработкеДляРасчетаПособий" 

	Дано Я открываю основную форму списка документа "ВходящаяСправкаОЗаработкеДляРасчетаПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяСправкаОЗаработкеДляРасчетаПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящаяСправкаОЗаработкеДляРасчетаПособий"

	Дано Я открываю основную форму документа "ВходящаяСправкаОЗаработкеДляРасчетаПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяСправкаОЗаработкеДляРасчетаПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящаяТранспортнаяОперацияВЕТИС" 

	Дано Я открываю основную форму списка документа "ВходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящаяТранспортнаяОперацияВЕТИС"

	Дано Я открываю основную форму документа "ВходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящийЗапросСведенийДляРасчетаПособияФСС" 

	Дано Я открываю основную форму списка документа "ВходящийЗапросСведенийДляРасчетаПособияФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящийЗапросСведенийДляРасчетаПособияФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящийЗапросСведенийДляРасчетаПособияФСС"

	Дано Я открываю основную форму документа "ВходящийЗапросСведенийДляРасчетаПособияФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящийЗапросСведенийДляРасчетаПособияФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыбытиеАрендованныхОС" 

	Дано Я открываю основную форму списка документа "ВыбытиеАрендованныхОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыбытиеАрендованныхОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыбытиеАрендованныхОС"

	Дано Я открываю основную форму документа "ВыбытиеАрендованныхОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыбытиеАрендованныхОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыбытиеДенежныхДокументов" 

	Дано Я открываю основную форму списка документа "ВыбытиеДенежныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыбытиеДенежныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыбытиеДенежныхДокументов"

	Дано Я открываю основную форму документа "ВыбытиеДенежныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыбытиеДенежныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыводИзОборотаИСМП" 

	Дано Я открываю основную форму списка документа "ВыводИзОборотаИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыводИзОборотаИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыводИзОборотаИСМП"

	Дано Я открываю основную форму документа "ВыводИзОборотаИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыводИзОборотаИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыгрузкаРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка документа "ВыгрузкаРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыгрузкаРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыгрузкаРегламентированныхОтчетов"

	Дано Я открываю основную форму документа "ВыгрузкаРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыгрузкаРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыемкаДенежныхСредствИзКассыККМ" 

	Дано Я открываю основную форму списка документа "ВыемкаДенежныхСредствИзКассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыемкаДенежныхСредствИзКассыККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыемкаДенежныхСредствИзКассыККМ"

	Дано Я открываю основную форму документа "ВыемкаДенежныхСредствИзКассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыемкаДенежныхСредствИзКассыККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупАрендованныхОС" 

	Дано Я открываю основную форму списка документа "ВыкупАрендованныхОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупАрендованныхОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупАрендованныхОС"

	Дано Я открываю основную форму документа "ВыкупАрендованныхОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупАрендованныхОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупВозвратнойТарыКлиентом" 

	Дано Я открываю основную форму списка документа "ВыкупВозвратнойТарыКлиентом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупВозвратнойТарыКлиентом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупВозвратнойТарыКлиентом"

	Дано Я открываю основную форму документа "ВыкупВозвратнойТарыКлиентом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупВозвратнойТарыКлиентом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупВозвратнойТарыУПоставщика" 

	Дано Я открываю основную форму списка документа "ВыкупВозвратнойТарыУПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупВозвратнойТарыУПоставщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупВозвратнойТарыУПоставщика"

	Дано Я открываю основную форму документа "ВыкупВозвратнойТарыУПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупВозвратнойТарыУПоставщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупПринятыхНаХранениеТоваров" 

	Дано Я открываю основную форму списка документа "ВыкупПринятыхНаХранениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупПринятыхНаХранениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупПринятыхНаХранениеТоваров"

	Дано Я открываю основную форму документа "ВыкупПринятыхНаХранениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупПринятыхНаХранениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупТоваровХранителем" 

	Дано Я открываю основную форму списка документа "ВыкупТоваровХранителем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупТоваровХранителем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупТоваровХранителем"

	Дано Я открываю основную форму документа "ВыкупТоваровХранителем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупТоваровХранителем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатаБывшимСотрудникам" 

	Дано Я открываю основную форму списка документа "ВыплатаБывшимСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатаБывшимСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатаБывшимСотрудникам"

	Дано Я открываю основную форму документа "ВыплатаБывшимСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатаБывшимСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатыПоДоговорамОпеки" 

	Дано Я открываю основную форму списка документа "ВыплатыПоДоговорамОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатыПоДоговорамОпеки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатыПоДоговорамОпеки"

	Дано Я открываю основную форму документа "ВыплатыПоДоговорамОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатыПоДоговорамОпеки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыпускПродукции" 

	Дано Я открываю основную форму списка документа "ВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыпускПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыпускПродукции"

	Дано Я открываю основную форму документа "ВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыпускПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыработкаНМА" 

	Дано Я открываю основную форму списка документа "ВыработкаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыработкаНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыработкаНМА"

	Дано Я открываю основную форму документа "ВыработкаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыработкаНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыработкаСотрудников" 

	Дано Я открываю основную форму списка документа "ВыработкаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыработкаСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыработкаСотрудников"

	Дано Я открываю основную форму документа "ВыработкаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыработкаСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикИсполненияДоговора" 

	Дано Я открываю основную форму списка документа "ГрафикИсполненияДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикИсполненияДоговора"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикИсполненияДоговора"

	Дано Я открываю основную форму документа "ГрафикИсполненияДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикИсполненияДоговора"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикОтпусков" 

	Дано Я открываю основную форму списка документа "ГрафикОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикОтпусков"

	Дано Я открываю основную форму документа "ГрафикОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеДляРасчетаЗарплаты" 

	Дано Я открываю основную форму списка документа "ДанныеДляРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДанныеДляРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеДляРасчетаЗарплаты"

	Дано Я открываю основную форму документа "ДанныеДляРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДанныеДляРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР" 

	Дано Я открываю основную форму списка документа "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"

	Дано Я открываю основную форму документа "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвижениеПродукцииИМатериалов" 

	Дано Я открываю основную форму списка документа "ДвижениеПродукцииИМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДвижениеПродукцииИМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвижениеПродукцииИМатериалов"

	Дано Я открываю основную форму документа "ДвижениеПродукцииИМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДвижениеПродукцииИМатериалов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвижениеПрочихАктивовПассивов" 

	Дано Я открываю основную форму списка документа "ДвижениеПрочихАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДвижениеПрочихАктивовПассивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвижениеПрочихАктивовПассивов"

	Дано Я открываю основную форму документа "ДвижениеПрочихАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДвижениеПрочихАктивовПассивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДепонированиеЗарплаты" 

	Дано Я открываю основную форму списка документа "ДепонированиеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДепонированиеЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДепонированиеЗарплаты"

	Дано Я открываю основную форму документа "ДепонированиеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДепонированиеЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоверенностьВыданная" 

	Дано Я открываю основную форму списка документа "ДоверенностьВыданная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоверенностьВыданная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоверенностьВыданная"

	Дано Я открываю основную форму документа "ДоверенностьВыданная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоверенностьВыданная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорАвторскогоЗаказа" 

	Дано Я открываю основную форму списка документа "ДоговорАвторскогоЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорАвторскогоЗаказа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорАвторскогоЗаказа"

	Дано Я открываю основную форму документа "ДоговорАвторскогоЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорАвторскогоЗаказа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорЗаймаСотруднику" 

	Дано Я открываю основную форму списка документа "ДоговорЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорЗаймаСотруднику"

	Дано Я открываю основную форму документа "ДоговорЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорРаботыУслуги" 

	Дано Я открываю основную форму списка документа "ДоговорРаботыУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорРаботыУслуги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорРаботыУслуги"

	Дано Я открываю основную форму документа "ДоговорРаботыУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорРаботыУслуги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументКадровогоЭДО" 

	Дано Я открываю основную форму списка документа "ДокументКадровогоЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДокументКадровогоЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументКадровогоЭДО"

	Дано Я открываю основную форму документа "ДокументКадровогоЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДокументКадровогоЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде" 

	Дано Я открываю основную форму списка документа "ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"

	Дано Я открываю основную форму документа "ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДопЛистКнигиПродажДляПередачиВЭлектронномВиде" 

	Дано Я открываю основную форму списка документа "ДопЛистКнигиПродажДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДопЛистКнигиПродажДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДопЛистКнигиПродажДляПередачиВЭлектронномВиде"

	Дано Я открываю основную форму документа "ДопЛистКнигиПродажДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДопЛистКнигиПродажДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступностьВидаРабочихЦентров" 

	Дано Я открываю основную форму списка документа "ДоступностьВидаРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоступностьВидаРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступностьВидаРабочихЦентров"

	Дано Я открываю основную форму документа "ДоступностьВидаРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоступностьВидаРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступностьРабочихЦентров" 

	Дано Я открываю основную форму списка документа "ДоступностьРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоступностьРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступностьРабочихЦентров"

	Дано Я открываю основную форму документа "ДоступностьРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоступностьРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоходВНатуральнойФорме" 

	Дано Я открываю основную форму списка документа "ДоходВНатуральнойФорме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоходВНатуральнойФорме"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоходВНатуральнойФорме"

	Дано Я открываю основную форму документа "ДоходВНатуральнойФорме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоходВНатуральнойФорме"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЕдиновременноеПособиеЗаСчетФСС" 

	Дано Я открываю основную форму списка документа "ЕдиновременноеПособиеЗаСчетФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЕдиновременноеПособиеЗаСчетФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕдиновременноеПособиеЗаСчетФСС"

	Дано Я открываю основную форму документа "ЕдиновременноеПособиеЗаСчетФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЕдиновременноеПособиеЗаСчетФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде" 

	Дано Я открываю основную форму списка документа "ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде"

	Дано Я открываю основную форму документа "ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданиеНаПеревозку" 

	Дано Я открываю основную форму списка документа "ЗаданиеНаПеревозку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеНаПеревозку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданиеНаПеревозку"

	Дано Я открываю основную форму документа "ЗаданиеНаПеревозку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеНаПеревозку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданиеТорговомуПредставителю" 

	Дано Я открываю основную форму списка документа "ЗаданиеТорговомуПредставителю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеТорговомуПредставителю"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданиеТорговомуПредставителю"

	Дано Я открываю основную форму документа "ЗаданиеТорговомуПредставителю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеТорговомуПредставителю"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказДавальца" 

	Дано Я открываю основную форму списка документа "ЗаказДавальца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказДавальца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказДавальца"

	Дано Я открываю основную форму документа "ЗаказДавальца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказДавальца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказКлиента" 

	Дано Я открываю основную форму списка документа "ЗаказКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказКлиента"

	Дано Я открываю основную форму документа "ЗаказКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказМатериаловВПроизводство" 

	Дано Я открываю основную форму списка документа "ЗаказМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказМатериаловВПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказМатериаловВПроизводство"

	Дано Я открываю основную форму документа "ЗаказМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказМатериаловВПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаВнутреннееПотребление" 

	Дано Я открываю основную форму списка документа "ЗаказНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаВнутреннееПотребление"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаВнутреннееПотребление"

	Дано Я открываю основную форму документа "ЗаказНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаВнутреннееПотребление"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаПеремещение" 

	Дано Я открываю основную форму списка документа "ЗаказНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПеремещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаПеремещение"

	Дано Я открываю основную форму документа "ЗаказНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПеремещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаПроизводство" 

	Дано Я открываю основную форму списка документа "ЗаказНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаПроизводство"

	Дано Я открываю основную форму документа "ЗаказНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаПроизводство2_2" 

	Дано Я открываю основную форму списка документа "ЗаказНаПроизводство2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПроизводство2_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаПроизводство2_2"

	Дано Я открываю основную форму документа "ЗаказНаПроизводство2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПроизводство2_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаРемонт" 

	Дано Я открываю основную форму списка документа "ЗаказНаРемонт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаРемонт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаРемонт"

	Дано Я открываю основную форму документа "ЗаказНаРемонт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаРемонт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаСборку" 

	Дано Я открываю основную форму списка документа "ЗаказНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаСборку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаСборку"

	Дано Я открываю основную форму документа "ЗаказНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаСборку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаЭмиссиюКодовМаркировкиСУЗ" 

	Дано Я открываю основную форму списка документа "ЗаказНаЭмиссиюКодовМаркировкиСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаЭмиссиюКодовМаркировкиСУЗ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаЭмиссиюКодовМаркировкиСУЗ"

	Дано Я открываю основную форму документа "ЗаказНаЭмиссиюКодовМаркировкиСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаЭмиссиюКодовМаркировкиСУЗ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПереработчику" 

	Дано Я открываю основную форму списка документа "ЗаказПереработчику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПереработчику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПереработчику"

	Дано Я открываю основную форму документа "ЗаказПереработчику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПереработчику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПоставщику" 

	Дано Я открываю основную форму списка документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПоставщику"

	Дано Я открываю основную форму документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаключениеДоговораАренды" 

	Дано Я открываю основную форму списка документа "ЗаключениеДоговораАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаключениеДоговораАренды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаключениеДоговораАренды"

	Дано Я открываю основную форму документа "ЗаключениеДоговораАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаключениеДоговораАренды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписьКнигиПокупок" 

	Дано Я открываю основную форму списка документа "ЗаписьКнигиПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКнигиПокупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписьКнигиПокупок"

	Дано Я открываю основную форму документа "ЗаписьКнигиПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКнигиПокупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписьКнигиПродаж" 

	Дано Я открываю основную форму списка документа "ЗаписьКнигиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКнигиПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписьКнигиПродаж"

	Дано Я открываю основную форму документа "ЗаписьКнигиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКнигиПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписьКУДиР" 

	Дано Я открываю основную форму списка документа "ЗаписьКУДиР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКУДиР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписьКУДиР"

	Дано Я открываю основную форму документа "ЗаписьКУДиР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКУДиР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействие" 

	Дано Я открываю основную форму списка документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапланированноеВзаимодействие"

	Дано Я открываю основную форму документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросАкцизныхМарокЕГАИС" 

	Дано Я открываю основную форму списка документа "ЗапросАкцизныхМарокЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросАкцизныхМарокЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросАкцизныхМарокЕГАИС"

	Дано Я открываю основную форму документа "ЗапросАкцизныхМарокЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросАкцизныхМарокЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросВФССОПроверкеРаботодателя" 

	Дано Я открываю основную форму списка документа "ЗапросВФССОПроверкеРаботодателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросВФССОПроверкеРаботодателя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросВФССОПроверкеРаботодателя"

	Дано Я открываю основную форму документа "ЗапросВФССОПроверкеРаботодателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросВФССОПроверкеРаботодателя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросКоммерческихПредложенийПоставщиков" 

	Дано Я открываю основную форму списка документа "ЗапросКоммерческихПредложенийПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросКоммерческихПредложенийПоставщиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросКоммерческихПредложенийПоставщиков"

	Дано Я открываю основную форму документа "ЗапросКоммерческихПредложенийПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросКоммерческихПредложенийПоставщиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросКоммерческогоПредложенияОтКлиента" 

	Дано Я открываю основную форму списка документа "ЗапросКоммерческогоПредложенияОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросКоммерческогоПредложенияОтКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросКоммерческогоПредложенияОтКлиента"

	Дано Я открываю основную форму документа "ЗапросКоммерческогоПредложенияОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросКоммерческогоПредложенияОтКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка документа "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму документа "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика" 

	Дано Я открываю основную форму списка документа "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"

	Дано Я открываю основную форму документа "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросНаИнформационноеОбслуживаниеСтрахователя" 

	Дано Я открываю основную форму списка документа "ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросНаИнформационноеОбслуживаниеСтрахователя"

	Дано Я открываю основную форму документа "ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросСкладскогоЖурналаВЕТИС" 

	Дано Я открываю основную форму списка документа "ЗапросСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросСкладскогоЖурналаВЕТИС"

	Дано Я открываю основную форму документа "ЗапросСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВозвратТоваровОтКлиента" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВозвратТоваровОтКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВозвратТоваровОтКлиента"

	Дано Я открываю основную форму документа "ЗаявкаНаВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВозвратТоваровОтКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВыпускКиЗГИСМ" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВыпускКиЗГИСМ"

	Дано Я открываю основную форму документа "ЗаявкаНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"

	Дано Я открываю основную форму документа "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаКомандировку" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаКомандировку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаКомандировку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаКомандировку"

	Дано Я открываю основную форму документа "ЗаявкаНаКомандировку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаКомандировку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"

	Дано Я открываю основную форму документа "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаРасходованиеДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаРасходованиеДенежныхСредств"

	Дано Я открываю основную форму документа "ЗаявкаНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкиНаЛьготныйКредит" 

	Дано Я открываю основную форму списка документа "ЗаявкиНаЛьготныйКредит"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкиНаЛьготныйКредит"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкиНаЛьготныйКредит"

	Дано Я открываю основную форму документа "ЗаявкиНаЛьготныйКредит"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкиНаЛьготныйКредит"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеАбонентаСпецоператораСвязи" 

	Дано Я открываю основную форму списка документа "ЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеАбонентаСпецоператораСвязи"

	Дано Я открываю основную форму документа "ЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов" 

	Дано Я открываю основную форму списка документа "ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов"

	Дано Я открываю основную форму документа "ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеВФССОВозмещенииРасходовНаПогребение" 

	Дано Я открываю основную форму списка документа "ЗаявлениеВФССОВозмещенииРасходовНаПогребение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеВФССОВозмещенииРасходовНаПогребение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеВФССОВозмещенииРасходовНаПогребение"

	Дано Я открываю основную форму документа "ЗаявлениеВФССОВозмещенииРасходовНаПогребение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеВФССОВозмещенииРасходовНаПогребение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеИЗапросВПФРОЗаработке" 

	Дано Я открываю основную форму списка документа "ЗаявлениеИЗапросВПФРОЗаработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеИЗапросВПФРОЗаработке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеИЗапросВПФРОЗаработке"

	Дано Я открываю основную форму документа "ЗаявлениеИЗапросВПФРОЗаработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеИЗапросВПФРОЗаработке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ" 

	Дано Я открываю основную форму списка документа "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"

	Дано Я открываю основную форму документа "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеОВвозеТоваров" 

	Дано Я открываю основную форму списка документа "ЗаявлениеОВвозеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеОВвозеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеОВвозеТоваров"

	Дано Я открываю основную форму документа "ЗаявлениеОВвозеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеОВвозеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ" 

	Дано Я открываю основную форму списка документа "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"

	Дано Я открываю основную форму документа "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеСотрудникаНаВыплатуПособия" 

	Дано Я открываю основную форму списка документа "ЗаявлениеСотрудникаНаВыплатуПособия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеСотрудникаНаВыплатуПособия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеСотрудникаНаВыплатуПособия"

	Дано Я открываю основную форму документа "ЗаявлениеСотрудникаНаВыплатуПособия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеСотрудникаНаВыплатуПособия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявленияОПредоставленииСведенийОТрудовойДеятельности" 

	Дано Я открываю основную форму списка документа "ЗаявленияОПредоставленииСведенийОТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявленияОПредоставленииСведенийОТрудовойДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявленияОПредоставленииСведенийОТрудовойДеятельности"

	Дано Я открываю основную форму документа "ЗаявленияОПредоставленииСведенийОТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявленияОПредоставленииСведенийОТрудовойДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявленияПоЭлДокументооборотуСПФР" 

	Дано Я открываю основную форму списка документа "ЗаявленияПоЭлДокументооборотуСПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявленияПоЭлДокументооборотуСПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявленияПоЭлДокументооборотуСПФР"

	Дано Я открываю основную форму документа "ЗаявленияПоЭлДокументооборотуСПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявленияПоЭлДокументооборотуСПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзвещениеФСС" 

	Дано Я открываю основную форму списка документа "ИзвещениеФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзвещениеФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзвещениеФСС"

	Дано Я открываю основную форму документа "ИзвещениеФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзвещениеФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзделияИЗатратыНЗП" 

	Дано Я открываю основную форму списка документа "ИзделияИЗатратыНЗП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзделияИЗатратыНЗП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзделияИЗатратыНЗП"

	Дано Я открываю основную форму документа "ИзделияИЗатратыНЗП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзделияИЗатратыНЗП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеАванса" 

	Дано Я открываю основную форму списка документа "ИзменениеАванса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеАванса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеАванса"

	Дано Я открываю основную форму документа "ИзменениеАванса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеАванса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеАссортимента" 

	Дано Я открываю основную форму списка документа "ИзменениеАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеАссортимента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеАссортимента"

	Дано Я открываю основную форму документа "ИзменениеАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеАссортимента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеГрафикаРаботыСписком" 

	Дано Я открываю основную форму списка документа "ИзменениеГрафикаРаботыСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеГрафикаРаботыСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеГрафикаРаботыСписком"

	Дано Я открываю основную форму документа "ИзменениеГрафикаРаботыСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеГрафикаРаботыСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеКвалификационногоРазряда" 

	Дано Я открываю основную форму списка документа "ИзменениеКвалификационногоРазряда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеКвалификационногоРазряда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеКвалификационногоРазряда"

	Дано Я открываю основную форму документа "ИзменениеКвалификационногоРазряда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеКвалификационногоРазряда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеМестРаботы" 

	Дано Я открываю основную форму списка документа "ИзменениеМестРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеМестРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеМестРаботы"

	Дано Я открываю основную форму документа "ИзменениеМестРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеМестРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеОплатыТруда" 

	Дано Я открываю основную форму списка документа "ИзменениеОплатыТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеОплатыТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеОплатыТруда"

	Дано Я открываю основную форму документа "ИзменениеОплатыТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеОплатыТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПараметровНМА" 

	Дано Я открываю основную форму списка документа "ИзменениеПараметровНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПараметровНМА"

	Дано Я открываю основную форму документа "ИзменениеПараметровНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПараметровНМА2_4" 

	Дано Я открываю основную форму списка документа "ИзменениеПараметровНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровНМА2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПараметровНМА2_4"

	Дано Я открываю основную форму документа "ИзменениеПараметровНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровНМА2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПараметровНМАМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "ИзменениеПараметровНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровНМАМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПараметровНМАМеждународныйУчет"

	Дано Я открываю основную форму документа "ИзменениеПараметровНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровНМАМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПараметровОС" 

	Дано Я открываю основную форму списка документа "ИзменениеПараметровОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПараметровОС"

	Дано Я открываю основную форму документа "ИзменениеПараметровОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПараметровОС2_4" 

	Дано Я открываю основную форму списка документа "ИзменениеПараметровОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПараметровОС2_4"

	Дано Я открываю основную форму документа "ИзменениеПараметровОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПараметровОСМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "ИзменениеПараметровОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровОСМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПараметровОСМеждународныйУчет"

	Дано Я открываю основную форму документа "ИзменениеПараметровОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровОСМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПлановыхНачислений" 

	Дано Я открываю основную форму списка документа "ИзменениеПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПлановыхНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПлановыхНачислений"

	Дано Я открываю основную форму документа "ИзменениеПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПлановыхНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеСостоянияОС" 

	Дано Я открываю основную форму списка документа "ИзменениеСостоянияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеСостоянияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеСостоянияОС"

	Дано Я открываю основную форму документа "ИзменениеСостоянияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеСостоянияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеСпособаОтраженияИмущественныхНалогов" 

	Дано Я открываю основную форму списка документа "ИзменениеСпособаОтраженияИмущественныхНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеСпособаОтраженияИмущественныхНалогов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеСпособаОтраженияИмущественныхНалогов"

	Дано Я открываю основную форму документа "ИзменениеСпособаОтраженияИмущественныхНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеСпособаОтраженияИмущественныхНалогов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийДоговораАренды" 

	Дано Я открываю основную форму списка документа "ИзменениеУсловийДоговораАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийДоговораАренды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийДоговораАренды"

	Дано Я открываю основную форму документа "ИзменениеУсловийДоговораАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийДоговораАренды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийДоговораЗаймаСотруднику" 

	Дано Я открываю основную форму списка документа "ИзменениеУсловийДоговораЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийДоговораЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийДоговораЗаймаСотруднику"

	Дано Я открываю основную форму документа "ИзменениеУсловийДоговораЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийДоговораЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийИсполнительногоЛиста" 

	Дано Я открываю основную форму списка документа "ИзменениеУсловийИсполнительногоЛиста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийИсполнительногоЛиста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийИсполнительногоЛиста"

	Дано Я открываю основную форму документа "ИзменениеУсловийИсполнительногоЛиста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийИсполнительногоЛиста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка документа "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"

	Дано Я открываю основную форму документа "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеШтатногоРасписания" 

	Дано Я открываю основную форму списка документа "ИзменениеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеШтатногоРасписания"

	Дано Я открываю основную форму документа "ИзменениеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризационнаяОпись" 

	Дано Я открываю основную форму списка документа "ИнвентаризационнаяОпись"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризационнаяОпись"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризационнаяОпись"

	Дано Я открываю основную форму документа "ИнвентаризационнаяОпись"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризационнаяОпись"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияНаличныхДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ИнвентаризацияНаличныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияНаличныхДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияНаличныхДенежныхСредств"

	Дано Я открываю основную форму документа "ИнвентаризацияНаличныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияНаличныхДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияНМА" 

	Дано Я открываю основную форму списка документа "ИнвентаризацияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияНМА"

	Дано Я открываю основную форму документа "ИнвентаризацияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияОС" 

	Дано Я открываю основную форму списка документа "ИнвентаризацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияОС"

	Дано Я открываю основную форму документа "ИнвентаризацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияПродукцииВЕТИС" 

	Дано Я открываю основную форму списка документа "ИнвентаризацияПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияПродукцииВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияПродукцииВЕТИС"

	Дано Я открываю основную форму документа "ИнвентаризацияПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияПродукцииВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияРасчетов" 

	Дано Я открываю основную форму списка документа "ИнвентаризацияРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияРасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияРасчетов"

	Дано Я открываю основную форму документа "ИнвентаризацияРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияРасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндексацияЗаработка" 

	Дано Я открываю основную форму списка документа "ИндексацияЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндексацияЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндексацияЗаработка"

	Дано Я открываю основную форму документа "ИндексацияЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндексацияЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндексацияШтатногоРасписания" 

	Дано Я открываю основную форму списка документа "ИндексацияШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндексацияШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндексацияШтатногоРасписания"

	Дано Я открываю основную форму документа "ИндексацияШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндексацияШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндивидуальныйГрафик" 

	Дано Я открываю основную форму списка документа "ИндивидуальныйГрафик"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндивидуальныйГрафик"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндивидуальныйГрафик"

	Дано Я открываю основную форму документа "ИндивидуальныйГрафик"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндивидуальныйГрафик"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнойДокументПодтвержденияНДС" 

	Дано Я открываю основную форму списка документа "ИнойДокументПодтвержденияНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнойДокументПодтвержденияНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнойДокументПодтвержденияНДС"

	Дано Я открываю основную форму документа "ИнойДокументПодтвержденияНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнойДокументПодтвержденияНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсполнительныйЛист" 

	Дано Я открываю основную форму списка документа "ИсполнительныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсполнительныйЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсполнительныйЛист"

	Дано Я открываю основную форму документа "ИсполнительныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсполнительныйЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсправлениеРазвернутогоСальдоТоваровОрганизаций" 

	Дано Я открываю основную форму списка документа "ИсправлениеРазвернутогоСальдоТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсправлениеРазвернутогоСальдоТоваровОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсправлениеРазвернутогоСальдоТоваровОрганизаций"

	Дано Я открываю основную форму документа "ИсправлениеРазвернутогоСальдоТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсправлениеРазвернутогоСальдоТоваровОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсходящаяСправкаОЗаработкеДляРасчетаПособий" 

	Дано Я открываю основную форму списка документа "ИсходящаяСправкаОЗаработкеДляРасчетаПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяСправкаОЗаработкеДляРасчетаПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсходящаяСправкаОЗаработкеДляРасчетаПособий"

	Дано Я открываю основную форму документа "ИсходящаяСправкаОЗаработкеДляРасчетаПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяСправкаОЗаработкеДляРасчетаПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсходящаяТранспортнаяОперацияВЕТИС" 

	Дано Я открываю основную форму списка документа "ИсходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсходящаяТранспортнаяОперацияВЕТИС"

	Дано Я открываю основную форму документа "ИсходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйПеревод" 

	Дано Я открываю основную форму списка документа "КадровыйПеревод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровыйПеревод"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйПеревод"

	Дано Я открываю основную форму документа "КадровыйПеревод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровыйПеревод"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйПереводСписком" 

	Дано Я открываю основную форму списка документа "КадровыйПереводСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровыйПереводСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйПереводСписком"

	Дано Я открываю основную форму документа "КадровыйПереводСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровыйПереводСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассоваяСмена" 

	Дано Я открываю основную форму списка документа "КассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассоваяСмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассоваяСмена"

	Дано Я открываю основную форму документа "КассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассоваяСмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КнигаПокупокДляПередачиВЭлектронномВиде" 

	Дано Я открываю основную форму списка документа "КнигаПокупокДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КнигаПокупокДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КнигаПокупокДляПередачиВЭлектронномВиде"

	Дано Я открываю основную форму документа "КнигаПокупокДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КнигаПокупокДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КнигаПродажДляПередачиВЭлектронномВиде" 

	Дано Я открываю основную форму списка документа "КнигаПродажДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КнигаПродажДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КнигаПродажДляПередачиВЭлектронномВиде"

	Дано Я открываю основную форму документа "КнигаПродажДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КнигаПродажДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Командировка" 

	Дано Я открываю основную форму списка документа "Командировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Командировка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Командировка"

	Дано Я открываю основную форму документа "Командировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Командировка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомандировкиСотрудников" 

	Дано Я открываю основную форму списка документа "КомандировкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомандировкиСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомандировкиСотрудников"

	Дано Я открываю основную форму документа "КомандировкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомандировкиСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческоеПредложениеКлиенту" 

	Дано Я открываю основную форму списка документа "КоммерческоеПредложениеКлиенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КоммерческоеПредложениеКлиенту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческоеПредложениеКлиенту"

	Дано Я открываю основную форму документа "КоммерческоеПредложениеКлиенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КоммерческоеПредложениеКлиенту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческоеПредложениеПоставщика" 

	Дано Я открываю основную форму списка документа "КоммерческоеПредложениеПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КоммерческоеПредложениеПоставщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческоеПредложениеПоставщика"

	Дано Я открываю основную форму документа "КоммерческоеПредложениеПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КоммерческоеПредложениеПоставщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомпенсацияЗаЗадержкуЗарплаты" 

	Дано Я открываю основную форму списка документа "КомпенсацияЗаЗадержкуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомпенсацияЗаЗадержкуЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомпенсацияЗаЗадержкуЗарплаты"

	Дано Я открываю основную форму документа "КомпенсацияЗаЗадержкуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомпенсацияЗаЗадержкуЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтролируемаяСделка" 

	Дано Я открываю основную форму списка документа "КонтролируемаяСделка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КонтролируемаяСделка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтролируемаяСделка"

	Дано Я открываю основную форму документа "КонтролируемаяСделка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КонтролируемаяСделка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаВидаДеятельностиНДС" 

	Дано Я открываю основную форму списка документа "КорректировкаВидаДеятельностиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаВидаДеятельностиНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаВидаДеятельностиНДС"

	Дано Я открываю основную форму документа "КорректировкаВидаДеятельностиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаВидаДеятельностиНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаЗадолженностиПоФинансовымИнструментам" 

	Дано Я открываю основную форму списка документа "КорректировкаЗадолженностиПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗадолженностиПоФинансовымИнструментам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаЗадолженностиПоФинансовымИнструментам"

	Дано Я открываю основную форму документа "КорректировкаЗадолженностиПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗадолженностиПоФинансовымИнструментам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаЗаказаМатериаловВПроизводство" 

	Дано Я открываю основную форму списка документа "КорректировкаЗаказаМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗаказаМатериаловВПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаЗаказаМатериаловВПроизводство"

	Дано Я открываю основную форму документа "КорректировкаЗаказаМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗаказаМатериаловВПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаИзлишковНедостачПоТоварнымМестам" 

	Дано Я открываю основную форму списка документа "КорректировкаИзлишковНедостачПоТоварнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаИзлишковНедостачПоТоварнымМестам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаИзлишковНедостачПоТоварнымМестам"

	Дано Я открываю основную форму документа "КорректировкаИзлишковНедостачПоТоварнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаИзлишковНедостачПоТоварнымМестам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаНазначенияТоваров" 

	Дано Я открываю основную форму списка документа "КорректировкаНазначенияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНазначенияТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаНазначенияТоваров"

	Дано Я открываю основную форму документа "КорректировкаНазначенияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНазначенияТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаНалогообложенияНДСПартийТоваров" 

	Дано Я открываю основную форму списка документа "КорректировкаНалогообложенияНДСПартийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНалогообложенияНДСПартийТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаНалогообложенияНДСПартийТоваров"

	Дано Я открываю основную форму документа "КорректировкаНалогообложенияНДСПартийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНалогообложенияНДСПартийТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаОбособленногоУчетаЗапасов" 

	Дано Я открываю основную форму списка документа "КорректировкаОбособленногоУчетаЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаОбособленногоУчетаЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаОбособленногоУчетаЗапасов"

	Дано Я открываю основную форму документа "КорректировкаОбособленногоУчетаЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаОбособленногоУчетаЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПлановыхПотребностей" 

	Дано Я открываю основную форму списка документа "КорректировкаПлановыхПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПлановыхПотребностей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПлановыхПотребностей"

	Дано Я открываю основную форму документа "КорректировкаПлановыхПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПлановыхПотребностей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПоОрдеруНаТовары" 

	Дано Я открываю основную форму списка документа "КорректировкаПоОрдеруНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПоОрдеруНаТовары"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПоОрдеруНаТовары"

	Дано Я открываю основную форму документа "КорректировкаПоОрдеруНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПоОрдеруНаТовары"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПриобретения" 

	Дано Я открываю основную форму списка документа "КорректировкаПриобретения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПриобретения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПриобретения"

	Дано Я открываю основную форму документа "КорректировкаПриобретения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПриобретения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРеализации" 

	Дано Я открываю основную форму списка документа "КорректировкаРеализации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРеализации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРеализации"

	Дано Я открываю основную форму документа "КорректировкаРеализации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРеализации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРегистров" 

	Дано Я открываю основную форму списка документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРегистров"

	Дано Я открываю основную форму документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаСтоимостиИАмортизацииНМА" 

	Дано Я открываю основную форму списка документа "КорректировкаСтоимостиИАмортизацииНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаСтоимостиИАмортизацииНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаСтоимостиИАмортизацииНМА"

	Дано Я открываю основную форму документа "КорректировкаСтоимостиИАмортизацииНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаСтоимостиИАмортизацииНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаСтоимостиИАмортизацииОС" 

	Дано Я открываю основную форму списка документа "КорректировкаСтоимостиИАмортизацииОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаСтоимостиИАмортизацииОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаСтоимостиИАмортизацииОС"

	Дано Я открываю основную форму документа "КорректировкаСтоимостиИАмортизацииОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаСтоимостиИАмортизацииОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛимитыРасходаДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛимитыРасходаДенежныхСредств"

	Дано Я открываю основную форму документа "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛистКассовойКниги" 

	Дано Я открываю основную форму списка документа "ЛистКассовойКниги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛистКассовойКниги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛистКассовойКниги"

	Дано Я открываю основную форму документа "ЛистКассовойКниги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛистКассовойКниги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛистокСообщенияДляВоенкомата" 

	Дано Я открываю основную форму списка документа "ЛистокСообщенияДляВоенкомата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛистокСообщенияДляВоенкомата"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛистокСообщенияДляВоенкомата"

	Дано Я открываю основную форму документа "ЛистокСообщенияДляВоенкомата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛистокСообщенияДляВоенкомата"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаркировкаТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "МаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаркировкаТоваровГИСМ"

	Дано Я открываю основную форму документа "МаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаркировкаТоваровИСМП" 

	Дано Я открываю основную форму списка документа "МаркировкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаркировкаТоваровИСМП"

	Дано Я открываю основную форму документа "МаркировкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаршрутныйЛистПроизводства" 

	Дано Я открываю основную форму списка документа "МаршрутныйЛистПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаршрутныйЛистПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаршрутныйЛистПроизводства"

	Дано Я открываю основную форму документа "МаршрутныйЛистПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаршрутныйЛистПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МатериальнаяПомощь" 

	Дано Я открываю основную форму списка документа "МатериальнаяПомощь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МатериальнаяПомощь"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МатериальнаяПомощь"

	Дано Я открываю основную форму документа "МатериальнаяПомощь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МатериальнаяПомощь"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МодернизацияОС" 

	Дано Я открываю основную форму списка документа "МодернизацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МодернизацияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МодернизацияОС"

	Дано Я открываю основную форму документа "МодернизацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МодернизацияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МодернизацияОС2_4" 

	Дано Я открываю основную форму списка документа "МодернизацияОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МодернизацияОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МодернизацияОС2_4"

	Дано Я открываю основную форму документа "МодернизацияОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МодернизацияОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеОпросов" 

	Дано Я открываю основную форму списка документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеОпросов"

	Дано Я открываю основную форму документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеПлановогоНачисления" 

	Дано Я открываю основную форму списка документа "НазначениеПлановогоНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеПлановогоНачисления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеПлановогоНачисления"

	Дано Я открываю основную форму документа "НазначениеПлановогоНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеПлановогоНачисления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеПодработки" 

	Дано Я открываю основную форму списка документа "НазначениеПодработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеПодработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеПодработки"

	Дано Я открываю основную форму документа "НазначениеПодработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеПодработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаработкаОбъектовЭксплуатации" 

	Дано Я открываю основную форму списка документа "НаработкаОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НаработкаОбъектовЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаработкаОбъектовЭксплуатации"

	Дано Я открываю основную форму документа "НаработкаОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НаработкаОбъектовЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаработкаТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка документа "НаработкаТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НаработкаТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаработкаТМЦВЭксплуатации"

	Дано Я открываю основную форму документа "НаработкаТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НаработкаТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальнаяЗадолженностьПоЗарплате" 

	Дано Я открываю основную форму списка документа "НачальнаяЗадолженностьПоЗарплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальнаяЗадолженностьПоЗарплате"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальнаяЗадолженностьПоЗарплате"

	Дано Я открываю основную форму документа "НачальнаяЗадолженностьПоЗарплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальнаяЗадолженностьПоЗарплате"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальнаяШтатнаяРасстановка" 

	Дано Я открываю основную форму списка документа "НачальнаяШтатнаяРасстановка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальнаяШтатнаяРасстановка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальнаяШтатнаяРасстановка"

	Дано Я открываю основную форму документа "НачальнаяШтатнаяРасстановка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальнаяШтатнаяРасстановка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальныеОстаткиНЗППоПартиямПроизводства" 

	Дано Я открываю основную форму списка документа "НачальныеОстаткиНЗППоПартиямПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальныеОстаткиНЗППоПартиямПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальныеОстаткиНЗППоПартиямПроизводства"

	Дано Я открываю основную форму документа "НачальныеОстаткиНЗППоПартиямПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальныеОстаткиНЗППоПартиямПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальныеОстаткиНЗППоПодразделениям" 

	Дано Я открываю основную форму списка документа "НачальныеОстаткиНЗППоПодразделениям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальныеОстаткиНЗППоПодразделениям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальныеОстаткиНЗППоПодразделениям"

	Дано Я открываю основную форму документа "НачальныеОстаткиНЗППоПодразделениям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальныеОстаткиНЗППоПодразделениям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеДивидендов" 

	Дано Я открываю основную форму списка документа "НачислениеДивидендов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеДивидендов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеДивидендов"

	Дано Я открываю основную форму документа "НачислениеДивидендов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеДивидендов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеЗаПервуюПоловинуМесяца" 

	Дано Я открываю основную форму списка документа "НачислениеЗаПервуюПоловинуМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗаПервуюПоловинуМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеЗаПервуюПоловинуМесяца"

	Дано Я открываю основную форму документа "НачислениеЗаПервуюПоловинуМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗаПервуюПоловинуМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеЗарплаты" 

	Дано Я открываю основную форму списка документа "НачислениеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеЗарплаты"

	Дано Я открываю основную форму документа "НачислениеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеИСписаниеБонусныхБаллов" 

	Дано Я открываю основную форму списка документа "НачислениеИСписаниеБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеИСписаниеБонусныхБаллов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеИСписаниеБонусныхБаллов"

	Дано Я открываю основную форму документа "НачислениеИСписаниеБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеИСписаниеБонусныхБаллов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеОценочныхОбязательствПоОтпускам" 

	Дано Я открываю основную форму списка документа "НачислениеОценочныхОбязательствПоОтпускам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеОценочныхОбязательствПоОтпускам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеОценочныхОбязательствПоОтпускам"

	Дано Я открываю основную форму документа "НачислениеОценочныхОбязательствПоОтпускам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеОценочныхОбязательствПоОтпускам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеПоДоговорам" 

	Дано Я открываю основную форму списка документа "НачислениеПоДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеПоДоговорам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеПоДоговорам"

	Дано Я открываю основную форму документа "НачислениеПоДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеПоДоговорам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеПроцентовПоАренде" 

	Дано Я открываю основную форму списка документа "НачислениеПроцентовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеПроцентовПоАренде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеПроцентовПоАренде"

	Дано Я открываю основную форму документа "НачислениеПроцентовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеПроцентовПоАренде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеСписаниеРезервовПоСомнительнымДолгам" 

	Дано Я открываю основную форму списка документа "НачислениеСписаниеРезервовПоСомнительнымДолгам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеСписаниеРезервовПоСомнительнымДолгам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеСписаниеРезервовПоСомнительнымДолгам"

	Дано Я открываю основную форму документа "НачислениеСписаниеРезервовПоСомнительнымДолгам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеСписаниеРезервовПоСомнительнымДолгам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеСписаниеРезервовПредстоящихРасходов" 

	Дано Я открываю основную форму списка документа "НачислениеСписаниеРезервовПредстоящихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеСписаниеРезервовПредстоящихРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеСписаниеРезервовПредстоящихРасходов"

	Дано Я открываю основную форму документа "НачислениеСписаниеРезервовПредстоящихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеСписаниеРезервовПредстоящихРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияКредитовИДепозитов" 

	Дано Я открываю основную форму списка документа "НачисленияКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачисленияКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияКредитовИДепозитов"

	Дано Я открываю основную форму документа "НачисленияКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачисленияКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НормативРаспределенияПлановПродажПоКатегориям" 

	Дано Я открываю основную форму списка документа "НормативРаспределенияПлановПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НормативРаспределенияПлановПродажПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НормативРаспределенияПлановПродажПоКатегориям"

	Дано Я открываю основную форму документа "НормативРаспределенияПлановПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НормативРаспределенияПлановПродажПоКатегориям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбесценениеВНА" 

	Дано Я открываю основную форму списка документа "ОбесценениеВНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбесценениеВНА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбесценениеВНА"

	Дано Я открываю основную форму документа "ОбесценениеВНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбесценениеВНА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС" 

	Дано Я открываю основную форму списка документа "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"

	Дано Я открываю основную форму документа "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъединениеОС" 

	Дано Я открываю основную форму списка документа "ОбъединениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбъединениеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъединениеОС"

	Дано Я открываю основную форму документа "ОбъединениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбъединениеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОграничениеВзысканий" 

	Дано Я открываю основную форму списка документа "ОграничениеВзысканий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОграничениеВзысканий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОграничениеВзысканий"

	Дано Я открываю основную форму документа "ОграничениеВзысканий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОграничениеВзысканий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОжидаемоеПоступлениеДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ОжидаемоеПоступлениеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОжидаемоеПоступлениеДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОжидаемоеПоступлениеДенежныхСредств"

	Дано Я открываю основную форму документа "ОжидаемоеПоступлениеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОжидаемоеПоступлениеДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияБух" 

	Дано Я открываю основную форму списка документа "ОперацияБух"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияБух"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияБух"

	Дано Я открываю основную форму документа "ОперацияБух"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияБух"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияМеждународный" 

	Дано Я открываю основную форму списка документа "ОперацияМеждународный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияМеждународный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияМеждународный"

	Дано Я открываю основную форму документа "ОперацияМеждународный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияМеждународный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияНалоговогоУчетаПоНДФЛ" 

	Дано Я открываю основную форму списка документа "ОперацияНалоговогоУчетаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияНалоговогоУчетаПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияНалоговогоУчетаПоНДФЛ"

	Дано Я открываю основную форму документа "ОперацияНалоговогоУчетаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияНалоговогоУчетаПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияПоПлатежнойКарте" 

	Дано Я открываю основную форму списка документа "ОперацияПоПлатежнойКарте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоПлатежнойКарте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияПоПлатежнойКарте"

	Дано Я открываю основную форму документа "ОперацияПоПлатежнойКарте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоПлатежнойКарте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияПоЯндексКассе" 

	Дано Я открываю основную форму списка документа "ОперацияПоЯндексКассе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоЯндексКассе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияПоЯндексКассе"

	Дано Я открываю основную форму документа "ОперацияПоЯндексКассе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоЯндексКассе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияУчетаПоСтраховымВзносам" 

	Дано Я открываю основную форму списка документа "ОперацияУчетаПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияУчетаПоСтраховымВзносам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияУчетаПоСтраховымВзносам"

	Дано Я открываю основную форму документа "ОперацияУчетаПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияУчетаПоСтраховымВзносам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьЗаявленийСотрудниковНаВыплатуПособий" 

	Дано Я открываю основную форму списка документа "ОписьЗаявленийСотрудниковНаВыплатуПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьЗаявленийСотрудниковНаВыплатуПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьЗаявленийСотрудниковНаВыплатуПособий"

	Дано Я открываю основную форму документа "ОписьЗаявленийСотрудниковНаВыплатуПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьЗаявленийСотрудниковНаВыплатуПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьОДВ_1" 

	Дано Я открываю основную форму списка документа "ОписьОДВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьОДВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьОДВ_1"

	Дано Я открываю основную форму документа "ОписьОДВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьОДВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьПачекСЗВ_6" 

	Дано Я открываю основную форму списка документа "ОписьПачекСЗВ_6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьПачекСЗВ_6"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьПачекСЗВ_6"

	Дано Я открываю основную форму документа "ОписьПачекСЗВ_6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьПачекСЗВ_6"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаДнейУходаЗаДетьмиИнвалидами" 

	Дано Я открываю основную форму списка документа "ОплатаДнейУходаЗаДетьмиИнвалидами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаДнейУходаЗаДетьмиИнвалидами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаДнейУходаЗаДетьмиИнвалидами"

	Дано Я открываю основную форму документа "ОплатаДнейУходаЗаДетьмиИнвалидами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаДнейУходаЗаДетьмиИнвалидами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаПоСреднемуЗаработку" 

	Дано Я открываю основную форму списка документа "ОплатаПоСреднемуЗаработку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаПоСреднемуЗаработку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаПоСреднемуЗаработку"

	Дано Я открываю основную форму документа "ОплатаПоСреднемуЗаработку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаПоСреднемуЗаработку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаПоСреднемуЗаработкуСписком" 

	Дано Я открываю основную форму списка документа "ОплатаПоСреднемуЗаработкуСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаПоСреднемуЗаработкуСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаПоСреднемуЗаработкуСписком"

	Дано Я открываю основную форму документа "ОплатаПоСреднемуЗаработкуСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаПоСреднемуЗаработкуСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОприходованиеИзлишковТоваров" 

	Дано Я открываю основную форму списка документа "ОприходованиеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОприходованиеИзлишковТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОприходованиеИзлишковТоваров"

	Дано Я открываю основную форму документа "ОприходованиеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОприходованиеИзлишковТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаОтражениеИзлишковТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаОтражениеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеИзлишковТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаОтражениеИзлишковТоваров"

	Дано Я открываю основную форму документа "ОрдерНаОтражениеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеИзлишковТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаОтражениеНедостачТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаОтражениеНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеНедостачТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаОтражениеНедостачТоваров"

	Дано Я открываю основную форму документа "ОрдерНаОтражениеНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеНедостачТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаОтражениеПересортицыТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаОтражениеПересортицыТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеПересортицыТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаОтражениеПересортицыТоваров"

	Дано Я открываю основную форму документа "ОрдерНаОтражениеПересортицыТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеПересортицыТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаОтражениеПорчиТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаОтражениеПорчиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеПорчиТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаОтражениеПорчиТоваров"

	Дано Я открываю основную форму документа "ОрдерНаОтражениеПорчиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеПорчиТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаПеремещениеТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаПеремещениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаПеремещениеТоваров"

	Дано Я открываю основную форму документа "ОрдерНаПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаПеремещениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОстаткиЕГАИС" 

	Дано Я открываю основную форму списка документа "ОстаткиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОстаткиЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОстаткиЕГАИС"

	Дано Я открываю основную форму документа "ОстаткиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОстаткиЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборРазмещениеТоваров" 

	Дано Я открываю основную форму списка документа "ОтборРазмещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтборРазмещениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборРазмещениеТоваров"

	Дано Я открываю основную форму документа "ОтборРазмещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтборРазмещениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтгрузкаТоваровИСМП" 

	Дано Я открываю основную форму списка документа "ОтгрузкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтгрузкаТоваровИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтгрузкаТоваровИСМП"

	Дано Я открываю основную форму документа "ОтгрузкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтгрузкаТоваровИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтгрузкаТоваровСХранения" 

	Дано Я открываю основную форму списка документа "ОтгрузкаТоваровСХранения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтгрузкаТоваровСХранения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтгрузкаТоваровСХранения"

	Дано Я открываю основную форму документа "ОтгрузкаТоваровСХранения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтгрузкаТоваровСХранения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Отгул" 

	Дано Я открываю основную форму списка документа "Отгул"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Отгул"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Отгул"

	Дано Я открываю основную форму документа "Отгул"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Отгул"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтгулСписком" 

	Дано Я открываю основную форму списка документа "ОтгулСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтгулСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтгулСписком"

	Дано Я открываю основную форму документа "ОтгулСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтгулСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности" 

	Дано Я открываю основную форму списка документа "ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности"

	Дано Я открываю основную форму документа "ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтзывСогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывСогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтзывСогласияНаУведомлениеОбЭЛН" 

	Дано Я открываю основную форму списка документа "ОтзывСогласияНаУведомлениеОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаУведомлениеОбЭЛН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывСогласияНаУведомлениеОбЭЛН"

	Дано Я открываю основную форму документа "ОтзывСогласияНаУведомлениеОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаУведомлениеОбЭЛН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаБронированияГражданПребывающихВЗапасе" 

	Дано Я открываю основную форму списка документа "ОтменаБронированияГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаБронированияГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаБронированияГражданПребывающихВЗапасе"

	Дано Я открываю основную форму документа "ОтменаБронированияГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаБронированияГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаДоплатыДоСреднегоЗаработка" 

	Дано Я открываю основную форму списка документа "ОтменаДоплатыДоСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаДоплатыДоСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаДоплатыДоСреднегоЗаработка"

	Дано Я открываю основную форму документа "ОтменаДоплатыДоСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаДоплатыДоСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаРегистрацииЗемельныхУчастков" 

	Дано Я открываю основную форму списка документа "ОтменаРегистрацииЗемельныхУчастков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаРегистрацииЗемельныхУчастков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаРегистрацииЗемельныхУчастков"

	Дано Я открываю основную форму документа "ОтменаРегистрацииЗемельныхУчастков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаРегистрацииЗемельныхУчастков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаРегистрацииТранспортныхСредств" 

	Дано Я открываю основную форму списка документа "ОтменаРегистрацииТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаРегистрацииТранспортныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаРегистрацииТранспортныхСредств"

	Дано Я открываю основную форму документа "ОтменаРегистрацииТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаРегистрацииТранспортныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаСовмещения" 

	Дано Я открываю основную форму списка документа "ОтменаСовмещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаСовмещения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаСовмещения"

	Дано Я открываю основную форму документа "ОтменаСовмещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаСовмещения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Отпуск" 

	Дано Я открываю основную форму списка документа "Отпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Отпуск"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Отпуск"

	Дано Я открываю основную форму документа "Отпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Отпуск"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускаСотрудников" 

	Дано Я открываю основную форму списка документа "ОтпускаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускаСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускаСотрудников"

	Дано Я открываю основную форму документа "ОтпускаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускаСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускБезСохраненияОплаты" 

	Дано Я открываю основную форму списка документа "ОтпускБезСохраненияОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускБезСохраненияОплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускБезСохраненияОплаты"

	Дано Я открываю основную форму документа "ОтпускБезСохраненияОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускБезСохраненияОплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускБезСохраненияОплатыСписком" 

	Дано Я открываю основную форму списка документа "ОтпускБезСохраненияОплатыСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускБезСохраненияОплатыСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускБезСохраненияОплатыСписком"

	Дано Я открываю основную форму документа "ОтпускБезСохраненияОплатыСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускБезСохраненияОплатыСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка документа "ОтпускПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускПоУходуЗаРебенком"

	Дано Я открываю основную форму документа "ОтпускПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеЗарплатыВФинансовомУчете" 

	Дано Я открываю основную форму списка документа "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеЗарплатыВФинансовомУчете"

	Дано Я открываю основную форму документа "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеЗарплатыВФинансовомУчете2_5" 

	Дано Я открываю основную форму списка документа "ОтражениеЗарплатыВФинансовомУчете2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете2_5"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеЗарплатыВФинансовомУчете2_5"

	Дано Я открываю основную форму документа "ОтражениеЗарплатыВФинансовомУчете2_5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете2_5"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеРасхожденийПриИнкассацииДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ОтражениеРасхожденийПриИнкассацииДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеРасхожденийПриИнкассацииДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеРасхожденийПриИнкассацииДенежныхСредств"

	Дано Я открываю основную форму документа "ОтражениеРасхожденийПриИнкассацииДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеРасхожденийПриИнкассацииДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетБанкаПоОперациямЭквайринга" 

	Дано Я открываю основную форму списка документа "ОтчетБанкаПоОперациямЭквайринга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетБанкаПоОперациямЭквайринга"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетБанкаПоОперациямЭквайринга"

	Дано Я открываю основную форму документа "ОтчетБанкаПоОперациямЭквайринга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетБанкаПоОперациямЭквайринга"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетДавальцу" 

	Дано Я открываю основную форму списка документа "ОтчетДавальцу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетДавальцу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетДавальцу"

	Дано Я открываю основную форму документа "ОтчетДавальцу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетДавальцу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетЕГАИС" 

	Дано Я открываю основную форму списка документа "ОтчетЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетЕГАИС"

	Дано Я открываю основную форму документа "ОтчетЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомиссионера" 

	Дано Я открываю основную форму списка документа "ОтчетКомиссионера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионера"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомиссионера"

	Дано Я открываю основную форму документа "ОтчетКомиссионера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионера"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомиссионераОСписании" 

	Дано Я открываю основную форму списка документа "ОтчетКомиссионераОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионераОСписании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомиссионераОСписании"

	Дано Я открываю основную форму документа "ОтчетКомиссионераОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионераОСписании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитенту" 

	Дано Я открываю основную форму списка документа "ОтчетКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитенту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитенту"

	Дано Я открываю основную форму документа "ОтчетКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитенту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитентуОЗакупках" 

	Дано Я открываю основную форму списка документа "ОтчетКомитентуОЗакупках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитентуОЗакупках"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитентуОЗакупках"

	Дано Я открываю основную форму документа "ОтчетКомитентуОЗакупках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитентуОЗакупках"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитентуОСписании" 

	Дано Я открываю основную форму списка документа "ОтчетКомитентуОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитентуОСписании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитентуОСписании"

	Дано Я открываю основную форму документа "ОтчетКомитентуОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитентуОСписании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетОператораСистемыПлатон" 

	Дано Я открываю основную форму списка документа "ОтчетОператораСистемыПлатон"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОператораСистемыПлатон"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетОператораСистемыПлатон"

	Дано Я открываю основную форму документа "ОтчетОператораСистемыПлатон"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОператораСистемыПлатон"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетОРозничныхВозвратах" 

	Дано Я открываю основную форму списка документа "ОтчетОРозничныхВозвратах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхВозвратах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетОРозничныхВозвратах"

	Дано Я открываю основную форму документа "ОтчетОРозничныхВозвратах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхВозвратах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетОРозничныхПродажах" 

	Дано Я открываю основную форму списка документа "ОтчетОРозничныхПродажах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетОРозничныхПродажах"

	Дано Я открываю основную форму документа "ОтчетОРозничныхПродажах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетПереработчика" 

	Дано Я открываю основную форму списка документа "ОтчетПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПереработчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетПереработчика"

	Дано Я открываю основную форму документа "ОтчетПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПереработчика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетПоКомиссииМеждуОрганизациями" 

	Дано Я открываю основную форму списка документа "ОтчетПоКомиссииМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПоКомиссииМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетПоКомиссииМеждуОрганизациями"

	Дано Я открываю основную форму документа "ОтчетПоКомиссииМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПоКомиссииМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетПоКомиссииМеждуОрганизациямиОСписании" 

	Дано Я открываю основную форму списка документа "ОтчетПоКомиссииМеждуОрганизациямиОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПоКомиссииМеждуОрганизациямиОСписании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетПоКомиссииМеждуОрганизациямиОСписании"

	Дано Я открываю основную форму документа "ОтчетПоКомиссииМеждуОрганизациямиОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПоКомиссииМеждуОрганизациямиОСписании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетОбменСБанками" 

	Дано Я открываю основную форму списка документа "ПакетОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетОбменСБанками"

	Дано Я открываю основную форму документа "ПакетОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовАДВ_1" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовАДВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовАДВ_1"

	Дано Я открываю основную форму документа "ПачкаДокументовАДВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовАДВ_2" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовАДВ_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовАДВ_2"

	Дано Я открываю основную форму документа "ПачкаДокументовАДВ_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовАДВ_3" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовАДВ_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовАДВ_3"

	Дано Я открываю основную форму документа "ПачкаДокументовАДВ_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовДСВ_1" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовДСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовДСВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовДСВ_1"

	Дано Я открываю основную форму документа "ПачкаДокументовДСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовДСВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_1" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_6_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_1"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_6_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_3" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_6_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_3"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_6_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_4" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_6_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_4"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_6_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_К" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_К"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_К"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_К"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_К"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_К"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСПВ_1" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСПВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСПВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСПВ_1"

	Дано Я открываю основную форму документа "ПачкаДокументовСПВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСПВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСПВ_2" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСПВ_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСПВ_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСПВ_2"

	Дано Я открываю основную форму документа "ПачкаДокументовСПВ_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСПВ_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаРазделов6РасчетаРСВ_1" 

	Дано Я открываю основную форму списка документа "ПачкаРазделов6РасчетаРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаРазделов6РасчетаРСВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаРазделов6РасчетаРСВ_1"

	Дано Я открываю основную форму документа "ПачкаРазделов6РасчетаРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаРазделов6РасчетаРСВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПервичныйДокумент" 

	Дано Я открываю основную форму списка документа "ПервичныйДокумент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПервичныйДокумент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПервичныйДокумент"

	Дано Я открываю основную форму документа "ПервичныйДокумент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПервичныйДокумент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереводКДругомуРаботодателю" 

	Дано Я открываю основную форму списка документа "ПереводКДругомуРаботодателю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводКДругомуРаботодателю"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереводКДругомуРаботодателю"

	Дано Я открываю основную форму документа "ПереводКДругомуРаботодателю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводКДругомуРаботодателю"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереводНаОплатуПоСреднемуЗаработку" 

	Дано Я открываю основную форму списка документа "ПереводНаОплатуПоСреднемуЗаработку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводНаОплатуПоСреднемуЗаработку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереводНаОплатуПоСреднемуЗаработку"

	Дано Я открываю основную форму документа "ПереводНаОплатуПоСреднемуЗаработку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводНаОплатуПоСреднемуЗаработку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереводНаРаботуСКоронавирусом" 

	Дано Я открываю основную форму списка документа "ПереводНаРаботуСКоронавирусом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводНаРаботуСКоронавирусом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереводНаРаботуСКоронавирусом"

	Дано Я открываю основную форму документа "ПереводНаРаботуСКоронавирусом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводНаРаботуСКоронавирусом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет"

	Дано Я открываю основную форму документа "ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаВРегистр2ЕГАИС" 

	Дано Я открываю основную форму списка документа "ПередачаВРегистр2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРегистр2ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаВРегистр2ЕГАИС"

	Дано Я открываю основную форму документа "ПередачаВРегистр2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРегистр2ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаДавальцу" 

	Дано Я открываю основную форму списка документа "ПередачаДавальцу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаДавальцу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаДавальцу"

	Дано Я открываю основную форму документа "ПередачаДавальцу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаДавальцу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаМатериаловВПроизводство" 

	Дано Я открываю основную форму списка документа "ПередачаМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаМатериаловВПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаМатериаловВПроизводство"

	Дано Я открываю основную форму документа "ПередачаМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаМатериаловВПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаОСВАренду" 

	Дано Я открываю основную форму списка документа "ПередачаОСВАренду"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаОСВАренду"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаОСВАренду"

	Дано Я открываю основную форму документа "ПередачаОСВАренду"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаОСВАренду"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаОСВАренду2_4" 

	Дано Я открываю основную форму списка документа "ПередачаОСВАренду2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаОСВАренду2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаОСВАренду2_4"

	Дано Я открываю основную форму документа "ПередачаОСВАренду2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаОСВАренду2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаСырьяПереработчику" 

	Дано Я открываю основную форму списка документа "ПередачаСырьяПереработчику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаСырьяПереработчику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаСырьяПереработчику"

	Дано Я открываю основную форму документа "ПередачаСырьяПереработчику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаСырьяПереработчику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаТоваровМеждуОрганизациями" 

	Дано Я открываю основную форму списка документа "ПередачаТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаТоваровМеждуОрганизациями"

	Дано Я открываю основную форму документа "ПередачаТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаТоваровХранителю" 

	Дано Я открываю основную форму списка документа "ПередачаТоваровХранителю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаТоваровХранителю"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаТоваровХранителю"

	Дано Я открываю основную форму документа "ПередачаТоваровХранителю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаТоваровХранителю"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремаркировкаТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "ПеремаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремаркировкаТоваровГИСМ"

	Дано Я открываю основную форму документа "ПеремаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремаркировкаТоваровИСМП" 

	Дано Я открываю основную форму списка документа "ПеремаркировкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремаркировкаТоваровИСМП"

	Дано Я открываю основную форму документа "ПеремаркировкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеВДругоеПодразделение" 

	Дано Я открываю основную форму списка документа "ПеремещениеВДругоеПодразделение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеВДругоеПодразделение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеВДругоеПодразделение"

	Дано Я открываю основную форму документа "ПеремещениеВДругоеПодразделение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеВДругоеПодразделение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеВЭксплуатации" 

	Дано Я открываю основную форму списка документа "ПеремещениеВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеВЭксплуатации"

	Дано Я открываю основную форму документа "ПеремещениеВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеМатериаловВПроизводстве" 

	Дано Я открываю основную форму списка документа "ПеремещениеМатериаловВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеМатериаловВПроизводстве"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеМатериаловВПроизводстве"

	Дано Я открываю основную форму документа "ПеремещениеМатериаловВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеМатериаловВПроизводстве"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеМеждуТерриториями" 

	Дано Я открываю основную форму списка документа "ПеремещениеМеждуТерриториями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеМеждуТерриториями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеМеждуТерриториями"

	Дано Я открываю основную форму документа "ПеремещениеМеждуТерриториями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеМеждуТерриториями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеНМА2_4" 

	Дано Я открываю основную форму списка документа "ПеремещениеНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеНМА2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеНМА2_4"

	Дано Я открываю основную форму документа "ПеремещениеНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеНМА2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеНМАМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "ПеремещениеНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеНМАМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеНМАМеждународныйУчет"

	Дано Я открываю основную форму документа "ПеремещениеНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеНМАМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеОС" 

	Дано Я открываю основную форму списка документа "ПеремещениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеОС"

	Дано Я открываю основную форму документа "ПеремещениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеОС2_4" 

	Дано Я открываю основную форму списка документа "ПеремещениеОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеОС2_4"

	Дано Я открываю основную форму документа "ПеремещениеОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеОСМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "ПеремещениеОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОСМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеОСМеждународныйУчет"

	Дано Я открываю основную форму документа "ПеремещениеОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОСМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеТоваров" 

	Дано Я открываю основную форму списка документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеТоваров"

	Дано Я открываю основную форму документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносДанных" 

	Дано Я открываю основную форму списка документа "ПереносДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносДанных"

	Дано Я открываю основную форму документа "ПереносДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносЗатратНаПерсоналМеждуСтатьями" 

	Дано Я открываю основную форму списка документа "ПереносЗатратНаПерсоналМеждуСтатьями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносЗатратНаПерсоналМеждуСтатьями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносЗатратНаПерсоналМеждуСтатьями"

	Дано Я открываю основную форму документа "ПереносЗатратНаПерсоналМеждуСтатьями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносЗатратНаПерсоналМеждуСтатьями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносОтпуска" 

	Дано Я открываю основную форму списка документа "ПереносОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносОтпуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносОтпуска"

	Дано Я открываю основную форму документа "ПереносОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносОтпуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереоценкаНМА" 

	Дано Я открываю основную форму списка документа "ПереоценкаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереоценкаНМА"

	Дано Я открываю основную форму документа "ПереоценкаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереоценкаНМА2_4" 

	Дано Я открываю основную форму списка документа "ПереоценкаНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаНМА2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереоценкаНМА2_4"

	Дано Я открываю основную форму документа "ПереоценкаНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаНМА2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереоценкаОС" 

	Дано Я открываю основную форму списка документа "ПереоценкаОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереоценкаОС"

	Дано Я открываю основную форму документа "ПереоценкаОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереоценкаОС2_4" 

	Дано Я открываю основную форму списка документа "ПереоценкаОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереоценкаОС2_4"

	Дано Я открываю основную форму документа "ПереоценкаОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетНДФЛ" 

	Дано Я открываю основную форму списка документа "ПерерасчетНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПерерасчетНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетНДФЛ"

	Дано Я открываю основную форму документа "ПерерасчетНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПерерасчетНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетСтраховыхВзносов" 

	Дано Я открываю основную форму списка документа "ПерерасчетСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПерерасчетСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетСтраховыхВзносов"

	Дано Я открываю основную форму документа "ПерерасчетСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПерерасчетСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПересортицаТоваров" 

	Дано Я открываю основную форму списка документа "ПересортицаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересортицаТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПересортицаТоваров"

	Дано Я открываю основную форму документа "ПересортицаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересортицаТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПересчетТоваров" 

	Дано Я открываю основную форму списка документа "ПересчетТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересчетТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПересчетТоваров"

	Дано Я открываю основную форму документа "ПересчетТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересчетТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыОплаченныеДоНачалаЭксплуатации" 

	Дано Я открываю основную форму списка документа "ПериодыОплаченныеДоНачалаЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПериодыОплаченныеДоНачалаЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыОплаченныеДоНачалаЭксплуатации"

	Дано Я открываю основную форму документа "ПериодыОплаченныеДоНачалаЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПериодыОплаченныеДоНачалаЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПисьмоОбменСБанками" 

	Дано Я открываю основную форму списка документа "ПисьмоОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПисьмоОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПисьмоОбменСБанками"

	Дано Я открываю основную форму документа "ПисьмоОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПисьмоОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланВнутреннихПотреблений" 

	Дано Я открываю основную форму списка документа "ПланВнутреннихПотреблений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланВнутреннихПотреблений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланВнутреннихПотреблений"

	Дано Я открываю основную форму документа "ПланВнутреннихПотреблений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланВнутреннихПотреблений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланЗакупок" 

	Дано Я открываю основную форму списка документа "ПланЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланЗакупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланЗакупок"

	Дано Я открываю основную форму документа "ПланЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланЗакупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановаяКалькуляция" 

	Дано Я открываю основную форму списка документа "ПлановаяКалькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлановаяКалькуляция"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановаяКалькуляция"

	Дано Я открываю основную форму документа "ПлановаяКалькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлановаяКалькуляция"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановаяКалькуляция2_2" 

	Дано Я открываю основную форму списка документа "ПлановаяКалькуляция2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлановаяКалькуляция2_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановаяКалькуляция2_2"

	Дано Я открываю основную форму документа "ПлановаяКалькуляция2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлановаяКалькуляция2_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланОстатков" 

	Дано Я открываю основную форму списка документа "ПланОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланОстатков"

	Дано Я открываю основную форму документа "ПланОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПродаж" 

	Дано Я открываю основную форму списка документа "ПланПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПродаж"

	Дано Я открываю основную форму документа "ПланПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПродажПоКатегориям" 

	Дано Я открываю основную форму списка документа "ПланПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродажПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПродажПоКатегориям"

	Дано Я открываю основную форму документа "ПланПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродажПоКатегориям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПроизводства" 

	Дано Я открываю основную форму списка документа "ПланПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПроизводства"

	Дано Я открываю основную форму документа "ПланПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланСборкиРазборки" 

	Дано Я открываю основную форму списка документа "ПланСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланСборкиРазборки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланСборкиРазборки"

	Дано Я открываю основную форму документа "ПланСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланСборкиРазборки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПогашениеЗадолженностиПоВзысканиям" 

	Дано Я открываю основную форму списка документа "ПогашениеЗадолженностиПоВзысканиям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПогашениеЗадолженностиПоВзысканиям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПогашениеЗадолженностиПоВзысканиям"

	Дано Я открываю основную форму документа "ПогашениеЗадолженностиПоВзысканиям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПогашениеЗадолженностиПоВзысканиям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПогашениеСтоимостиТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка документа "ПогашениеСтоимостиТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПогашениеСтоимостиТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПогашениеСтоимостиТМЦВЭксплуатации"

	Дано Я открываю основную форму документа "ПогашениеСтоимостиТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПогашениеСтоимостиТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодготовкаКПередачеНМА" 

	Дано Я открываю основную форму списка документа "ПодготовкаКПередачеНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаКПередачеНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодготовкаКПередачеНМА"

	Дано Я открываю основную форму документа "ПодготовкаКПередачеНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаКПередачеНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодготовкаКПередачеНМА2_4" 

	Дано Я открываю основную форму списка документа "ПодготовкаКПередачеНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаКПередачеНМА2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодготовкаКПередачеНМА2_4"

	Дано Я открываю основную форму документа "ПодготовкаКПередачеНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаКПередачеНМА2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодготовкаКПередачеОС" 

	Дано Я открываю основную форму списка документа "ПодготовкаКПередачеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаКПередачеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодготовкаКПередачеОС"

	Дано Я открываю основную форму документа "ПодготовкаКПередачеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаКПередачеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодготовкаКПередачеОС2_4" 

	Дано Я открываю основную форму списка документа "ПодготовкаКПередачеОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаКПередачеОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодготовкаКПередачеОС2_4"

	Дано Я открываю основную форму документа "ПодготовкаКПередачеОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаКПередачеОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодтверждениеЗачисленияЗарплаты" 

	Дано Я открываю основную форму списка документа "ПодтверждениеЗачисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодтверждениеЗачисленияЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодтверждениеЗачисленияЗарплаты"

	Дано Я открываю основную форму документа "ПодтверждениеЗачисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодтверждениеЗачисленияЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодтверждениеОткрытияЛицевыхСчетовСотрудников" 

	Дано Я открываю основную форму списка документа "ПодтверждениеОткрытияЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодтверждениеОткрытияЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодтверждениеОткрытияЛицевыхСчетовСотрудников"

	Дано Я открываю основную форму документа "ПодтверждениеОткрытияЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодтверждениеОткрытияЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоручениеЭкспедитору" 

	Дано Я открываю основную форму списка документа "ПоручениеЭкспедитору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоручениеЭкспедитору"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоручениеЭкспедитору"

	Дано Я открываю основную форму документа "ПоручениеЭкспедитору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоручениеЭкспедитору"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорчаТоваров" 

	Дано Я открываю основную форму списка документа "ПорчаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПорчаТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорчаТоваров"

	Дано Я открываю основную форму документа "ПорчаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПорчаТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПостоянноеУдержаниеВПользуТретьихЛиц" 

	Дано Я открываю основную форму списка документа "ПостоянноеУдержаниеВПользуТретьихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПостоянноеУдержаниеВПользуТретьихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПостоянноеУдержаниеВПользуТретьихЛиц"

	Дано Я открываю основную форму документа "ПостоянноеУдержаниеВПользуТретьихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПостоянноеУдержаниеВПользуТретьихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеАрендованныхОС" 

	Дано Я открываю основную форму списка документа "ПоступлениеАрендованныхОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеАрендованныхОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеАрендованныхОС"

	Дано Я открываю основную форму документа "ПоступлениеАрендованныхОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеАрендованныхОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеБезналичныхДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ПоступлениеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеБезналичныхДенежныхСредств"

	Дано Я открываю основную форму документа "ПоступлениеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеДенежныхДокументов" 

	Дано Я открываю основную форму списка документа "ПоступлениеДенежныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеДенежныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеДенежныхДокументов"

	Дано Я открываю основную форму документа "ПоступлениеДенежныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеДенежныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеОтПереработчика" 

	Дано Я открываю основную форму списка документа "ПоступлениеОтПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеОтПереработчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеОтПереработчика"

	Дано Я открываю основную форму документа "ПоступлениеОтПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеОтПереработчика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеСырьяОтДавальца" 

	Дано Я открываю основную форму списка документа "ПоступлениеСырьяОтДавальца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеСырьяОтДавальца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеСырьяОтДавальца"

	Дано Я открываю основную форму документа "ПоступлениеСырьяОтДавальца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеСырьяОтДавальца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеТоваровНаСклад" 

	Дано Я открываю основную форму списка документа "ПоступлениеТоваровНаСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеТоваровНаСклад"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеТоваровНаСклад"

	Дано Я открываю основную форму документа "ПоступлениеТоваровНаСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеТоваровНаСклад"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеТоваровОтХранителя" 

	Дано Я открываю основную форму списка документа "ПоступлениеТоваровОтХранителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеТоваровОтХранителя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеТоваровОтХранителя"

	Дано Я открываю основную форму документа "ПоступлениеТоваровОтХранителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеТоваровОтХранителя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеУслугПоАренде" 

	Дано Я открываю основную форму списка документа "ПоступлениеУслугПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеУслугПоАренде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеУслугПоАренде"

	Дано Я открываю основную форму документа "ПоступлениеУслугПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеУслугПоАренде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоясненияКДекларацииПоНДС" 

	Дано Я открываю основную форму списка документа "ПоясненияКДекларацииПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоясненияКДекларацииПоНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоясненияКДекларацииПоНДС"

	Дано Я открываю основную форму документа "ПоясненияКДекларацииПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоясненияКДекларацииПоНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеДоговораАренды" 

	Дано Я открываю основную форму списка документа "ПрекращениеДоговораАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеДоговораАренды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеДоговораАренды"

	Дано Я открываю основную форму документа "ПрекращениеДоговораАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеДоговораАренды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеПлановогоНачисления" 

	Дано Я открываю основную форму списка документа "ПрекращениеПлановогоНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеПлановогоНачисления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеПлановогоНачисления"

	Дано Я открываю основную форму документа "ПрекращениеПлановогоНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеПлановогоНачисления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеПодработки" 

	Дано Я открываю основную форму списка документа "ПрекращениеПодработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеПодработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеПодработки"

	Дано Я открываю основную форму документа "ПрекращениеПодработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеПодработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеСтандартныхВычетовНДФЛ" 

	Дано Я открываю основную форму списка документа "ПрекращениеСтандартныхВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеСтандартныхВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеСтандартныхВычетовНДФЛ"

	Дано Я открываю основную форму документа "ПрекращениеСтандартныхВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеСтандартныхВычетовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Премия" 

	Дано Я открываю основную форму списка документа "Премия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Премия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Премия"

	Дано Я открываю основную форму документа "Премия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Премия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемкаТоваровИСМП" 

	Дано Я открываю основную форму списка документа "ПриемкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемкаТоваровИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемкаТоваровИСМП"

	Дано Я открываю основную форму документа "ПриемкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемкаТоваровИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемкаТоваровНаХранение" 

	Дано Я открываю основную форму списка документа "ПриемкаТоваровНаХранение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемкаТоваровНаХранение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемкаТоваровНаХранение"

	Дано Я открываю основную форму документа "ПриемкаТоваровНаХранение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемкаТоваровНаХранение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботу" 

	Дано Я открываю основную форму списка документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботу"

	Дано Я открываю основную форму документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботуСписком" 

	Дано Я открываю основную форму списка документа "ПриемНаРаботуСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботуСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботуСписком"

	Дано Я открываю основную форму документа "ПриемНаРаботуСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботуСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПризнаниеРасходовПоИсследованиямИРазработкам" 

	Дано Я открываю основную форму списка документа "ПризнаниеРасходовПоИсследованиямИРазработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПризнаниеРасходовПоИсследованиямИРазработкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПризнаниеРасходовПоИсследованиямИРазработкам"

	Дано Я открываю основную форму документа "ПризнаниеРасходовПоИсследованиямИРазработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПризнаниеРасходовПоИсследованиямИРазработкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПризПодарок" 

	Дано Я открываю основную форму списка документа "ПризПодарок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПризПодарок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПризПодарок"

	Дано Я открываю основную форму документа "ПризПодарок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПризПодарок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриказНаДоплатуДоСреднегоЗаработка" 

	Дано Я открываю основную форму списка документа "ПриказНаДоплатуДоСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриказНаДоплатуДоСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриказНаДоплатуДоСреднегоЗаработка"

	Дано Я открываю основную форму документа "ПриказНаДоплатуДоСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриказНаДоплатуДоСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуНМА" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуНМА"

	Дано Я открываю основную форму документа "ПринятиеКУчетуНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуНМА2_4" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуНМА2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуНМА2_4"

	Дано Я открываю основную форму документа "ПринятиеКУчетуНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуНМА2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуНМАМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуНМАМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуНМАМеждународныйУчет"

	Дано Я открываю основную форму документа "ПринятиеКУчетуНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуНМАМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуОС" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуОС"

	Дано Я открываю основную форму документа "ПринятиеКУчетуОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуОС2_4" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуОС2_4"

	Дано Я открываю основную форму документа "ПринятиеКУчетуОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуОСМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОСМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуОСМеждународныйУчет"

	Дано Я открываю основную форму документа "ПринятиеКУчетуОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОСМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуУзловКомпонентовАмортизации" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуУзловКомпонентовАмортизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуУзловКомпонентовАмортизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуУзловКомпонентовАмортизации"

	Дано Я открываю основную форму документа "ПринятиеКУчетуУзловКомпонентовАмортизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуУзловКомпонентовАмортизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеТоваровУслуг" 

	Дано Я открываю основную форму списка документа "ПриобретениеТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеТоваровУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеТоваровУслуг"

	Дано Я открываю основную форму документа "ПриобретениеТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеТоваровУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеУслугПрочихАктивов" 

	Дано Я открываю основную форму списка документа "ПриобретениеУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеУслугПрочихАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеУслугПрочихАктивов"

	Дано Я открываю основную форму документа "ПриобретениеУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеУслугПрочихАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходныйКассовыйОрдер" 

	Дано Я открываю основную форму списка документа "ПриходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйКассовыйОрдер"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходныйКассовыйОрдер"

	Дано Я открываю основную форму документа "ПриходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйКассовыйОрдер"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходныйОрдерНаТовары" 

	Дано Я открываю основную форму списка документа "ПриходныйОрдерНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйОрдерНаТовары"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходныйОрдерНаТовары"

	Дано Я открываю основную форму документа "ПриходныйОрдерНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйОрдерНаТовары"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрогулНеявка" 

	Дано Я открываю основную форму списка документа "ПрогулНеявка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрогулНеявка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрогулНеявка"

	Дано Я открываю основную форму документа "ПрогулНеявка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрогулНеявка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрогулНеявкаСписком" 

	Дано Я открываю основную форму списка документа "ПрогулНеявкаСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрогулНеявкаСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрогулНеявкаСписком"

	Дано Я открываю основную форму документа "ПрогулНеявкаСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрогулНеявкаСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПродлениеКонтрактаДоговора" 

	Дано Я открываю основную форму списка документа "ПродлениеКонтрактаДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПродлениеКонтрактаДоговора"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПродлениеКонтрактаДоговора"

	Дано Я открываю основную форму документа "ПродлениеКонтрактаДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПродлениеКонтрактаДоговора"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственнаяОперация2_2" 

	Дано Я открываю основную форму списка документа "ПроизводственнаяОперация2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводственнаяОперация2_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственнаяОперация2_2"

	Дано Я открываю основную форму документа "ПроизводственнаяОперация2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводственнаяОперация2_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственнаяОперацияВЕТИС" 

	Дано Я открываю основную форму списка документа "ПроизводственнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводственнаяОперацияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственнаяОперацияВЕТИС"

	Дано Я открываю основную форму документа "ПроизводственнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводственнаяОперацияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводствоБезЗаказа" 

	Дано Я открываю основную форму списка документа "ПроизводствоБезЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводствоБезЗаказа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводствоБезЗаказа"

	Дано Я открываю основную форму документа "ПроизводствоБезЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводствоБезЗаказа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПростойСотрудников" 

	Дано Я открываю основную форму списка документа "ПростойСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПростойСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПростойСотрудников"

	Дано Я открываю основную форму документа "ПростойСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПростойСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцессПодготовкиБюджетов" 

	Дано Я открываю основную форму списка документа "ПроцессПодготовкиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроцессПодготовкиБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцессПодготовкиБюджетов"

	Дано Я открываю основную форму документа "ПроцессПодготовкиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроцессПодготовкиБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочееОприходованиеТоваров" 

	Дано Я открываю основную форму списка документа "ПрочееОприходованиеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочееОприходованиеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочееОприходованиеТоваров"

	Дано Я открываю основную форму документа "ПрочееОприходованиеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочееОприходованиеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеДоходыРасходы" 

	Дано Я открываю основную форму списка документа "ПрочиеДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочиеДоходыРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеДоходыРасходы"

	Дано Я открываю основную форму документа "ПрочиеДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочиеДоходыРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаботаВВыходныеИПраздничныеДни" 

	Дано Я открываю основную форму списка документа "РаботаВВыходныеИПраздничныеДни"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаботаВВыходныеИПраздничныеДни"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаботаВВыходныеИПраздничныеДни"

	Дано Я открываю основную форму документа "РаботаВВыходныеИПраздничныеДни"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаботаВВыходныеИПраздничныеДни"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаботаСверхурочно" 

	Дано Я открываю основную форму списка документа "РаботаСверхурочно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаботаСверхурочно"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаботаСверхурочно"

	Дано Я открываю основную форму документа "РаботаСверхурочно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаботаСверхурочно"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазовоеНачисление" 

	Дано Я открываю основную форму списка документа "РазовоеНачисление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазовоеНачисление"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазовоеНачисление"

	Дано Я открываю основную форму документа "РазовоеНачисление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазовоеНачисление"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешениеНаЗаменуМатериалов" 

	Дано Я открываю основную форму списка документа "РазрешениеНаЗаменуМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазрешениеНаЗаменуМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешениеНаЗаменуМатериалов"

	Дано Я открываю основную форму документа "РазрешениеНаЗаменуМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазрешениеНаЗаменуМатериалов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазукомплектацияОС" 

	Дано Я открываю основную форму списка документа "РазукомплектацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазукомплектацияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазукомплектацияОС"

	Дано Я открываю основную форму документа "РазукомплектацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазукомплектацияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспоряжениеНаПеремещениеДенежныхСредств" 

	Дано Я открываю основную форму списка документа "РаспоряжениеНаПеремещениеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспоряжениеНаПеремещениеДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспоряжениеНаПеремещениеДенежныхСредств"

	Дано Я открываю основную форму документа "РаспоряжениеНаПеремещениеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспоряжениеНаПеремещениеДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеВозвратныхОтходов" 

	Дано Я открываю основную форму списка документа "РаспределениеВозвратныхОтходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеВозвратныхОтходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеВозвратныхОтходов"

	Дано Я открываю основную форму документа "РаспределениеВозвратныхОтходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеВозвратныхОтходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеДоходовПоНаправлениямДеятельности" 

	Дано Я открываю основную форму списка документа "РаспределениеДоходовПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеДоходовПоНаправлениямДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеДоходовПоНаправлениямДеятельности"

	Дано Я открываю основную форму документа "РаспределениеДоходовПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеДоходовПоНаправлениямДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеНДС" 

	Дано Я открываю основную форму списка документа "РаспределениеНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеНДС"

	Дано Я открываю основную форму документа "РаспределениеНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеОсновногоЗаработка" 

	Дано Я открываю основную форму списка документа "РаспределениеОсновногоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеОсновногоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеОсновногоЗаработка"

	Дано Я открываю основную форму документа "РаспределениеОсновногоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеОсновногоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеПроизводственныхЗатрат" 

	Дано Я открываю основную форму списка документа "РаспределениеПроизводственныхЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеПроизводственныхЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеПроизводственныхЗатрат"

	Дано Я открываю основную форму документа "РаспределениеПроизводственныхЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеПроизводственныхЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеПрочихЗатрат" 

	Дано Я открываю основную форму списка документа "РаспределениеПрочихЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеПрочихЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеПрочихЗатрат"

	Дано Я открываю основную форму документа "РаспределениеПрочихЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеПрочихЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеРасходовБудущихПериодов" 

	Дано Я открываю основную форму списка документа "РаспределениеРасходовБудущихПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеРасходовБудущихПериодов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеРасходовБудущихПериодов"

	Дано Я открываю основную форму документа "РаспределениеРасходовБудущихПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеРасходовБудущихПериодов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкаКлиентам" 

	Дано Я открываю основную форму списка документа "РассылкаКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РассылкаКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкаКлиентам"

	Дано Я открываю основную форму документа "РассылкаКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РассылкаКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходныйКассовыйОрдер" 

	Дано Я открываю основную форму списка документа "РасходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйКассовыйОрдер"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходныйКассовыйОрдер"

	Дано Я открываю основную форму документа "РасходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйКассовыйОрдер"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходныйОрдерНаТовары" 

	Дано Я открываю основную форму списка документа "РасходныйОрдерНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйОрдерНаТовары"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходныйОрдерНаТовары"

	Дано Я открываю основную форму документа "РасходныйОрдерНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйОрдерНаТовары"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетКурсовыхРазниц" 

	Дано Я открываю основную форму списка документа "РасчетКурсовыхРазниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетКурсовыхРазниц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетКурсовыхРазниц"

	Дано Я открываю основную форму документа "РасчетКурсовыхРазниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетКурсовыхРазниц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетПроцентныхРасходовДисконтирования" 

	Дано Я открываю основную форму списка документа "РасчетПроцентныхРасходовДисконтирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетПроцентныхРасходовДисконтирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетПроцентныхРасходовДисконтирования"

	Дано Я открываю основную форму документа "РасчетПроцентныхРасходовДисконтирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетПроцентныхРасходовДисконтирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетРезервовПодОбесценениеЗапасов" 

	Дано Я открываю основную форму списка документа "РасчетРезервовПодОбесценениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетРезервовПодОбесценениеЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетРезервовПодОбесценениеЗапасов"

	Дано Я открываю основную форму документа "РасчетРезервовПодОбесценениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетРезервовПодОбесценениеЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетСебестоимостиТоваров" 

	Дано Я открываю основную форму списка документа "РасчетСебестоимостиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетСебестоимостиТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетСебестоимостиТоваров"

	Дано Я открываю основную форму документа "РасчетСебестоимостиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетСебестоимостиТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияПодарочныхСертификатов" 

	Дано Я открываю основную форму списка документа "РеализацияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияПодарочныхСертификатов"

	Дано Я открываю основную форму документа "РеализацияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияТоваровУслуг" 

	Дано Я открываю основную форму списка документа "РеализацияТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияТоваровУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияТоваровУслуг"

	Дано Я открываю основную форму документа "РеализацияТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияТоваровУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияУслугПрочихАктивов" 

	Дано Я открываю основную форму списка документа "РеализацияУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияУслугПрочихАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияУслугПрочихАктивов"

	Дано Я открываю основную форму документа "РеализацияУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияУслугПрочихАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистраторПланаПроизводства" 

	Дано Я открываю основную форму списка документа "РегистраторПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторПланаПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистраторПланаПроизводства"

	Дано Я открываю основную форму документа "РегистраторПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторПланаПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистраторРасчетаСебестоимости" 

	Дано Я открываю основную форму списка документа "РегистраторРасчетаСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторРасчетаСебестоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистраторРасчетаСебестоимости"

	Дано Я открываю основную форму документа "РегистраторРасчетаСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторРасчетаСебестоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистраторРасчетов" 

	Дано Я открываю основную форму списка документа "РегистраторРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторРасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистраторРасчетов"

	Дано Я открываю основную форму документа "РегистраторРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторРасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияДефекта" 

	Дано Я открываю основную форму списка документа "РегистрацияДефекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияДефекта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияДефекта"

	Дано Я открываю основную форму документа "РегистрацияДефекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияДефекта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияЗемельныхУчастков" 

	Дано Я открываю основную форму списка документа "РегистрацияЗемельныхУчастков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияЗемельныхУчастков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияЗемельныхУчастков"

	Дано Я открываю основную форму документа "РегистрацияЗемельныхУчастков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияЗемельныхУчастков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияПереработок" 

	Дано Я открываю основную форму списка документа "РегистрацияПереработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПереработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияПереработок"

	Дано Я открываю основную форму документа "РегистрацияПереработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПереработок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество" 

	Дано Я открываю основную форму списка документа "РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество"

	Дано Я открываю основную форму документа "РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияПрочихДоходов" 

	Дано Я открываю основную форму списка документа "РегистрацияПрочихДоходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПрочихДоходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияПрочихДоходов"

	Дано Я открываю основную форму документа "РегистрацияПрочихДоходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПрочихДоходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияПрочихКонтролируемыхСделок" 

	Дано Я открываю основную форму списка документа "РегистрацияПрочихКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПрочихКонтролируемыхСделок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияПрочихКонтролируемыхСделок"

	Дано Я открываю основную форму документа "РегистрацияПрочихКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПрочихКонтролируемыхСделок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияСведенийОЗастрахованномЛицеФСС" 

	Дано Я открываю основную форму списка документа "РегистрацияСведенийОЗастрахованномЛицеФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияСведенийОЗастрахованномЛицеФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияСведенийОЗастрахованномЛицеФСС"

	Дано Я открываю основную форму документа "РегистрацияСведенийОЗастрахованномЛицеФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияСведенийОЗастрахованномЛицеФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияТранспортныхСредств" 

	Дано Я открываю основную форму списка документа "РегистрацияТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияТранспортныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияТранспортныхСредств"

	Дано Я открываю основную форму документа "РегистрацияТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияТранспортныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияТрудовойДеятельности" 

	Дано Я открываю основную форму списка документа "РегистрацияТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияТрудовойДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияТрудовойДеятельности"

	Дано Я открываю основную форму документа "РегистрацияТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияТрудовойДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияЦенНоменклатурыПоставщика" 

	Дано Я открываю основную форму списка документа "РегистрацияЦенНоменклатурыПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияЦенНоменклатурыПоставщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияЦенНоменклатурыПоставщика"

	Дано Я открываю основную форму документа "РегистрацияЦенНоменклатурыПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияЦенНоменклатурыПоставщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрУчета" 

	Дано Я открываю основную форму списка документа "РегистрУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрУчета"

	Дано Я открываю основную форму документа "РегистрУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентированныйОтчет" 

	Дано Я открываю основную форму списка документа "РегламентированныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентированныйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентированныйОтчет"

	Дано Я открываю основную форму документа "РегламентированныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентированныйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентнаяОперация" 

	Дано Я открываю основную форму списка документа "РегламентнаяОперация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентнаяОперация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентнаяОперация"

	Дано Я открываю основную форму документа "РегламентнаяОперация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентнаяОперация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентнаяОперацияМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "РегламентнаяОперацияМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентнаяОперацияМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентнаяОперацияМеждународныйУчет"

	Дано Я открываю основную форму документа "РегламентнаяОперацияМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентнаяОперацияМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрДанныхЭЛНЗаполняемыхРаботодателем" 

	Дано Я открываю основную форму списка документа "РеестрДанныхЭЛНЗаполняемыхРаботодателем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрДанныхЭЛНЗаполняемыхРаботодателем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрДанныхЭЛНЗаполняемыхРаботодателем"

	Дано Я открываю основную форму документа "РеестрДанныхЭЛНЗаполняемыхРаботодателем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрДанныхЭЛНЗаполняемыхРаботодателем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрДСВ_3" 

	Дано Я открываю основную форму списка документа "РеестрДСВ_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрДСВ_3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрДСВ_3"

	Дано Я открываю основную форму документа "РеестрДСВ_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрДСВ_3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий" 

	Дано Я открываю основную форму списка документа "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"

	Дано Я открываю основную форму документа "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСЗВ_6_2" 

	Дано Я открываю основную форму списка документа "РеестрСЗВ_6_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСЗВ_6_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСЗВ_6_2"

	Дано Я открываю основную форму документа "РеестрСЗВ_6_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСЗВ_6_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам" 

	Дано Я открываю основную форму списка документа "РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам"

	Дано Я открываю основную форму документа "РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСчетовФактурПоставщика" 

	Дано Я открываю основную форму списка документа "РеестрСчетовФактурПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСчетовФактурПоставщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСчетовФактурПоставщика"

	Дано Я открываю основную форму документа "РеестрСчетовФактурПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСчетовФактурПоставщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборкаТоваров" 

	Дано Я открываю основную форму списка документа "СборкаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборкаТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборкаТоваров"

	Дано Я открываю основную форму документа "СборкаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборкаТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ" 

	Дано Я открываю основную форму списка документа "СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ"

	Дано Я открываю основную форму документа "СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗастрахованномЛицеФСС" 

	Дано Я открываю основную форму списка документа "СведенияОЗастрахованномЛицеФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗастрахованномЛицеФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗастрахованномЛицеФСС"

	Дано Я открываю основную форму документа "СведенияОЗастрахованномЛицеФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗастрахованномЛицеФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗастрахованныхЛицахСЗВ_М" 

	Дано Я открываю основную форму списка документа "СведенияОЗастрахованныхЛицахСЗВ_М"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗастрахованныхЛицахСЗВ_М"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗастрахованныхЛицахСЗВ_М"

	Дано Я открываю основную форму документа "СведенияОЗастрахованныхЛицахСЗВ_М"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗастрахованныхЛицахСЗВ_М"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ" 

	Дано Я открываю основную форму списка документа "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"

	Дано Я открываю основную форму документа "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОТрудовойДеятельностиРаботникаСТД_Р" 

	Дано Я открываю основную форму списка документа "СведенияОТрудовойДеятельностиРаботникаСТД_Р"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОТрудовойДеятельностиРаботникаСТД_Р"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОТрудовойДеятельностиРаботникаСТД_Р"

	Дано Я открываю основную форму документа "СведенияОТрудовойДеятельностиРаботникаСТД_Р"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОТрудовойДеятельностиРаботникаСТД_Р"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД" 

	Дано Я открываю основную форму списка документа "СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД"

	Дано Я открываю основную форму документа "СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СверкаВзаиморасчетов" 

	Дано Я открываю основную форму списка документа "СверкаВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаВзаиморасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СверкаВзаиморасчетов"

	Дано Я открываю основную форму документа "СверкаВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаВзаиморасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СверкаНачальныхОстатковПоСкладу" 

	Дано Я открываю основную форму списка документа "СверкаНачальныхОстатковПоСкладу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаНачальныхОстатковПоСкладу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СверкаНачальныхОстатковПоСкладу"

	Дано Я открываю основную форму документа "СверкаНачальныхОстатковПоСкладу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаНачальныхОстатковПоСкладу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СводнаяСправкаНДС" 

	Дано Я открываю основную форму списка документа "СводнаяСправкаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СводнаяСправкаНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СводнаяСправкаНДС"

	Дано Я открываю основную форму документа "СводнаяСправкаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СводнаяСправкаНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СменноеЗадание" 

	Дано Я открываю основную форму списка документа "СменноеЗадание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СменноеЗадание"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СменноеЗадание"

	Дано Я открываю основную форму документа "СменноеЗадание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СменноеЗадание"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Совмещение" 

	Дано Я открываю основную форму списка документа "Совмещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Совмещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Совмещение"

	Дано Я открываю основную форму документа "Совмещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Совмещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласиеНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласиеНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласиеНаУведомлениеОбЭЛН" 

	Дано Я открываю основную форму списка документа "СогласиеНаУведомлениеОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаУведомлениеОбЭЛН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласиеНаУведомлениеОбЭЛН"

	Дано Я открываю основную форму документа "СогласиеНаУведомлениеОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаУведомлениеОбЭЛН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеSMS" 

	Дано Я открываю основную форму списка документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеSMS"

	Дано Я открываю основную форму документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеОбменСБанками" 

	Дано Я открываю основную форму списка документа "СообщениеОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеОбменСБанками"

	Дано Я открываю основную форму документа "СообщениеОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеЭДО" 

	Дано Я открываю основную форму списка документа "СообщениеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеЭДО"

	Дано Я открываю основную форму документа "СообщениеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеБезналичныхДенежныхСредств" 

	Дано Я открываю основную форму списка документа "СписаниеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеБезналичныхДенежныхСредств"

	Дано Я открываю основную форму документа "СписаниеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеЗадолженности" 

	Дано Я открываю основную форму списка документа "СписаниеЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеЗадолженности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеЗадолженности"

	Дано Я открываю основную форму документа "СписаниеЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеЗадолженности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеЗатратНаВыпуск" 

	Дано Я открываю основную форму списка документа "СписаниеЗатратНаВыпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеЗатратНаВыпуск"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеЗатратНаВыпуск"

	Дано Я открываю основную форму документа "СписаниеЗатратНаВыпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеЗатратНаВыпуск"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеИзЭксплуатации" 

	Дано Я открываю основную форму списка документа "СписаниеИзЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеИзЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеИзЭксплуатации"

	Дано Я открываю основную форму документа "СписаниеИзЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеИзЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеКодовМаркировкиИСМП" 

	Дано Я открываю основную форму списка документа "СписаниеКодовМаркировкиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеКодовМаркировкиИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеКодовМаркировкиИСМП"

	Дано Я открываю основную форму документа "СписаниеКодовМаркировкиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеКодовМаркировкиИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеНДСНаРасходы" 

	Дано Я открываю основную форму списка документа "СписаниеНДСНаРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНДСНаРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеНДСНаРасходы"

	Дано Я открываю основную форму документа "СписаниеНДСНаРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНДСНаРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеНедостачТоваров" 

	Дано Я открываю основную форму списка документа "СписаниеНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНедостачТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеНедостачТоваров"

	Дано Я открываю основную форму документа "СписаниеНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНедостачТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеНМА" 

	Дано Я открываю основную форму списка документа "СписаниеНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеНМА"

	Дано Я открываю основную форму документа "СписаниеНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеНМА2_4" 

	Дано Я открываю основную форму списка документа "СписаниеНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНМА2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеНМА2_4"

	Дано Я открываю основную форму документа "СписаниеНМА2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНМА2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеНМАМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "СписаниеНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНМАМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеНМАМеждународныйУчет"

	Дано Я открываю основную форму документа "СписаниеНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНМАМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеОС" 

	Дано Я открываю основную форму списка документа "СписаниеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеОС"

	Дано Я открываю основную форму документа "СписаниеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеОС2_4" 

	Дано Я открываю основную форму списка документа "СписаниеОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеОС2_4"

	Дано Я открываю основную форму документа "СписаниеОС2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеОСМеждународныйУчет" 

	Дано Я открываю основную форму списка документа "СписаниеОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОСМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеОСМеждународныйУчет"

	Дано Я открываю основную форму документа "СписаниеОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОСМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеПринятыхНаХранениеТоваров" 

	Дано Я открываю основную форму списка документа "СписаниеПринятыхНаХранениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеПринятыхНаХранениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеПринятыхНаХранениеТоваров"

	Дано Я открываю основную форму документа "СписаниеПринятыхНаХранениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеПринятыхНаХранениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеТоваровУХранителя" 

	Дано Я открываю основную форму списка документа "СписаниеТоваровУХранителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеТоваровУХранителя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеТоваровУХранителя"

	Дано Я открываю основную форму документа "СписаниеТоваровУХранителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеТоваровУХранителя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкаНДФЛ" 

	Дано Я открываю основную форму списка документа "СправкаНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкаНДФЛ"

	Дано Я открываю основную форму документа "СправкаНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкаОПодтверждающихДокументах" 

	Дано Я открываю основную форму списка документа "СправкаОПодтверждающихДокументах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаОПодтверждающихДокументах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкаОПодтверждающихДокументах"

	Дано Я открываю основную форму документа "СправкаОПодтверждающихДокументах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаОПодтверждающихДокументах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиНДФЛДляПередачиВНалоговыйОрган" 

	Дано Я открываю основную форму списка документа "СправкиНДФЛДляПередачиВНалоговыйОрган"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиНДФЛДляПередачиВНалоговыйОрган"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиНДФЛДляПередачиВНалоговыйОрган"

	Дано Я открываю основную форму документа "СправкиНДФЛДляПередачиВНалоговыйОрган"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиНДФЛДляПередачиВНалоговыйОрган"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль" 

	Дано Я открываю основную форму списка документа "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"

	Дано Я открываю основную форму документа "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиСПАРКРиски" 

	Дано Я открываю основную форму списка документа "СправкиСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиСПАРКРиски"

	Дано Я открываю основную форму документа "СправкиСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистикаПерсонала" 

	Дано Я открываю основную форму списка документа "СтатистикаПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СтатистикаПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистикаПерсонала"

	Дано Я открываю основную форму документа "СтатистикаПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СтатистикаПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СторнированиеНачислений" 

	Дано Я открываю основную форму списка документа "СторнированиеНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СторнированиеНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СторнированиеНачислений"

	Дано Я открываю основную форму документа "СторнированиеНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СторнированиеНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Сторно" 

	Дано Я открываю основную форму списка документа "Сторно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Сторно"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Сторно"

	Дано Я открываю основную форму документа "Сторно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Сторно"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетНаОплатуКлиенту" 

	Дано Я открываю основную форму списка документа "СчетНаОплатуКлиенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетНаОплатуКлиенту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетНаОплатуКлиенту"

	Дано Я открываю основную форму документа "СчетНаОплатуКлиенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетНаОплатуКлиенту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданный" 

	Дано Я открываю основную форму списка документа "СчетФактураВыданный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданный"

	Дано Я открываю основную форму документа "СчетФактураВыданный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданныйАванс" 

	Дано Я открываю основную форму списка документа "СчетФактураВыданныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданныйАванс"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданныйАванс"

	Дано Я открываю основную форму документа "СчетФактураВыданныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданныйАванс"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураКомиссионеру" 

	Дано Я открываю основную форму списка документа "СчетФактураКомиссионеру"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураКомиссионеру"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураКомиссионеру"

	Дано Я открываю основную форму документа "СчетФактураКомиссионеру"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураКомиссионеру"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураКомитента" 

	Дано Я открываю основную форму списка документа "СчетФактураКомитента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураКомитента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураКомитента"

	Дано Я открываю основную форму документа "СчетФактураКомитента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураКомитента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураНалоговыйАгент" 

	Дано Я открываю основную форму списка документа "СчетФактураНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНалоговыйАгент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураНалоговыйАгент"

	Дано Я открываю основную форму документа "СчетФактураНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНалоговыйАгент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураНаНеподтвержденнуюРеализацию0" 

	Дано Я открываю основную форму списка документа "СчетФактураНаНеподтвержденнуюРеализацию0"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНаНеподтвержденнуюРеализацию0"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураНаНеподтвержденнуюРеализацию0"

	Дано Я открываю основную форму документа "СчетФактураНаНеподтвержденнуюРеализацию0"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНаНеподтвержденнуюРеализацию0"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученный" 

	Дано Я открываю основную форму списка документа "СчетФактураПолученный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученный"

	Дано Я открываю основную форму документа "СчетФактураПолученный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйАванс" 

	Дано Я открываю основную форму списка документа "СчетФактураПолученныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйАванс"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйАванс"

	Дано Я открываю основную форму документа "СчетФактураПолученныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйАванс"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйНалоговыйАгент" 

	Дано Я открываю основную форму списка документа "СчетФактураПолученныйНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйНалоговыйАгент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйНалоговыйАгент"

	Дано Я открываю основную форму документа "СчетФактураПолученныйНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйНалоговыйАгент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТабельУчетаРабочегоВремени" 

	Дано Я открываю основную форму списка документа "ТабельУчетаРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТабельУчетаРабочегоВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТабельУчетаРабочегоВремени"

	Дано Я открываю основную форму документа "ТабельУчетаРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТабельУчетаРабочегоВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаможеннаяДекларацияИмпорт" 

	Дано Я открываю основную форму списка документа "ТаможеннаяДекларацияИмпорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТаможеннаяДекларацияИмпорт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаможеннаяДекларацияИмпорт"

	Дано Я открываю основную форму документа "ТаможеннаяДекларацияИмпорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТаможеннаяДекларацияИмпорт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаможеннаяДекларацияЭкспорт" 

	Дано Я открываю основную форму списка документа "ТаможеннаяДекларацияЭкспорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТаможеннаяДекларацияЭкспорт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаможеннаяДекларацияЭкспорт"

	Дано Я открываю основную форму документа "ТаможеннаяДекларацияЭкспорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТаможеннаяДекларацияЭкспорт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелефонныйЗвонок" 

	Дано Я открываю основную форму списка документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелефонныйЗвонок"

	Дано Я открываю основную форму документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортнаяНакладная" 

	Дано Я открываю основную форму списка документа "ТранспортнаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортнаяНакладная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортнаяНакладная"

	Дано Я открываю основную форму документа "ТранспортнаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортнаяНакладная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортнаяНакладнаяЕГАИС" 

	Дано Я открываю основную форму списка документа "ТранспортнаяНакладнаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортнаяНакладнаяЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортнаяНакладнаяЕГАИС"

	Дано Я открываю основную форму документа "ТранспортнаяНакладнаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортнаяНакладнаяЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортноеСообщение" 

	Дано Я открываю основную форму списка документа "ТранспортноеСообщение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортноеСообщение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортноеСообщение"

	Дано Я открываю основную форму документа "ТранспортноеСообщение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортноеСообщение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортныйКонтейнерЭДО" 

	Дано Я открываю основную форму списка документа "ТранспортныйКонтейнерЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортныйКонтейнерЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортныйКонтейнерЭДО"

	Дано Я открываю основную форму документа "ТранспортныйКонтейнерЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортныйКонтейнерЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТТНВходящаяЕГАИС" 

	Дано Я открываю основную форму списка документа "ТТНВходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНВходящаяЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТТНВходящаяЕГАИС"

	Дано Я открываю основную форму документа "ТТНВходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНВходящаяЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТТНИсходящаяЕГАИС" 

	Дано Я открываю основную форму списка документа "ТТНИсходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНИсходящаяЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТТНИсходящаяЕГАИС"

	Дано Я открываю основную форму документа "ТТНИсходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНИсходящаяЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОбИмпортеМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОбИмпортеМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОбОстаткахПрослеживаемыхТоваров" 

	Дано Я открываю основную форму списка документа "УведомлениеОбОстаткахПрослеживаемыхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбОстаткахПрослеживаемыхТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОбОстаткахПрослеживаемыхТоваров"

	Дано Я открываю основную форму документа "УведомлениеОбОстаткахПрослеживаемыхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбОстаткахПрослеживаемыхТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОВвозеПрослеживаемыхТоваров" 

	Дано Я открываю основную форму списка документа "УведомлениеОВвозеПрослеживаемыхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОВвозеПрослеживаемыхТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОВвозеПрослеживаемыхТоваров"

	Дано Я открываю основную форму документа "УведомлениеОВвозеПрослеживаемыхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОВвозеПрослеживаемыхТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОЗачисленииВалюты" 

	Дано Я открываю основную форму списка документа "УведомлениеОЗачисленииВалюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОЗачисленииВалюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОЗачисленииВалюты"

	Дано Я открываю основную форму документа "УведомлениеОЗачисленииВалюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОЗачисленииВалюты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОКонтролируемыхСделках" 

	Дано Я открываю основную форму списка документа "УведомлениеОКонтролируемыхСделках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОКонтролируемыхСделках"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОКонтролируемыхСделках"

	Дано Я открываю основную форму документа "УведомлениеОКонтролируемыхСделках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОКонтролируемыхСделках"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПеремещенииПрослеживаемыхТоваров" 

	Дано Я открываю основную форму списка документа "УведомлениеОПеремещенииПрослеживаемыхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПеремещенииПрослеживаемыхТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПеремещенииПрослеживаемыхТоваров"

	Дано Я открываю основную форму документа "УведомлениеОПеремещенииПрослеживаемыхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПеремещенииПрослеживаемыхТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПолучателеДокументов" 

	Дано Я открываю основную форму списка документа "УведомлениеОПолучателеДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПолучателеДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПолучателеДокументов"

	Дано Я открываю основную форму документа "УведомлениеОПолучателеДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПолучателеДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПоступленииМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПоступленииМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПравеНаИмущественныйВычетДляНДФЛ" 

	Дано Я открываю основную форму списка документа "УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"

	Дано Я открываю основную форму документа "УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка документа "УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком"

	Дано Я открываю основную форму документа "УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОСпецрежимахНалогообложения" 

	Дано Я открываю основную форму списка документа "УведомлениеОСпецрежимахНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСпецрежимахНалогообложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОСпецрежимахНалогообложения"

	Дано Я открываю основную форму документа "УведомлениеОСпецрежимахНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСпецрежимахНалогообложения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОСписанииКиЗГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОСписанииКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСписанииКиЗГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОСписанииКиЗГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОСписанииКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСписанииКиЗГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Увольнение" 

	Дано Я открываю основную форму списка документа "Увольнение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Увольнение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Увольнение"

	Дано Я открываю основную форму документа "Увольнение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Увольнение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УвольнениеСписком" 

	Дано Я открываю основную форму списка документа "УвольнениеСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УвольнениеСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УвольнениеСписком"

	Дано Я открываю основную форму документа "УвольнениеСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УвольнениеСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВводОстатковПрослеживаемыхИмпортныхТоваров" 

	Дано Я открываю основную форму списка документа "УдалитьВводОстатковПрослеживаемыхИмпортныхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьВводОстатковПрослеживаемыхИмпортныхТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВводОстатковПрослеживаемыхИмпортныхТоваров"

	Дано Я открываю основную форму документа "УдалитьВводОстатковПрослеживаемыхИмпортныхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьВводОстатковПрослеживаемыхИмпортныхТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка документа "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму документа "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика" 

	Дано Я открываю основную форму списка документа "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"

	Дано Я открываю основную форму документа "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗаявлениеАбонентаСпецоператораСвязи" 

	Дано Я открываю основную форму списка документа "УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗаявлениеАбонентаСпецоператораСвязи"

	Дано Я открываю основную форму документа "УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКассоваяСмена" 

	Дано Я открываю основную форму списка документа "УдалитьКассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассоваяСмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКассоваяСмена"

	Дано Я открываю основную форму документа "УдалитьКассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассоваяСмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКассовыйЧекКоррекции" 

	Дано Я открываю основную форму списка документа "УдалитьКассовыйЧекКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассовыйЧекКоррекции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКассовыйЧекКоррекции"

	Дано Я открываю основную форму документа "УдалитьКассовыйЧекКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассовыйЧекКоррекции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПроизвольныйЭД" 

	Дано Я открываю основную форму списка документа "УдалитьПроизвольныйЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьПроизвольныйЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПроизвольныйЭД"

	Дано Я открываю основную форму документа "УдалитьПроизвольныйЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьПроизвольныйЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРегистраторГрафикаДвиженияТоваров" 

	Дано Я открываю основную форму списка документа "УдалитьРегистраторГрафикаДвиженияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьРегистраторГрафикаДвиженияТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРегистраторГрафикаДвиженияТоваров"

	Дано Я открываю основную форму документа "УдалитьРегистраторГрафикаДвиженияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьРегистраторГрафикаДвиженияТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьФормированиеСоставаБригады" 

	Дано Я открываю основную форму списка документа "УдалитьФормированиеСоставаБригады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьФормированиеСоставаБригады"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьФормированиеСоставаБригады"

	Дано Я открываю основную форму документа "УдалитьФормированиеСоставаБригады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьФормированиеСоставаБригады"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержаниеВСчетРасчетовПоПрочимОперациям" 

	Дано Я открываю основную форму списка документа "УдержаниеВСчетРасчетовПоПрочимОперациям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеВСчетРасчетовПоПрочимОперациям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержаниеВСчетРасчетовПоПрочимОперациям"

	Дано Я открываю основную форму документа "УдержаниеВСчетРасчетовПоПрочимОперациям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеВСчетРасчетовПоПрочимОперациям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержаниеДобровольныхВзносовВНПФ" 

	Дано Я открываю основную форму списка документа "УдержаниеДобровольныхВзносовВНПФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеДобровольныхВзносовВНПФ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержаниеДобровольныхВзносовВНПФ"

	Дано Я открываю основную форму документа "УдержаниеДобровольныхВзносовВНПФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеДобровольныхВзносовВНПФ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержаниеДобровольныхСтраховыхВзносов" 

	Дано Я открываю основную форму списка документа "УдержаниеДобровольныхСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеДобровольныхСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержаниеДобровольныхСтраховыхВзносов"

	Дано Я открываю основную форму документа "УдержаниеДобровольныхСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеДобровольныхСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержаниеПрофсоюзныхВзносов" 

	Дано Я открываю основную форму списка документа "УдержаниеПрофсоюзныхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеПрофсоюзныхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержаниеПрофсоюзныхВзносов"

	Дано Я открываю основную форму документа "УдержаниеПрофсоюзныхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеПрофсоюзныхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УпаковочныйЛист" 

	Дано Я открываю основную форму списка документа "УпаковочныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УпаковочныйЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УпаковочныйЛист"

	Дано Я открываю основную форму документа "УпаковочныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УпаковочныйЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаБлокировокЯчеек" 

	Дано Я открываю основную форму списка документа "УстановкаБлокировокЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаБлокировокЯчеек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаБлокировокЯчеек"

	Дано Я открываю основную форму документа "УстановкаБлокировокЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаБлокировокЯчеек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаЗначенийНаработки" 

	Дано Я открываю основную форму списка документа "УстановкаЗначенийНаработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЗначенийНаработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаЗначенийНаработки"

	Дано Я открываю основную форму документа "УстановкаЗначенийНаработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЗначенийНаработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаЗначенийНефинансовыхПоказателей" 

	Дано Я открываю основную форму списка документа "УстановкаЗначенийНефинансовыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЗначенийНефинансовыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаЗначенийНефинансовыхПоказателей"

	Дано Я открываю основную форму документа "УстановкаЗначенийНефинансовыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЗначенийНефинансовыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаКвотАссортимента" 

	Дано Я открываю основную форму списка документа "УстановкаКвотАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаКвотАссортимента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаКвотАссортимента"

	Дано Я открываю основную форму документа "УстановкаКвотАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаКвотАссортимента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаНормативовПроизводственныхРасходов" 

	Дано Я открываю основную форму списка документа "УстановкаНормативовПроизводственныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаНормативовПроизводственныхРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаНормативовПроизводственныхРасходов"

	Дано Я открываю основную форму документа "УстановкаНормативовПроизводственныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаНормативовПроизводственныхРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаЦенНоменклатуры" 

	Дано Я открываю основную форму списка документа "УстановкаЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЦенНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаЦенНоменклатуры"

	Дано Я открываю основную форму документа "УстановкаЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЦенНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УтверждениеТарифнойСетки" 

	Дано Я открываю основную форму списка документа "УтверждениеТарифнойСетки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УтверждениеТарифнойСетки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УтверждениеТарифнойСетки"

	Дано Я открываю основную форму документа "УтверждениеТарифнойСетки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УтверждениеТарифнойСетки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УтверждениеШтатногоРасписания" 

	Дано Я открываю основную форму списка документа "УтверждениеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УтверждениеШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УтверждениеШтатногоРасписания"

	Дано Я открываю основную форму документа "УтверждениеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УтверждениеШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФинОтчетВБанк" 

	Дано Я открываю основную форму списка документа "ФинОтчетВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ФинОтчетВБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФинОтчетВБанк"

	Дано Я открываю основную форму документа "ФинОтчетВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ФинОтчетВБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФормированиеЗаписейРаздела7ДекларацииНДС" 

	Дано Я открываю основную форму списка документа "ФормированиеЗаписейРаздела7ДекларацииНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ФормированиеЗаписейРаздела7ДекларацииНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФормированиеЗаписейРаздела7ДекларацииНДС"

	Дано Я открываю основную форму документа "ФормированиеЗаписейРаздела7ДекларацииНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ФормированиеЗаписейРаздела7ДекларацииНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХодатайствоОБронированииГражданПребывающихВЗапасе" 

	Дано Я открываю основную форму списка документа "ХодатайствоОБронированииГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ХодатайствоОБронированииГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХодатайствоОБронированииГражданПребывающихВЗапасе"

	Дано Я открываю основную форму документа "ХодатайствоОБронированииГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ХодатайствоОБронированииГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекЕГАИС" 

	Дано Я открываю основную форму списка документа "ЧекЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекЕГАИС"

	Дано Я открываю основную форму документа "ЧекЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекЕГАИСВозврат" 

	Дано Я открываю основную форму списка документа "ЧекЕГАИСВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИСВозврат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекЕГАИСВозврат"

	Дано Я открываю основную форму документа "ЧекЕГАИСВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИСВозврат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМ" 

	Дано Я открываю основную форму списка документа "ЧекККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМ"

	Дано Я открываю основную форму документа "ЧекККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМВозврат" 

	Дано Я открываю основную форму списка документа "ЧекККМВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМВозврат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМВозврат"

	Дано Я открываю основную форму документа "ЧекККМВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМВозврат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМКоррекции" 

	Дано Я открываю основную форму списка документа "ЧекККМКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМКоррекции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМКоррекции"

	Дано Я открываю основную форму документа "ЧекККМКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМКоррекции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭкземплярБюджета" 

	Дано Я открываю основную форму списка документа "ЭкземплярБюджета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭкземплярБюджета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭкземплярБюджета"

	Дано Я открываю основную форму документа "ЭкземплярБюджета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭкземплярБюджета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭкземплярФинансовогоОтчета" 

	Дано Я открываю основную форму списка документа "ЭкземплярФинансовогоОтчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭкземплярФинансовогоОтчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭкземплярФинансовогоОтчета"

	Дано Я открываю основную форму документа "ЭкземплярФинансовогоОтчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭкземплярФинансовогоОтчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоВходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоИсходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныйДокументВходящийЭДО" 

	Дано Я открываю основную форму списка документа "ЭлектронныйДокументВходящийЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументВходящийЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныйДокументВходящийЭДО"

	Дано Я открываю основную форму документа "ЭлектронныйДокументВходящийЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументВходящийЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныйДокументИсходящийЭДО" 

	Дано Я открываю основную форму списка документа "ЭлектронныйДокументИсходящийЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументИсходящийЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныйДокументИсходящийЭДО"

	Дано Я открываю основную форму документа "ЭлектронныйДокументИсходящийЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументИсходящийЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭтапПроизводства2_2" 

	Дано Я открываю основную форму списка документа "ЭтапПроизводства2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭтапПроизводства2_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭтапПроизводства2_2"

	Дано Я открываю основную форму документа "ЭтапПроизводства2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭтапПроизводства2_2"
	И Я закрываю текущее окно

