#language: ru

@tree
@быстрые проврки

Функциональность: Дымовые тесты для регистров

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "ABCXYZКлассификацияКлиентов" 

	Дано Я открываю основную форму списка регистра сведений "ABCXYZКлассификацияКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ABCXYZКлассификацияКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ABCXYZКлассификацияКлиентов"

	Дано Я открываю основную форму регистра сведений "ABCXYZКлассификацияКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ABCXYZКлассификацияКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ABCXYZКлассификацияНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "ABCXYZКлассификацияНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ABCXYZКлассификацияНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ABCXYZКлассификацияНоменклатуры"

	Дано Я открываю основную форму регистра сведений "ABCXYZКлассификацияНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ABCXYZКлассификацияНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АбонентыЭДО" 

	Дано Я открываю основную форму списка регистра сведений "АбонентыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АбонентыЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АбонентыЭДО"

	Дано Я открываю основную форму регистра сведений "АбонентыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АбонентыЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоматическиОбновляемыеГрафикиРаботыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "АвтоматическиОбновляемыеГрафикиРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АвтоматическиОбновляемыеГрафикиРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоматическиОбновляемыеГрафикиРаботыСотрудников"

	Дано Я открываю основную форму регистра сведений "АвтоматическиОбновляемыеГрафикиРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АвтоматическиОбновляемыеГрафикиРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АдресаЗонОтветственностиВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "АдресаЗонОтветственностиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресаЗонОтветственностиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АдресаЗонОтветственностиВЕТИС"

	Дано Я открываю основную форму регистра сведений "АдресаЗонОтветственностиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресаЗонОтветственностиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АдресныеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АдресныеОбъекты"

	Дано Я открываю основную форму регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктуальностьИнформацииОбОтпуске" 

	Дано Я открываю основную форму списка регистра сведений "АктуальностьИнформацииОбОтпуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АктуальностьИнформацииОбОтпуске"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктуальностьИнформацииОбОтпуске"

	Дано Я открываю основную форму регистра сведений "АктуальностьИнформацииОбОтпуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АктуальностьИнформацииОбОтпуске"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АкцизныеМаркиЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "АкцизныеМаркиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АкцизныеМаркиЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АкцизныеМаркиЕГАИС"

	Дано Я открываю основную форму регистра сведений "АкцизныеМаркиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АкцизныеМаркиЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизационныеГруппыОКОФ" 

	Дано Я открываю основную форму списка регистра сведений "АмортизационныеГруппыОКОФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АмортизационныеГруппыОКОФ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизационныеГруппыОКОФ"

	Дано Я открываю основную форму регистра сведений "АмортизационныеГруппыОКОФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АмортизационныеГруппыОКОФ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналитикаУчетаНаборов" 

	Дано Я открываю основную форму списка регистра сведений "АналитикаУчетаНаборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаНаборов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналитикаУчетаНаборов"

	Дано Я открываю основную форму регистра сведений "АналитикаУчетаНаборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаНаборов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналитикаУчетаНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "АналитикаУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналитикаУчетаНоменклатуры"

	Дано Я открываю основную форму регистра сведений "АналитикаУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналитикаУчетаПартий" 

	Дано Я открываю основную форму списка регистра сведений "АналитикаУчетаПартий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаПартий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналитикаУчетаПартий"

	Дано Я открываю основную форму регистра сведений "АналитикаУчетаПартий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаПартий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналитикаУчетаПоПартнерам" 

	Дано Я открываю основную форму списка регистра сведений "АналитикаУчетаПоПартнерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаПоПартнерам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналитикаУчетаПоПартнерам"

	Дано Я открываю основную форму регистра сведений "АналитикаУчетаПоПартнерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаПоПартнерам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналогиМатериалов" 

	Дано Я открываю основную форму списка регистра сведений "АналогиМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналогиМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналогиМатериалов"

	Дано Я открываю основную форму регистра сведений "АналогиМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналогиМатериалов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АрендованныеОС" 

	Дано Я открываю основную форму списка регистра сведений "АрендованныеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АрендованныеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АрендованныеОС"

	Дано Я открываю основную форму регистра сведений "АрендованныеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АрендованныеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АрхивДанныхРегламентированнойОтчетности" 

	Дано Я открываю основную форму списка регистра сведений "АрхивДанныхРегламентированнойОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АрхивДанныхРегламентированнойОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АрхивДанныхРегламентированнойОтчетности"

	Дано Я открываю основную форму регистра сведений "АрхивДанныхРегламентированнойОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АрхивДанныхРегламентированнойОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Ассортимент" 

	Дано Я открываю основную форму списка регистра сведений "Ассортимент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Ассортимент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Ассортимент"

	Дано Я открываю основную форму регистра сведений "Ассортимент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Ассортимент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БезопасноеХранилищеДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанныхОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БезопасноеХранилищеДанныхОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкиПооперационногоРасписания" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиПооперационногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиПооперационногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкиПооперационногоРасписания"

	Дано Я открываю основную форму регистра сведений "БлокировкиПооперационногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиПооперационногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкиПооперационногоРасписания2_2" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиПооперационногоРасписания2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиПооперационногоРасписания2_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкиПооперационногоРасписания2_2"

	Дано Я открываю основную форму регистра сведений "БлокировкиПооперационногоРасписания2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиПооперационногоРасписания2_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкиСеансовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкиСеансовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкиСкладскихЯчеек" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиСкладскихЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСкладскихЯчеек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкиСкладскихЯчеек"

	Дано Я открываю основную форму регистра сведений "БлокировкиСкладскихЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСкладскихЯчеек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БронированиеСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "БронированиеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БронированиеСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БронированиеСотрудников"

	Дано Я открываю основную форму регистра сведений "БронированиеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БронированиеСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БуферОперацийСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БуферОперацийСтатистики"

	Дано Я открываю основную форму регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыПервичныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыПервичныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыПервичныхДокументов"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыПервичныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыПодразделений"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыСотрудниковИсправления" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыСотрудниковИсправления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыСотрудниковИсправления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыСотрудниковИсправления"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыСотрудниковИсправления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыСотрудниковИсправления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыТерриторийВыполненияРабот" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыТерриторийВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыТерриторийВыполненияРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыТерриторийВыполненияРабот"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыТерриторийВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыТерриторийВыполненияРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетПлановыхНачислений" 

	Дано Я открываю основную форму списка регистра сведений "БухучетПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетПлановыхНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетПлановыхНачислений"

	Дано Я открываю основную форму регистра сведений "БухучетПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетПлановыхНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетПлановыхУдержаний" 

	Дано Я открываю основную форму списка регистра сведений "БухучетПлановыхУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетПлановыхУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетПлановыхУдержаний"

	Дано Я открываю основную форму регистра сведений "БухучетПлановыхУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетПлановыхУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетРаботСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "БухучетРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетРаботСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетРаботСотрудников"

	Дано Я открываю основную форму регистра сведений "БухучетРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетРаботСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетРабочегоВремениСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "БухучетРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетРабочегоВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетРабочегоВремениСотрудников"

	Дано Я открываю основную форму регистра сведений "БухучетРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетРабочегоВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетРаспределениеОсновногоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "БухучетРаспределениеОсновногоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетРаспределениеОсновногоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетРаспределениеОсновногоЗаработка"

	Дано Я открываю основную форму регистра сведений "БухучетРаспределениеОсновногоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетРаспределениеОсновногоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОбеспеченияРаботами" 

	Дано Я открываю основную форму списка регистра сведений "ВариантыОбеспеченияРаботами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыОбеспеченияРаботами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОбеспеченияРаботами"

	Дано Я открываю основную форму регистра сведений "ВариантыОбеспеченияРаботами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыОбеспеченияРаботами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОбеспеченияТоварами" 

	Дано Я открываю основную форму списка регистра сведений "ВариантыОбеспеченияТоварами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыОбеспеченияТоварами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОбеспеченияТоварами"

	Дано Я открываю основную форму регистра сведений "ВариантыОбеспеченияТоварами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыОбеспеченияТоварами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыПереупаковки" 

	Дано Я открываю основную форму списка регистра сведений "ВариантыПереупаковки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыПереупаковки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыПереупаковки"

	Дано Я открываю основную форму регистра сведений "ВариантыПереупаковки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыПереупаковки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыУказанияНоменклатурыВДокументахБЭД" 

	Дано Я открываю основную форму списка регистра сведений "ВариантыУказанияНоменклатурыВДокументахБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыУказанияНоменклатурыВДокументахБЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыУказанияНоменклатурыВДокументахБЭД"

	Дано Я открываю основную форму регистра сведений "ВариантыУказанияНоменклатурыВДокументахБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыУказанияНоменклатурыВДокументахБЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВеличинаПрожиточногоМинимума" 

	Дано Я открываю основную форму списка регистра сведений "ВеличинаПрожиточногоМинимума"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВеличинаПрожиточногоМинимума"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВеличинаПрожиточногоМинимума"

	Дано Я открываю основную форму регистра сведений "ВеличинаПрожиточногоМинимума"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВеличинаПрожиточногоМинимума"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииКлассификаторов" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииКлассификаторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииКлассификаторов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииКлассификаторов"

	Дано Я открываю основную форму регистра сведений "ВерсииКлассификаторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииКлассификаторов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииКлассификаторовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииКлассификаторовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииКлассификаторовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииКлассификаторовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ВерсииКлассификаторовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииКлассификаторовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииОбъектов"

	Дано Я открываю основную форму регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииПодсистем" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииПодсистем"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииПодсистемОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииПодсистемОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаимозависимыеЛица" 

	Дано Я открываю основную форму списка регистра сведений "ВзаимозависимыеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВзаимозависимыеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаимозависимыеЛица"

	Дано Я открываю основную форму регистра сведений "ВзаимозависимыеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВзаимозависимыеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыВремениДляВыявленияНачислений" 

	Дано Я открываю основную форму списка регистра сведений "ВидыВремениДляВыявленияНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыВремениДляВыявленияНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыВремениДляВыявленияНачислений"

	Дано Я открываю основную форму регистра сведений "ВидыВремениДляВыявленияНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыВремениДляВыявленияНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЗанятостиСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ВидыЗанятостиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыЗанятостиСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЗанятостиСотрудников"

	Дано Я открываю основную форму регистра сведений "ВидыЗанятостиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыЗанятостиСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЗанятостиСотрудниковИнтервальный" 

	Дано Я открываю основную форму списка регистра сведений "ВидыЗанятостиСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыЗанятостиСотрудниковИнтервальный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЗанятостиСотрудниковИнтервальный"

	Дано Я открываю основную форму регистра сведений "ВидыЗанятостиСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыЗанятостиСотрудниковИнтервальный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЗанятостиСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ВидыЗанятостиСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыЗанятостиСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЗанятостиСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ВидыЗанятостиСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыЗанятостиСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПродукцииПоГруппамВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ВидыПродукцииПоГруппамВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыПродукцииПоГруппамВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПродукцииПоГруппамВЕТИС"

	Дано Я открываю основную форму регистра сведений "ВидыПродукцииПоГруппамВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыПродукцииПоГруппамВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСтажаТрудовойДеятельностиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ВидыСтажаТрудовойДеятельностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыСтажаТрудовойДеятельностиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСтажаТрудовойДеятельностиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ВидыСтажаТрудовойДеятельностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыСтажаТрудовойДеятельностиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВложенияНеформализованныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ВложенияНеформализованныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВложенияНеформализованныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВложенияНеформализованныхДокументов"

	Дано Я открываю основную форму регистра сведений "ВложенияНеформализованныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВложенияНеформализованныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВоинскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "ВоинскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВоинскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВоинскийУчет"

	Дано Я открываю основную форму регистра сведений "ВоинскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВоинскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам" 

	Дано Я открываю основную форму списка регистра сведений "ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"

	Дано Я открываю основную форму регистра сведений "ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВременныеИдентификаторыЗапросов" 

	Дано Я открываю основную форму списка регистра сведений "ВременныеИдентификаторыЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВременныеИдентификаторыЗапросов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВременныеИдентификаторыЗапросов"

	Дано Я открываю основную форму регистра сведений "ВременныеИдентификаторыЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВременныеИдентификаторыЗапросов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВремяРегистрацииДокументовПлановыхНачислений" 

	Дано Я открываю основную форму списка регистра сведений "ВремяРегистрацииДокументовПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВремяРегистрацииДокументовПлановыхНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВремяРегистрацииДокументовПлановыхНачислений"

	Дано Я открываю основную форму регистра сведений "ВремяРегистрацииДокументовПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВремяРегистрацииДокументовПлановыхНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВсеОбновленияНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ВсеОбновленияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВсеОбновленияНовостей"

	Дано Я открываю основную форму регистра сведений "ВсеОбновленияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВспомогательнаяИнформацияВзаиморасчетов" 

	Дано Я открываю основную форму списка регистра сведений "ВспомогательнаяИнформацияВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВспомогательнаяИнформацияВзаиморасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВспомогательнаяИнформацияВзаиморасчетов"

	Дано Я открываю основную форму регистра сведений "ВспомогательнаяИнформацияВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВспомогательнаяИнформацияВзаиморасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящиеСообщенияСЭДОФСС" 

	Дано Я открываю основную форму списка регистра сведений "ВходящиеСообщенияСЭДОФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВходящиеСообщенияСЭДОФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящиеСообщенияСЭДОФСС"

	Дано Я открываю основную форму регистра сведений "ВходящиеСообщенияСЭДОФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВходящиеСообщенияСЭДОФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыполнениеОперацийЗакрытияМесяца" 

	Дано Я открываю основную форму списка регистра сведений "ВыполнениеОперацийЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыполнениеОперацийЗакрытияМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыполнениеОперацийЗакрытияМесяца"

	Дано Я открываю основную форму регистра сведений "ВыполнениеОперацийЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыполнениеОперацийЗакрытияМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыполнениеПроверокСостоянияСистемы" 

	Дано Я открываю основную форму списка регистра сведений "ВыполнениеПроверокСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыполнениеПроверокСостоянияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыполнениеПроверокСостоянияСистемы"

	Дано Я открываю основную форму регистра сведений "ВыполнениеПроверокСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыполнениеПроверокСостоянияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВычетыПоДоходамНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ВычетыПоДоходамНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВычетыПоДоходамНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВычетыПоДоходамНДФЛ"

	Дано Я открываю основную форму регистра сведений "ВычетыПоДоходамНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВычетыПоДоходамНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВычетыПредыдущегоМестаРаботыНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ВычетыПредыдущегоМестаРаботыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВычетыПредыдущегоМестаРаботыНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВычетыПредыдущегоМестаРаботыНДФЛ"

	Дано Я открываю основную форму регистра сведений "ВычетыПредыдущегоМестаРаботыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВычетыПредыдущегоМестаРаботыНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГражданствоФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ГражданствоФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГражданствоФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГражданствоФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ГражданствоФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГражданствоФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГраницыКонтролируемостиСделок" 

	Дано Я открываю основную форму списка регистра сведений "ГраницыКонтролируемостиСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГраницыКонтролируемостиСделок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГраницыКонтролируемостиСделок"

	Дано Я открываю основную форму регистра сведений "ГраницыКонтролируемостиСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГраницыКонтролируемостиСделок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикиРаботыПоВидамВремени" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикиРаботыПоВидамВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикиРаботыПоВидамВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиРаботыПоВидамВремени"

	Дано Я открываю основную форму регистра сведений "ГрафикиРаботыПоВидамВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикиРаботыПоВидамВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикНачисленийКредитовИДепозитов" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикНачисленийКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикНачисленийКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикНачисленийКредитовИДепозитов"

	Дано Я открываю основную форму регистра сведений "ГрафикНачисленийКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикНачисленийКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикНачисленияПроцентовПоАренде" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикНачисленияПроцентовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикНачисленияПроцентовПоАренде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикНачисленияПроцентовПоАренде"

	Дано Я открываю основную форму регистра сведений "ГрафикНачисленияПроцентовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикНачисленияПроцентовПоАренде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикНачисленияУслугПоАренде" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикНачисленияУслугПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикНачисленияУслугПоАренде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикНачисленияУслугПоАренде"

	Дано Я открываю основную форму регистра сведений "ГрафикНачисленияУслугПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикНачисленияУслугПоАренде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикОплатКредитовИДепозитов" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикОплатКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикОплатКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикОплатКредитовИДепозитов"

	Дано Я открываю основную форму регистра сведений "ГрафикОплатКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикОплатКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикОплатУслугПоАренде" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикОплатУслугПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикОплатУслугПоАренде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикОплатУслугПоАренде"

	Дано Я открываю основную форму регистра сведений "ГрафикОплатУслугПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикОплатУслугПоАренде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикПлатежей" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикПлатежей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикПлатежей"

	Дано Я открываю основную форму регистра сведений "ГрафикПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикПлатежей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикРаботыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикРаботыСотрудников"

	Дано Я открываю основную форму регистра сведений "ГрафикРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикРаботыСотрудниковИнтервальный" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикРаботыСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудниковИнтервальный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикРаботыСотрудниковИнтервальный"

	Дано Я открываю основную форму регистра сведений "ГрафикРаботыСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудниковИнтервальный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикРаботыСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикРаботыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикРаботыСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ГрафикРаботыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикТраншейКредитовИДепозитов" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикТраншейКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикТраншейКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикТраншейКредитовИДепозитов"

	Дано Я открываю основную форму регистра сведений "ГрафикТраншейКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикТраншейКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикЭтаповПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикЭтаповПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикЭтаповПроизводства"

	Дано Я открываю основную форму регистра сведений "ГрафикЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикЭтаповПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикЭтаповПроизводства2_2" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикЭтаповПроизводства2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикЭтаповПроизводства2_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикЭтаповПроизводства2_2"

	Дано Я открываю основную форму регистра сведений "ГрафикЭтаповПроизводства2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикЭтаповПроизводства2_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыЗаявокПлатежногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыЗаявокПлатежногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗаявокПлатежногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыЗаявокПлатежногоКалендаря"

	Дано Я открываю основную форму регистра сведений "ГруппыЗаявокПлатежногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗаявокПлатежногоКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДампыПлатформы" 

	Дано Я открываю основную форму списка регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДампыПлатформы"

	Дано Я открываю основную форму регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеБизнесПроцессов" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеБизнесПроцессов"

	Дано Я открываю основную форму регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеДляПодбораСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеДляПодбораСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеДляПодбораСотрудников"

	Дано Я открываю основную форму регистра сведений "ДанныеДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеДляПодбораСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеКлючаСессииИСМП" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеКлючаСессииИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеКлючаСессииИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеКлючаСессииИСМП"

	Дано Я открываю основную форму регистра сведений "ДанныеКлючаСессииИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеКлючаСессииИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеКонтрагентовСоздаваемыхБезусловно" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеКонтрагентовСоздаваемыхБезусловно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеКонтрагентовСоздаваемыхБезусловно"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеКонтрагентовСоздаваемыхБезусловно"

	Дано Я открываю основную форму регистра сведений "ДанныеКонтрагентовСоздаваемыхБезусловно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеКонтрагентовСоздаваемыхБезусловно"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбОплатеТрудаДляПодбораСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбОплатеТрудаДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбОплатеТрудаДляПодбораСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбОплатеТрудаДляПодбораСотрудников"

	Дано Я открываю основную форму регистра сведений "ДанныеОбОплатеТрудаДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбОплатеТрудаДляПодбораСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбработанныеВЦентральномУзлеРИБ" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбработанныеВЦентральномУзлеРИБ"

	Дано Я открываю основную форму регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбъектовДляРегистрацииВОбменах" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбъектовДляРегистрацииВОбменах"

	Дано Я открываю основную форму регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"

	Дано Я открываю основную форму регистра сведений "ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОВремениДляРасчетаСреднегоФСС" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОВремениДляРасчетаСреднегоФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОВремениДляРасчетаСреднегоФСС"

	Дано Я открываю основную форму регистра сведений "ДанныеОВремениДляРасчетаСреднегоФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОВремениДляРасчетаСреднегоФССИспр" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОВремениДляРасчетаСреднегоФССИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоФССИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОВремениДляРасчетаСреднегоФССИспр"

	Дано Я открываю основную форму регистра сведений "ДанныеОВремениДляРасчетаСреднегоФССИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоФССИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОснованийСчетовФактур" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОснованийСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОснованийСчетовФактур"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОснованийСчетовФактур"

	Дано Я открываю основную форму регистра сведений "ДанныеОснованийСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОснованийСчетовФактур"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПервичныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПервичныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПервичныхДокументов"

	Дано Я открываю основную форму регистра сведений "ДанныеПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПервичныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПоКонтрагентамКонтролируемыхСделок" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПоКонтрагентамКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПоКонтрагентамКонтролируемыхСделок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПоКонтрагентамКонтролируемыхСделок"

	Дано Я открываю основную форму регистра сведений "ДанныеПоКонтрагентамКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПоКонтрагентамКонтролируемыхСделок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПоследнихОповещений" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПоследнихОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПоследнихОповещений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПоследнихОповещений"

	Дано Я открываю основную форму регистра сведений "ДанныеПоследнихОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПоследнихОповещений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПроизводственногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПроизводственногоКалендаря"

	Дано Я открываю основную форму регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПроизводственногоКалендаряПомесячно" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПроизводственногоКалендаряПомесячно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаряПомесячно"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПроизводственногоКалендаряПомесячно"

	Дано Я открываю основную форму регистра сведений "ДанныеПроизводственногоКалендаряПомесячно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаряПомесячно"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеСостоянийСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеСостоянийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеСостоянийСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеСостоянийСотрудников"

	Дано Я открываю основную форму регистра сведений "ДанныеСостоянийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеСостоянийСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеСостоянийСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеСостоянийСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеСостоянийСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеСостоянийСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ДанныеСостоянийСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеСостоянийСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатаЗагрузкиОтчетовКассЭвотор" 

	Дано Я открываю основную форму списка регистра сведений "ДатаЗагрузкиОтчетовКассЭвотор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатаЗагрузкиОтчетовКассЭвотор"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатаЗагрузкиОтчетовКассЭвотор"

	Дано Я открываю основную форму регистра сведений "ДатаЗагрузкиОтчетовКассЭвотор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатаЗагрузкиОтчетовКассЭвотор"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыВступленияВСилуНА" 

	Дано Я открываю основную форму списка регистра сведений "ДатыВступленияВСилуНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыВступленияВСилуНА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыВступленияВСилуНА"

	Дано Я открываю основную форму регистра сведений "ДатыВступленияВСилуНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыВступленияВСилуНА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыЗагрузкиПоследнихНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗагрузкиПоследнихНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗагрузкиПоследнихНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыЗагрузкиПоследнихНовостей"

	Дано Я открываю основную форму регистра сведений "ДатыЗагрузкиПоследнихНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗагрузкиПоследнихНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыЗапретаИзменения" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыЗапретаФормированияПроводокМеждународныйУчет" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗапретаФормированияПроводокМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаФормированияПроводокМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыЗапретаФормированияПроводокМеждународныйУчет"

	Дано Я открываю основную форму регистра сведений "ДатыЗапретаФормированияПроводокМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаФормированияПроводокМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыОбновленияСтандартныхСписковНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ДатыОбновленияСтандартныхСписковНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОбновленияСтандартныхСписковНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыОбновленияСтандартныхСписковНовостей"

	Дано Я открываю основную форму регистра сведений "ДатыОбновленияСтандартныхСписковНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОбновленияСтандартныхСписковНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыОтработкиПоВидамОповещений" 

	Дано Я открываю основную форму списка регистра сведений "ДатыОтработкиПоВидамОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОтработкиПоВидамОповещений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыОтработкиПоВидамОповещений"

	Дано Я открываю основную форму регистра сведений "ДатыОтработкиПоВидамОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОтработкиПоВидамОповещений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыПередачиТоваровНаКомиссию" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПередачиТоваровНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПередачиТоваровНаКомиссию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыПередачиТоваровНаКомиссию"

	Дано Я открываю основную форму регистра сведений "ДатыПередачиТоваровНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПередачиТоваровНаКомиссию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыПоследнейЗагрузкиПочтовыхСообщений" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыПоследнейЗагрузкиПочтовыхСообщений"

	Дано Я открываю основную форму регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыПоступленияТоваровОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПоступленияТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоступленияТоваровОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыПоступленияТоваровОрганизаций"

	Дано Я открываю основную форму регистра сведений "ДатыПоступленияТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоступленияТоваровОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвоичныеДанныеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвоичныеДанныеФайлов"

	Дано Я открываю основную форму регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДействиеСкидокНаценок" 

	Дано Я открываю основную форму списка регистра сведений "ДействиеСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДействиеСкидокНаценок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДействиеСкидокНаценок"

	Дано Я открываю основную форму регистра сведений "ДействиеСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДействиеСкидокНаценок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДействиеСкидокНаценокПоНоменклатуре" 

	Дано Я открываю основную форму списка регистра сведений "ДействиеСкидокНаценокПоНоменклатуре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДействиеСкидокНаценокПоНоменклатуре"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДействиеСкидокНаценокПоНоменклатуре"

	Дано Я открываю основную форму регистра сведений "ДействиеСкидокНаценокПоНоменклатуре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДействиеСкидокНаценокПоНоменклатуре"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДетализацияСебестоимостиТоваров" 

	Дано Я открываю основную форму списка регистра сведений "ДетализацияСебестоимостиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДетализацияСебестоимостиТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДетализацияСебестоимостиТоваров"

	Дано Я открываю основную форму регистра сведений "ДетализацияСебестоимостиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДетализацияСебестоимостиТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДетализацияСебестоимостиТоваровПостатейныеЗатраты" 

	Дано Я открываю основную форму списка регистра сведений "ДетализацияСебестоимостиТоваровПостатейныеЗатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДетализацияСебестоимостиТоваровПостатейныеЗатраты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДетализацияСебестоимостиТоваровПостатейныеЗатраты"

	Дано Я открываю основную форму регистра сведений "ДетализацияСебестоимостиТоваровПостатейныеЗатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДетализацияСебестоимостиТоваровПостатейныеЗатраты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП" 

	Дано Я открываю основную форму списка регистра сведений "ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП"

	Дано Я открываю основную форму регистра сведений "ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДлительностьПереналадки" 

	Дано Я открываю основную форму списка регистра сведений "ДлительностьПереналадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДлительностьПереналадки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДлительностьПереналадки"

	Дано Я открываю основную форму регистра сведений "ДлительностьПереналадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДлительностьПереналадки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыУчастниковКонтролируемыхСделок" 

	Дано Я открываю основную форму списка регистра сведений "ДоговорыУчастниковКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоговорыУчастниковКонтролируемыхСделок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыУчастниковКонтролируемыхСделок"

	Дано Я открываю основную форму регистра сведений "ДоговорыУчастниковКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоговорыУчастниковКонтролируемыхСделок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыОплаченныеБезУдержанияНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыОплаченныеБезУдержанияНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыОплаченныеБезУдержанияНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыОплаченныеБезУдержанияНДФЛ"

	Дано Я открываю основную форму регистра сведений "ДокументыОплаченныеБезУдержанияНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыОплаченныеБезУдержанияНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыПоВыпущеннойПродукции" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыПоВыпущеннойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоВыпущеннойПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыПоВыпущеннойПродукции"

	Дано Я открываю основную форму регистра сведений "ДокументыПоВыпущеннойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоВыпущеннойПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыПоНМА" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыПоНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыПоНМА"

	Дано Я открываю основную форму регистра сведений "ДокументыПоНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыПоОС" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыПоОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыПоОС"

	Дано Я открываю основную форму регистра сведений "ДокументыПоОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыПоТребованиюФНС" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыПоТребованиюФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоТребованиюФНС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыПоТребованиюФНС"

	Дано Я открываю основную форму регистра сведений "ДокументыПоТребованиюФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоТребованиюФНС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыСОшибкамиПроверкиКонтрагентов" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыСОшибкамиПроверкиКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыСОшибкамиПроверкиКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыСОшибкамиПроверкиКонтрагентов"

	Дано Я открываю основную форму регистра сведений "ДокументыСОшибкамиПроверкиКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыСОшибкамиПроверкиКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыСреднегоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыСреднегоЗаработка"

	Дано Я открываю основную форму регистра сведений "ДокументыСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыУчтенныеПриРасчетеНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыУчтенныеПриРасчетеНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыУчтенныеПриРасчетеНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыУчтенныеПриРасчетеНДФЛ"

	Дано Я открываю основную форму регистра сведений "ДокументыУчтенныеПриРасчетеНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыУчтенныеПриРасчетеНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ДокументыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДолжностиПодключаемыеХарактеристики" 

	Дано Я открываю основную форму списка регистра сведений "ДолжностиПодключаемыеХарактеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДолжностиПодключаемыеХарактеристики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДолжностиПодключаемыеХарактеристики"

	Дано Я открываю основную форму регистра сведений "ДолжностиПодключаемыеХарактеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДолжностиПодключаемыеХарактеристики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДолиСписанияКосвенныхРасходов" 

	Дано Я открываю основную форму списка регистра сведений "ДолиСписанияКосвенныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДолиСписанияКосвенныхРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДолиСписанияКосвенныхРасходов"

	Дано Я открываю основную форму регистра сведений "ДолиСписанияКосвенныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДолиСписанияКосвенныхРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДомаЗданияСтроения" 

	Дано Я открываю основную форму списка регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДомаЗданияСтроения"

	Дано Я открываю основную форму регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеНастройкиЗарплатаКадры" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеНастройкиЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеНастройкиЗарплатаКадры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеНастройкиЗарплатаКадры"

	Дано Я открываю основную форму регистра сведений "ДополнительныеНастройкиЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеНастройкиЗарплатаКадры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеРеквизитыУчетнойЗаписи" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеРеквизитыУчетнойЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеРеквизитыУчетнойЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеРеквизитыУчетнойЗаписи"

	Дано Я открываю основную форму регистра сведений "ДополнительныеРеквизитыУчетнойЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеРеквизитыУчетнойЗаписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеРеквизитыУчетнойЗаписиПолучатели" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеРеквизитыУчетнойЗаписиПолучатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеРеквизитыУчетнойЗаписиПолучатели"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеРеквизитыУчетнойЗаписиПолучатели"

	Дано Я открываю основную форму регистра сведений "ДополнительныеРеквизитыУчетнойЗаписиПолучатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеРеквизитыУчетнойЗаписиПолучатели"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеФайлыРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеФайлыРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеФайлыРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеФайлыРегламентированныхОтчетов"

	Дано Я открываю основную форму регистра сведений "ДополнительныеФайлыРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеФайлыРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДопустимыеСочетанияКодовГруппСтажа" 

	Дано Я открываю основную форму списка регистра сведений "ДопустимыеСочетанияКодовГруппСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеСочетанияКодовГруппСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДопустимыеСочетанияКодовГруппСтажа"

	Дано Я открываю основную форму регистра сведений "ДопустимыеСочетанияКодовГруппСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеСочетанияКодовГруппСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДопустимыеЦелиПоГруппамВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ДопустимыеЦелиПоГруппамВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеЦелиПоГруппамВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДопустимыеЦелиПоГруппамВЕТИС"

	Дано Я открываю основную форму регистра сведений "ДопустимыеЦелиПоГруппамВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеЦелиПоГруппамВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступностьРабочихЦентров" 

	Дано Я открываю основную форму списка регистра сведений "ДоступностьРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступностьРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступностьРабочихЦентров"

	Дано Я открываю основную форму регистра сведений "ДоступностьРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступностьРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступностьТоваровДляВнешнихПользователей" 

	Дано Я открываю основную форму списка регистра сведений "ДоступностьТоваровДляВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступностьТоваровДляВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступностьТоваровДляВнешнихПользователей"

	Дано Я открываю основную форму регистра сведений "ДоступностьТоваровДляВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступностьТоваровДляВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступныеДляРедактированияРеквизитыДокументовEDI" 

	Дано Я открываю основную форму списка регистра сведений "ДоступныеДляРедактированияРеквизитыДокументовEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеДляРедактированияРеквизитыДокументовEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступныеДляРедактированияРеквизитыДокументовEDI"

	Дано Я открываю основную форму регистра сведений "ДоступныеДляРедактированияРеквизитыДокументовEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеДляРедактированияРеквизитыДокументовEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступныеЛицензии" 

	Дано Я открываю основную форму списка регистра сведений "ДоступныеЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеЛицензии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступныеЛицензии"

	Дано Я открываю основную форму регистра сведений "ДоступныеЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеЛицензии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоходыПредыдущегоМестаРаботыНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ДоходыПредыдущегоМестаРаботыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоходыПредыдущегоМестаРаботыНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоходыПредыдущегоМестаРаботыНДФЛ"

	Дано Я открываю основную форму регистра сведений "ДоходыПредыдущегоМестаРаботыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоходыПредыдущегоМестаРаботыНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналДействийПоЭДО" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналДействийПоЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналДействийПоЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналДействийПоЭДО"

	Дано Я открываю основную форму регистра сведений "ЖурналДействийПоЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналДействийПоЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналЗапросовКСерверамФСС" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналЗапросовКСерверамФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналЗапросовКСерверамФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналЗапросовКСерверамФСС"

	Дано Я открываю основную форму регистра сведений "ЖурналЗапросовКСерверамФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналЗапросовКСерверамФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналНовыхСобытий" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналНовыхСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналНовыхСобытий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналНовыхСобытий"

	Дано Я открываю основную форму регистра сведений "ЖурналНовыхСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналНовыхСобытий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналНовыхСобытийОбменаСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналНовыхСобытийОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналНовыхСобытийОбменаСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналНовыхСобытийОбменаСБанками"

	Дано Я открываю основную форму регистра сведений "ЖурналНовыхСобытийОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналНовыхСобытийОбменаСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналОперацийСФайламиОбменаСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналОперацийСФайламиОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОперацийСФайламиОбменаСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналОперацийСФайламиОбменаСБанками"

	Дано Я открываю основную форму регистра сведений "ЖурналОперацийСФайламиОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОперацийСФайламиОбменаСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналОтправокВКонтролирующиеОрганы" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналОтправокВКонтролирующиеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОтправокВКонтролирующиеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналОтправокВКонтролирующиеОрганы"

	Дано Я открываю основную форму регистра сведений "ЖурналОтправокВКонтролирующиеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОтправокВКонтролирующиеОрганы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналОтчетовСтатусы" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналОтчетовСтатусы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОтчетовСтатусы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналОтчетовСтатусы"

	Дано Я открываю основную форму регистра сведений "ЖурналОтчетовСтатусы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОтчетовСтатусы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналПереданнойОтчетностиВБанк" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналПереданнойОтчетностиВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналПереданнойОтчетностиВБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналПереданнойОтчетностиВБанк"

	Дано Я открываю основную форму регистра сведений "ЖурналПереданнойОтчетностиВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналПереданнойОтчетностиВБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналПередачиОтчетностиВБанк" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналПередачиОтчетностиВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналПередачиОтчетностиВБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналПередачиОтчетностиВБанк"

	Дано Я открываю основную форму регистра сведений "ЖурналПередачиОтчетностиВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналПередачиОтчетностиВБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналСобытийОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналСобытийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСобытийОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналСобытийОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ЖурналСобытийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСобытийОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналСтатусовФинОтчетностиВБанки" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналСтатусовФинОтчетностиВБанки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСтатусовФинОтчетностиВБанки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналСтатусовФинОтчетностиВБанки"

	Дано Я открываю основную форму регистра сведений "ЖурналСтатусовФинОтчетностиВБанки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСтатусовФинОтчетностиВБанки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналУчетаСчетовФактур" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналУчетаСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналУчетаСчетовФактур"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналУчетаСчетовФактур"

	Дано Я открываю основную форму регистра сведений "ЖурналУчетаСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналУчетаСчетовФактур"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналФискальныхОпераций" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналФискальныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналФискальныхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналФискальныхОпераций"

	Дано Я открываю основную форму регистра сведений "ЖурналФискальныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналФискальныхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаблокированныеДляПолученияУчетныеЗаписи" 

	Дано Я открываю основную форму списка регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаблокированныеДляПолученияУчетныеЗаписи"

	Дано Я открываю основную форму регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗависимостиНачисленийПоФПД" 

	Дано Я открываю основную форму списка регистра сведений "ЗависимостиНачисленийПоФПД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиНачисленийПоФПД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗависимостиНачисленийПоФПД"

	Дано Я открываю основную форму регистра сведений "ЗависимостиНачисленийПоФПД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиНачисленийПоФПД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗависимостиПравДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗависимостиПравДоступа"

	Дано Я открываю основную форму регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗагруженныеВерсииАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗагруженныеВерсииАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКЗакрытиюМесяца" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКЗакрытиюМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКЗакрытиюМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКЗакрытиюМесяца"

	Дано Я открываю основную форму регистра сведений "ЗаданияКЗакрытиюМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКЗакрытиюМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКОбработкеЭтаповПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКОбработкеЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКОбработкеЭтаповПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКОбработкеЭтаповПроизводства"

	Дано Я открываю основную форму регистра сведений "ЗаданияКОбработкеЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКОбработкеЭтаповПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКОтражениюВБюджетировании" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКОтражениюВБюджетировании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКОтражениюВБюджетировании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКОтражениюВБюджетировании"

	Дано Я открываю основную форму регистра сведений "ЗаданияКОтражениюВБюджетировании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКОтражениюВБюджетировании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКОтражениюЭкземпляровБюджета" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКОтражениюЭкземпляровБюджета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКОтражениюЭкземпляровБюджета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКОтражениюЭкземпляровБюджета"

	Дано Я открываю основную форму регистра сведений "ЗаданияКОтражениюЭкземпляровБюджета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКОтражениюЭкземпляровБюджета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКПогашениюСтоимостиТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКПогашениюСтоимостиТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКПогашениюСтоимостиТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКПогашениюСтоимостиТМЦВЭксплуатации"

	Дано Я открываю основную форму регистра сведений "ЗаданияКПогашениюСтоимостиТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКПогашениюСтоимостиТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРаспределениюЗапасов" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРаспределениюЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРаспределениюЗапасов"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРаспределениюЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРаспределениюРасчетов" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРаспределениюРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРаспределениюРасчетов"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРаспределениюРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРаспределениюРасчетовСКлиентами" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРаспределениюРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетовСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРаспределениюРасчетовСКлиентами"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРаспределениюРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетовСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРаспределениюРасчетовСПоставщиками" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРаспределениюРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетовСПоставщиками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРаспределениюРасчетовСПоставщиками"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРаспределениюРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетовСПоставщиками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРасчетуАмортизацииНМА" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРасчетуАмортизацииНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуАмортизацииНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРасчетуАмортизацииНМА"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРасчетуАмортизацииНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуАмортизацииНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРасчетуАмортизацииОС" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРасчетуАмортизацииОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуАмортизацииОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРасчетуАмортизацииОС"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРасчетуАмортизацииОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуАмортизацииОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРасчетуГрафикаПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРасчетуГрафикаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуГрафикаПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРасчетуГрафикаПроизводства"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРасчетуГрафикаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуГрафикаПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРасчетуДлительностиПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРасчетуДлительностиПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуДлительностиПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРасчетуДлительностиПроизводства"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРасчетуДлительностиПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуДлительностиПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРасчетуНормативногоГрафикаПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРасчетуНормативногоГрафикаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуНормативногоГрафикаПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРасчетуНормативногоГрафикаПроизводства"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРасчетуНормативногоГрафикаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуНормативногоГрафикаПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРасчетуОчередиПроизводственныхОпераций" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРасчетуОчередиПроизводственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуОчередиПроизводственныхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРасчетуОчередиПроизводственныхОпераций"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРасчетуОчередиПроизводственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуОчередиПроизводственныхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРасчетуСебестоимости" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРасчетуСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуСебестоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРасчетуСебестоимости"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРасчетуСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуСебестоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРасчетуСтоимостиВНА" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРасчетуСтоимостиВНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуСтоимостиВНА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРасчетуСтоимостиВНА"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРасчетуСтоимостиВНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуСтоимостиВНА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКФормированиюДвиженийПоВНА" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКФормированиюДвиженийПоВНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКФормированиюДвиженийПоВНА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКФормированиюДвиженийПоВНА"

	Дано Я открываю основную форму регистра сведений "ЗаданияКФормированиюДвиженийПоВНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКФормированиюДвиженийПоВНА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКФормированиюДвиженийПоНДС" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКФормированиюДвиженийПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКФормированиюДвиженийПоНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКФормированиюДвиженийПоНДС"

	Дано Я открываю основную форму регистра сведений "ЗаданияКФормированиюДвиженийПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКФормированиюДвиженийПоНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыПоставщикамПоЗапросамКоммерческихПредложений" 

	Дано Я открываю основную форму списка регистра сведений "ЗаказыПоставщикамПоЗапросамКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаказыПоставщикамПоЗапросамКоммерческихПредложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыПоставщикамПоЗапросамКоммерческихПредложений"

	Дано Я открываю основную форму регистра сведений "ЗаказыПоставщикамПоЗапросамКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаказыПоставщикамПоЗапросамКоммерческихПредложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыВремени" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыВремени"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыВремениТехнологические" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыВремениТехнологические"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыКомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыКомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамещениеПланов" 

	Дано Я открываю основную форму списка регистра сведений "ЗамещениеПланов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамещениеПланов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамещениеПланов"

	Дано Я открываю основную форму регистра сведений "ЗамещениеПланов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамещениеПланов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗанятостьПозицийШтатногоРасписания" 

	Дано Я открываю основную форму списка регистра сведений "ЗанятостьПозицийШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятостьПозицийШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗанятостьПозицийШтатногоРасписания"

	Дано Я открываю основную форму регистра сведений "ЗанятостьПозицийШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятостьПозицийШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗанятостьПозицийШтатногоРасписанияИнтервальный" 

	Дано Я открываю основную форму списка регистра сведений "ЗанятостьПозицийШтатногоРасписанияИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятостьПозицийШтатногоРасписанияИнтервальный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗанятостьПозицийШтатногоРасписанияИнтервальный"

	Дано Я открываю основную форму регистра сведений "ЗанятостьПозицийШтатногоРасписанияИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятостьПозицийШтатногоРасписанияИнтервальный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗанятостьПозицийШтатногоРасписанияИспр" 

	Дано Я открываю основную форму списка регистра сведений "ЗанятостьПозицийШтатногоРасписанияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятостьПозицийШтатногоРасписанияИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗанятостьПозицийШтатногоРасписанияИспр"

	Дано Я открываю основную форму регистра сведений "ЗанятостьПозицийШтатногоРасписанияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятостьПозицийШтатногоРасписанияИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗанятыеЛицензии" 

	Дано Я открываю основную форму списка регистра сведений "ЗанятыеЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятыеЛицензии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗанятыеЛицензии"

	Дано Я открываю основную форму регистра сведений "ЗанятыеЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятыеЛицензии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиОСтажеДоНачалаЭксплуатации" 

	Дано Я открываю основную форму списка регистра сведений "ЗаписиОСтажеДоНачалаЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиОСтажеДоНачалаЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиОСтажеДоНачалаЭксплуатации"

	Дано Я открываю основную форму регистра сведений "ЗаписиОСтажеДоНачалаЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиОСтажеДоНачалаЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиОСтажеСведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ" 

	Дано Я открываю основную форму списка регистра сведений "ЗаписиОСтажеСведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиОСтажеСведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиОСтажеСведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"

	Дано Я открываю основную форму регистра сведений "ЗаписиОСтажеСведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиОСтажеСведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиСкладскогоЖурналаВРезервеВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ЗаписиСкладскогоЖурналаВРезервеВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиСкладскогоЖурналаВРезервеВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиСкладскогоЖурналаВРезервеВЕТИС"

	Дано Я открываю основную форму регистра сведений "ЗаписиСкладскогоЖурналаВРезервеВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиСкладскогоЖурналаВРезервеВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиСкладскогоЖурналаКПередачеВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ЗаписиСкладскогоЖурналаКПередачеВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиСкладскогоЖурналаКПередачеВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиСкладскогоЖурналаКПередачеВЕТИС"

	Дано Я открываю основную форму регистра сведений "ЗаписиСкладскогоЖурналаКПередачеВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиСкладскогоЖурналаКПередачеВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированныеДействияСПечатнымиФормами" 

	Дано Я открываю основную форму списка регистра сведений "ЗапланированныеДействияСПечатнымиФормами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапланированныеДействияСПечатнымиФормами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапланированныеДействияСПечатнымиФормами"

	Дано Я открываю основную форму регистра сведений "ЗапланированныеДействияСПечатнымиФормами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапланированныеДействияСПечатнымиФормами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапущенныеОбработчикиОчередиЗаданий" 

	Дано Я открываю основную форму списка регистра сведений "ЗапущенныеОбработчикиОчередиЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапущенныеОбработчикиОчередиЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапущенныеОбработчикиОчередиЗаданий"

	Дано Я открываю основную форму регистра сведений "ЗапущенныеОбработчикиОчередиЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапущенныеОбработчикиОчередиЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаработанныеПраваНаОтпуска" 

	Дано Я открываю основную форму списка регистра сведений "ЗаработанныеПраваНаОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаработанныеПраваНаОтпуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаработанныеПраваНаОтпуска"

	Дано Я открываю основную форму регистра сведений "ЗаработанныеПраваНаОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаработанныеПраваНаОтпуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗарплатаКадрыДолиСписанияКосвенныхРасходов" 

	Дано Я открываю основную форму списка регистра сведений "ЗарплатаКадрыДолиСписанияКосвенныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗарплатаКадрыДолиСписанияКосвенныхРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗарплатаКадрыДолиСписанияКосвенныхРасходов"

	Дано Я открываю основную форму регистра сведений "ЗарплатаКадрыДолиСписанияКосвенныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗарплатаКадрыДолиСписанияКосвенныхРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявленияОВеденииТрудовыхКнижек" 

	Дано Я открываю основную форму списка регистра сведений "ЗаявленияОВеденииТрудовыхКнижек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявленияОВеденииТрудовыхКнижек"

	Дано Я открываю основную форму регистра сведений "ЗаявленияОВеденииТрудовыхКнижек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявленияОВеденииТрудовыхКнижекИспр" 

	Дано Я открываю основную форму списка регистра сведений "ЗаявленияОВеденииТрудовыхКнижекИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижекИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявленияОВеденииТрудовыхКнижекИспр"

	Дано Я открываю основную форму регистра сведений "ЗаявленияОВеденииТрудовыхКнижекИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижекИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявленияОВеденииТрудовыхКнижекОтозванные" 

	Дано Я открываю основную форму списка регистра сведений "ЗаявленияОВеденииТрудовыхКнижекОтозванные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижекОтозванные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявленияОВеденииТрудовыхКнижекОтозванные"

	Дано Я открываю основную форму регистра сведений "ЗаявленияОВеденииТрудовыхКнижекОтозванные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижекОтозванные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявленияОВеденииТрудовыхКнижекПереданные" 

	Дано Я открываю основную форму списка регистра сведений "ЗаявленияОВеденииТрудовыхКнижекПереданные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижекПереданные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявленияОВеденииТрудовыхКнижекПереданные"

	Дано Я открываю основную форму регистра сведений "ЗаявленияОВеденииТрудовыхКнижекПереданные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижекПереданные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявленияОВеденииТрудовыхКнижекПереданныеИспр" 

	Дано Я открываю основную форму списка регистра сведений "ЗаявленияОВеденииТрудовыхКнижекПереданныеИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижекПереданныеИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявленияОВеденииТрудовыхКнижекПереданныеИспр"

	Дано Я открываю основную форму регистра сведений "ЗаявленияОВеденииТрудовыхКнижекПереданныеИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаявленияОВеденииТрудовыхКнижекПереданныеИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗемельныеУчастки" 

	Дано Я открываю основную форму списка регистра сведений "ЗемельныеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗемельныеУчастки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗемельныеУчастки"

	Дано Я открываю основную форму регистра сведений "ЗемельныеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗемельныеУчастки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗнаниеЯзыковФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ЗнаниеЯзыковФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗнаниеЯзыковФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗнаниеЯзыковФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ЗнаниеЯзыковФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗнаниеЯзыковФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияБазовыхТарифов" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияБазовыхТарифов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияБазовыхТарифов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияБазовыхТарифов"

	Дано Я открываю основную форму регистра сведений "ЗначенияБазовыхТарифов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияБазовыхТарифов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияГруппДоступаПоУмолчанию" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступаПоУмолчанию"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияКатегорийДляОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияКатегорийДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийДляОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийДляОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ЗначенияКатегорийДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийДляОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияКатегорийОбщие" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияКатегорийОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийОбщие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийОбщие"

	Дано Я открываю основную форму регистра сведений "ЗначенияКатегорийОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийОбщие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияКатегорийПользовательские" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияКатегорийПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийПользовательские"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийПользовательские"

	Дано Я открываю основную форму регистра сведений "ЗначенияКатегорийПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийПользовательские"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияНемонетарныхПоказателей" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияНемонетарныхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияНемонетарныхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияНемонетарныхПоказателей"

	Дано Я открываю основную форму регистра сведений "ЗначенияНемонетарныхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияНемонетарныхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияНефинансовыхПоказателей" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияНефинансовыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияНефинансовыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияНефинансовыхПоказателей"

	Дано Я открываю основную форму регистра сведений "ЗначенияНефинансовыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияНефинансовыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПараметровНазначенияСпецификаций" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПараметровНазначенияСпецификаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПараметровНазначенияСпецификаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПараметровНазначенияСпецификаций"

	Дано Я открываю основную форму регистра сведений "ЗначенияПараметровНазначенияСпецификаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПараметровНазначенияСпецификаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"

	Дано Я открываю основную форму регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный"

	Дано Я открываю основную форму регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейДляРаспределенияРасходов" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейДляРаспределенияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейДляРаспределенияРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейДляРаспределенияРасходов"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейДляРаспределенияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейДляРаспределенияРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейНачислений" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейНачислений"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейУдержаний" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейУдержаний"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"

	Дано Я открываю основную форму регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСтроковыхРеквизитов" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияСтроковыхРеквизитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияСтроковыхРеквизитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСтроковыхРеквизитов"

	Дано Я открываю основную форму регистра сведений "ЗначенияСтроковыхРеквизитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияСтроковыхРеквизитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияТарифов" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияТарифов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияТарифов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияТарифов"

	Дано Я открываю основную форму регистра сведений "ЗначенияТарифов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияТарифов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗоныДоставкиКурьеров" 

	Дано Я открываю основную форму списка регистра сведений "ЗоныДоставкиКурьеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗоныДоставкиКурьеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗоныДоставкиКурьеров"

	Дано Я открываю основную форму регистра сведений "ЗоныДоставкиКурьеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗоныДоставкиКурьеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыДокументовНаРаботаВРоссии" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыДокументовНаРаботаВРоссии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыДокументовНаРаботаВРоссии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыДокументовНаРаботаВРоссии"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыДокументовНаРаботаВРоссии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыДокументовНаРаботаВРоссии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыЗапросовНаПодключение" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыЗапросовНаПодключение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыЗапросовНаПодключение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыЗапросовНаПодключение"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыЗапросовНаПодключение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыЗапросовНаПодключение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыПолученныхЭлектронныхПисем" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыПолученныхЭлектронныхПисем"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификационныеДанныеПользователей" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификационныеДанныеПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификационныеДанныеПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификационныеДанныеПользователей"

	Дано Я открываю основную форму регистра сведений "ИдентификационныеДанныеПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификационныеДанныеПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИерархияПартнеров" 

	Дано Я открываю основную форму списка регистра сведений "ИерархияПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИерархияПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИерархияПартнеров"

	Дано Я открываю основную форму регистра сведений "ИерархияПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИерархияПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеСведенийФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ИзменениеСведенийФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзменениеСведенийФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеСведенийФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ИзменениеСведенийФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзменениеСведенийФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзмененияДанныхГрафикаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияДанныхГрафикаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияДанныхГрафикаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияДанныхГрафикаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ИзмененияДанныхГрафикаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияДанныхГрафикаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзмененияДляСервисаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияДляСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияДляСервисаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияДляСервисаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ИзмененияДляСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияДляСервисаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзмененияДокументовДляСервисаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияДокументовДляСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияДокументовДляСервисаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияДокументовДляСервисаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ИзмененияДокументовДляСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияДокументовДляСервисаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзмененияЗаявокДляСервисаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияЗаявокДляСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияЗаявокДляСервисаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияЗаявокДляСервисаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ИзмененияЗаявокДляСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияЗаявокДляСервисаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзмененияОбщихДанныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияОбщихДанныхУзлов"

	Дано Я открываю основную форму регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзображенияТорговойПлощадки" 

	Дано Я открываю основную форму списка регистра сведений "ИзображенияТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзображенияТорговойПлощадки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзображенияТорговойПлощадки"

	Дано Я открываю основную форму регистра сведений "ИзображенияТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзображенияТорговойПлощадки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндексыСПАРКРиски" 

	Дано Я открываю основную форму списка регистра сведений "ИндексыСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИндексыСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндексыСПАРКРиски"

	Дано Я открываю основную форму регистра сведений "ИндексыСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИндексыСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнформативныеЦеныНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "ИнформативныеЦеныНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнформативныеЦеныНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнформативныеЦеныНоменклатуры"

	Дано Я открываю основную форму регистра сведений "ИнформативныеЦеныНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнформативныеЦеныНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнцидентыОткрытые" 

	Дано Я открываю основную форму списка регистра сведений "ИнцидентыОткрытые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОткрытые"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнцидентыОткрытые"

	Дано Я открываю основную форму регистра сведений "ИнцидентыОткрытые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОткрытые"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнцидентыОтложенныеПроверки" 

	Дано Я открываю основную форму списка регистра сведений "ИнцидентыОтложенныеПроверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОтложенныеПроверки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнцидентыОтложенныеПроверки"

	Дано Я открываю основную форму регистра сведений "ИнцидентыОтложенныеПроверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОтложенныеПроверки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсключенныеИзОбработкиСертификаты" 

	Дано Я открываю основную форму списка регистра сведений "ИсключенныеИзОбработкиСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсключенныеИзОбработкиСертификаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсключенныеИзОбработкиСертификаты"

	Дано Я открываю основную форму регистра сведений "ИсключенныеИзОбработкиСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсключенныеИзОбработкиСертификаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсключенныеИзОбработкиТранспортныеСообщения" 

	Дано Я открываю основную форму списка регистра сведений "ИсключенныеИзОбработкиТранспортныеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсключенныеИзОбработкиТранспортныеСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсключенныеИзОбработкиТранспортныеСообщения"

	Дано Я открываю основную форму регистра сведений "ИсключенныеИзОбработкиТранспортныеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсключенныеИзОбработкиТранспортныеСообщения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсполнителиЗадач" 

	Дано Я открываю основную форму списка регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсполнителиЗадач"

	Дано Я открываю основную форму регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"

	Дано Я открываю основную форму регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"

	Дано Я открываю основную форму регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеПоставляемыхРасширенийВОбластяхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеПоставляемыхРасширенийВОбластяхДанных"

	Дано Я открываю основную форму регистра сведений "ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользуемаяФункциональностьСервисаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ИспользуемаяФункциональностьСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользуемаяФункциональностьСервисаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользуемаяФункциональностьСервисаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ИспользуемаяФункциональностьСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользуемаяФункциональностьСервисаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользуемыеВидыДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ИспользуемыеВидыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользуемыеВидыДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользуемыеВидыДоступа"

	Дано Я открываю основную форму регистра сведений "ИспользуемыеВидыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользуемыеВидыДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользуемыеВидыДоступаПоТаблицам" 

	Дано Я открываю основную форму списка регистра сведений "ИспользуемыеВидыДоступаПоТаблицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользуемыеВидыДоступаПоТаблицам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользуемыеВидыДоступаПоТаблицам"

	Дано Я открываю основную форму регистра сведений "ИспользуемыеВидыДоступаПоТаблицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользуемыеВидыДоступаПоТаблицам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияЕжегодныхОтпусковПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияЗапускаЗаданийОчереди" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияЗапускаЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияЗапускаЗаданийОчереди"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияЗапускаЗаданийОчереди"

	Дано Я открываю основную форму регистра сведений "ИсторияЗапускаЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияЗапускаЗаданийОчереди"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияИзмененияФорматовМагазинов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияИзмененияФорматовМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИзмененияФорматовМагазинов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияИзмененияФорматовМагазинов"

	Дано Я открываю основную форму регистра сведений "ИсторияИзмененияФорматовМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИзмененияФорматовМагазинов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияИспользованияШтатногоРасписания" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияИспользованияШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИспользованияШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияИспользованияШтатногоРасписания"

	Дано Я открываю основную форму регистра сведений "ИсторияИспользованияШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИспользованияШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияНачисленийПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияНачисленийПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияНачисленийПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияНачисленийПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияНачисленийПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияНачисленийПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияПодарочныхСертификатов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияПодарочныхСертификатов"

	Дано Я открываю основную форму регистра сведений "ИсторияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияПоказателейПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияПоказателейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияПоказателейПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияПоказателейПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияПоказателейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияПоказателейПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияРегистрацийВНалоговомОргане" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияРегистрацийВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВНалоговомОргане"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияРегистрацийВНалоговомОргане"

	Дано Я открываю основную форму регистра сведений "ИсторияРегистрацийВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВНалоговомОргане"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияРегистрацийВНалоговомОрганеВторичный" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияРегистрацийВНалоговомОрганеВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВНалоговомОрганеВторичный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияРегистрацийВНалоговомОрганеВторичный"

	Дано Я открываю основную форму регистра сведений "ИсторияРегистрацийВНалоговомОрганеВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВНалоговомОрганеВторичный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияРегистрацийВОрганеПФР" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияРегистрацийВОрганеПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВОрганеПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияРегистрацийВОрганеПФР"

	Дано Я открываю основную форму регистра сведений "ИсторияРегистрацийВОрганеПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВОрганеПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияСамостоятельныхКлассификационныхЕдиниц" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияСамостоятельныхКлассификационныхЕдиниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияСамостоятельныхКлассификационныхЕдиниц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияСамостоятельныхКлассификационныхЕдиниц"

	Дано Я открываю основную форму регистра сведений "ИсторияСамостоятельныхКлассификационныхЕдиниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияСамостоятельныхКлассификационныхЕдиниц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияСамостоятельныхКлассификационныхЕдиницВторичный" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияСамостоятельныхКлассификационныхЕдиницВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияСамостоятельныхКлассификационныхЕдиницВторичный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияСамостоятельныхКлассификационныхЕдиницВторичный"

	Дано Я открываю основную форму регистра сведений "ИсторияСамостоятельныхКлассификационныхЕдиницВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияСамостоятельныхКлассификационныхЕдиницВторичный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияСпециальностейПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияСпециальностейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияСпециальностейПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияСпециальностейПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияСпециальностейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияСпециальностейПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсточникиДанныхВариантовАнализаЦелевыхПоказателей" 

	Дано Я открываю основную форму списка регистра сведений "ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"

	Дано Я открываю основную форму регистра сведений "ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсточникиПервичногоИнтереса" 

	Дано Я открываю основную форму списка регистра сведений "ИсточникиПервичногоИнтереса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсточникиПервичногоИнтереса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсточникиПервичногоИнтереса"

	Дано Я открываю основную форму регистра сведений "ИсточникиПервичногоИнтереса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсточникиПервичногоИнтереса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсходныеДанныеПерерасчетов" 

	Дано Я открываю основную форму списка регистра сведений "ИсходныеДанныеПерерасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсходныеДанныеПерерасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсходныеДанныеПерерасчетов"

	Дано Я открываю основную форму регистра сведений "ИсходныеДанныеПерерасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсходныеДанныеПерерасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИтогиПоследнихСобытийEDI" 

	Дано Я открываю основную форму списка регистра сведений "ИтогиПоследнихСобытийEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИтогиПоследнихСобытийEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИтогиПоследнихСобытийEDI"

	Дано Я открываю основную форму регистра сведений "ИтогиПоследнихСобытийEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИтогиПоследнихСобытийEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадроваяИсторияСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "КадроваяИсторияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадроваяИсторияСотрудников"

	Дано Я открываю основную форму регистра сведений "КадроваяИсторияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадроваяИсторияСотрудниковИнтервальный" 

	Дано Я открываю основную форму списка регистра сведений "КадроваяИсторияСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудниковИнтервальный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадроваяИсторияСотрудниковИнтервальный"

	Дано Я открываю основную форму регистра сведений "КадроваяИсторияСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудниковИнтервальный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадроваяИсторияСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "КадроваяИсторияСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадроваяИсторияСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "КадроваяИсторияСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыеДанныеРедактированиеОрганизации" 

	Дано Я открываю основную форму списка регистра сведений "КадровыеДанныеРедактированиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадровыеДанныеРедактированиеОрганизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыеДанныеРедактированиеОрганизации"

	Дано Я открываю основную форму регистра сведений "КадровыеДанныеРедактированиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадровыеДанныеРедактированиеОрганизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыеДанныеРедактированиеФизическиеЛица" 

	Дано Я открываю основную форму списка регистра сведений "КадровыеДанныеРедактированиеФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадровыеДанныеРедактированиеФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыеДанныеРедактированиеФизическиеЛица"

	Дано Я открываю основную форму регистра сведений "КадровыеДанныеРедактированиеФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадровыеДанныеРедактированиеФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КалендарныеГрафики" 

	Дано Я открываю основную форму списка регистра сведений "КалендарныеГрафики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КалендарныеГрафики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КалендарныеГрафики"

	Дано Я открываю основную форму регистра сведений "КалендарныеГрафики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КалендарныеГрафики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассыНеПередающиеДанныеВИСМП" 

	Дано Я открываю основную форму списка регистра сведений "КассыНеПередающиеДанныеВИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КассыНеПередающиеДанныеВИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассыНеПередающиеДанныеВИСМП"

	Дано Я открываю основную форму регистра сведений "КассыНеПередающиеДанныеВИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КассыНеПередающиеДанныеВИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииДолжностейПолучателейСтимулирующихВыплатФСС" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииДолжностейПолучателейСтимулирующихВыплатФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииДолжностейПолучателейСтимулирующихВыплатФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииДолжностейПолучателейСтимулирующихВыплатФСС"

	Дано Я открываю основную форму регистра сведений "КатегорииДолжностейПолучателейСтимулирующихВыплатФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииДолжностейПолучателейСтимулирующихВыплатФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейИнтервалыВерсий" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейИнтервалыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейИнтервалыВерсий"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейИнтервалыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейИнтервалыВерсийНеобработанные" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейИнтервалыВерсийНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсийНеобработанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейИнтервалыВерсийНеобработанные"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейИнтервалыВерсийНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсийНеобработанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейПростые" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейПростые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростые"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейПростые"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейПростые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростые"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейПростыеНеобработанные" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейПростыеНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростыеНеобработанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейПростыеНеобработанные"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейПростыеНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростыеНеобработанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КвотыАссортимента" 

	Дано Я открываю основную форму списка регистра сведений "КвотыАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КвотыАссортимента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КвотыАссортимента"

	Дано Я открываю основную форму регистра сведений "КвотыАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КвотыАссортимента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассыУсловийТрудаПоДолжностям" 

	Дано Я открываю основную форму списка регистра сведений "КлассыУсловийТрудаПоДолжностям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлассыУсловийТрудаПоДолжностям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассыУсловийТрудаПоДолжностям"

	Дано Я открываю основную форму регистра сведений "КлассыУсловийТрудаПоДолжностям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлассыУсловийТрудаПоДолжностям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючевыеВидыРабочихЦентров" 

	Дано Я открываю основную форму списка регистра сведений "КлючевыеВидыРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючевыеВидыРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючевыеВидыРабочихЦентров"

	Дано Я открываю основную форму регистра сведений "КлючевыеВидыРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючевыеВидыРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаВнешнихПользователей" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаВнешнихПользователей"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаГруппДоступа"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаКОбъектам" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаКОбъектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКОбъектам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаКОбъектам"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаКОбъектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКОбъектам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаКРегистрам" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаКРегистрам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКРегистрам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаКРегистрам"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаКРегистрам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКРегистрам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаНаборовГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаНаборовГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаНаборовГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаНаборовГруппДоступа"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаНаборовГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаНаборовГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаПользователей" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаПользователей"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодировкиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "КодировкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодировкиФайлов"

	Дано Я открываю основную форму регистра сведений "КодировкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодыТНВЭДИСМП" 

	Дано Я открываю основную форму списка регистра сведений "КодыТНВЭДИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодыТНВЭДИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодыТНВЭДИСМП"

	Дано Я открываю основную форму регистра сведений "КодыТНВЭДИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодыТНВЭДИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодыТоваровПодключаемогоОборудованияOffline" 

	Дано Я открываю основную форму списка регистра сведений "КодыТоваровПодключаемогоОборудованияOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодыТоваровПодключаемогоОборудованияOffline"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодыТоваровПодключаемогоОборудованияOffline"

	Дано Я открываю основную форму регистра сведений "КодыТоваровПодключаемогоОборудованияOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодыТоваровПодключаемогоОборудованияOffline"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомандыДокументовEDI" 

	Дано Я открываю основную форму списка регистра сведений "КомандыДокументовEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомандыДокументовEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомандыДокументовEDI"

	Дано Я открываю основную форму регистра сведений "КомандыДокументовEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомандыДокументовEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомментарииОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомментарииОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческиеПредложенияПоЗапросам" 

	Дано Я открываю основную форму списка регистра сведений "КоммерческиеПредложенияПоЗапросам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоммерческиеПредложенияПоЗапросам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческиеПредложенияПоЗапросам"

	Дано Я открываю основную форму регистра сведений "КоммерческиеПредложенияПоЗапросам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоммерческиеПредложенияПоЗапросам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтактыВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактыВзаимодействий"

	Дано Я открываю основную форму регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрагентыБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "КонтрагентыБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрагентыБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрагентыБизнесСеть"

	Дано Я открываю основную форму регистра сведений "КонтрагентыБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрагентыБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрагентыНаМониторингеСПАРКРиски" 

	Дано Я открываю основную форму списка регистра сведений "КонтрагентыНаМониторингеСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрагентыНаМониторингеСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрагентыНаМониторингеСПАРКРиски"

	Дано Я открываю основную форму регистра сведений "КонтрагентыНаМониторингеСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрагентыНаМониторингеСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрольОтраженияВУчетеЭДО" 

	Дано Я открываю основную форму списка регистра сведений "КонтрольОтраженияВУчетеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольОтраженияВУчетеЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрольОтраженияВУчетеЭДО"

	Дано Я открываю основную форму регистра сведений "КонтрольОтраженияВУчетеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольОтраженияВУчетеЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрольПроведенияУчетныхДокументовЭДО" 

	Дано Я открываю основную форму списка регистра сведений "КонтрольПроведенияУчетныхДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольПроведенияУчетныхДокументовЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрольПроведенияУчетныхДокументовЭДО"

	Дано Я открываю основную форму регистра сведений "КонтрольПроведенияУчетныхДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольПроведенияУчетныхДокументовЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрольСопоставленияНоменклатурыЭДО" 

	Дано Я открываю основную форму списка регистра сведений "КонтрольСопоставленияНоменклатурыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольСопоставленияНоменклатурыЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрольСопоставленияНоменклатурыЭДО"

	Дано Я открываю основную форму регистра сведений "КонтрольСопоставленияНоменклатурыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольСопоставленияНоменклатурыЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорзинаПокупателя" 

	Дано Я открываю основную форму списка регистра сведений "КорзинаПокупателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КорзинаПокупателя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорзинаПокупателя"

	Дано Я открываю основную форму регистра сведений "КорзинаПокупателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КорзинаПокупателя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректирующиеФормыРСВ_1" 

	Дано Я открываю основную форму списка регистра сведений "КорректирующиеФормыРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КорректирующиеФормыРСВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректирующиеФормыРСВ_1"

	Дано Я открываю основную форму регистра сведений "КорректирующиеФормыРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КорректирующиеФормыРСВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоэффициентИндексацииЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "КоэффициентИндексацииЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоэффициентИндексацииЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоэффициентИндексацииЗаработка"

	Дано Я открываю основную форму регистра сведений "КоэффициентИндексацииЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоэффициентИндексацииЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоэффициентыРаспределенияСреднегоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "КоэффициентыРаспределенияСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоэффициентыРаспределенияСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоэффициентыРаспределенияСреднегоЗаработка"

	Дано Я открываю основную форму регистра сведений "КоэффициентыРаспределенияСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоэффициентыРаспределенияСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КурсыВалют" 

	Дано Я открываю основную форму списка регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КурсыВалют"

	Дано Я открываю основную форму регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшВспомогательныхДанныхВидаБюджета" 

	Дано Я открываю основную форму списка регистра сведений "КэшВспомогательныхДанныхВидаБюджета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшВспомогательныхДанныхВидаБюджета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшВспомогательныхДанныхВидаБюджета"

	Дано Я открываю основную форму регистра сведений "КэшВспомогательныхДанныхВидаБюджета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшВспомогательныхДанныхВидаБюджета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшДанныхКлассификаторов" 

	Дано Я открываю основную форму списка регистра сведений "КэшДанныхКлассификаторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшДанныхКлассификаторов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшДанныхКлассификаторов"

	Дано Я открываю основную форму регистра сведений "КэшДанныхКлассификаторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшДанныхКлассификаторов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшДанныхПартионногоУчета" 

	Дано Я открываю основную форму списка регистра сведений "КэшДанныхПартионногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшДанныхПартионногоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшДанныхПартионногоУчета"

	Дано Я открываю основную форму регистра сведений "КэшДанныхПартионногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшДанныхПартионногоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшИменДокументовДляОбработкиПоПравилу" 

	Дано Я открываю основную форму списка регистра сведений "КэшИменДокументовДляОбработкиПоПравилу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшИменДокументовДляОбработкиПоПравилу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшИменДокументовДляОбработкиПоПравилу"

	Дано Я открываю основную форму регистра сведений "КэшИменДокументовДляОбработкиПоПравилу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшИменДокументовДляОбработкиПоПравилу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшОписанияОстатковИСМП" 

	Дано Я открываю основную форму списка регистра сведений "КэшОписанияОстатковИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшОписанияОстатковИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшОписанияОстатковИСМП"

	Дано Я открываю основную форму регистра сведений "КэшОписанияОстатковИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшОписанияОстатковИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшПереводов" 

	Дано Я открываю основную форму списка регистра сведений "КэшПереводов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПереводов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшПереводов"

	Дано Я открываю основную форму регистра сведений "КэшПереводов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПереводов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшПрограммныхИнтерфейсов" 

	Дано Я открываю основную форму списка регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшПрограммныхИнтерфейсов"

	Дано Я открываю основную форму регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшСостоянийКонтрагентовФНС" 

	Дано Я открываю основную форму списка регистра сведений "КэшСостоянийКонтрагентовФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшСостоянийКонтрагентовФНС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшСостоянийКонтрагентовФНС"

	Дано Я открываю основную форму регистра сведений "КэшСостоянийКонтрагентовФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшСостоянийКонтрагентовФНС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшТестовыхПериодов" 

	Дано Я открываю основную форму списка регистра сведений "КэшТестовыхПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшТестовыхПериодов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшТестовыхПериодов"

	Дано Я открываю основную форму регистра сведений "КэшТестовыхПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшТестовыхПериодов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам" 

	Дано Я открываю основную форму списка регистра сведений "ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"

	Дано Я открываю основную форму регистра сведений "ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МакетыКомпоновкиДанных" 

	Дано Я открываю основную форму списка регистра сведений "МакетыКомпоновкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МакетыКомпоновкиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МакетыКомпоновкиДанных"

	Дано Я открываю основную форму регистра сведений "МакетыКомпоновкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МакетыКомпоновкиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаксимальныйРазмерЕжемесячнойСтраховойВыплаты" 

	Дано Я открываю основную форму списка регистра сведений "МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"

	Дано Я открываю основную форму регистра сведений "МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МероприятияТрудовойДеятельности" 

	Дано Я открываю основную форму списка регистра сведений "МероприятияТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МероприятияТрудовойДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МероприятияТрудовойДеятельности"

	Дано Я открываю основную форму регистра сведений "МероприятияТрудовойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МероприятияТрудовойДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МероприятияТрудовойДеятельностиПереданные" 

	Дано Я открываю основную форму списка регистра сведений "МероприятияТрудовойДеятельностиПереданные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МероприятияТрудовойДеятельностиПереданные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МероприятияТрудовойДеятельностиПереданные"

	Дано Я открываю основную форму регистра сведений "МероприятияТрудовойДеятельностиПереданные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МероприятияТрудовойДеятельностиПереданные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МероприятияТрудовойДеятельностиПрочие" 

	Дано Я открываю основную форму списка регистра сведений "МероприятияТрудовойДеятельностиПрочие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МероприятияТрудовойДеятельностиПрочие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МероприятияТрудовойДеятельностиПрочие"

	Дано Я открываю основную форму регистра сведений "МероприятияТрудовойДеятельностиПрочие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МероприятияТрудовойДеятельностиПрочие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестаВыплатыЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "МестаВыплатыЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестаВыплатыЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра сведений "МестаВыплатыЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестаВыплатыЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "МестаВыплатыЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестаВыплатыЗарплатыПодразделений"

	Дано Я открываю основную форму регистра сведений "МестаВыплатыЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестаВыплатыЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "МестаВыплатыЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестаВыплатыЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "МестаВыплатыЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестонахождениеОС" 

	Дано Я открываю основную форму списка регистра сведений "МестонахождениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестонахождениеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестонахождениеОС"

	Дано Я открываю основную форму регистра сведений "МестонахождениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестонахождениеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия" 

	Дано Я открываю основную форму списка регистра сведений "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"

	Дано Я открываю основную форму регистра сведений "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестоУчетаНМА" 

	Дано Я открываю основную форму списка регистра сведений "МестоУчетаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестоУчетаНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестоУчетаНМА"

	Дано Я открываю основную форму регистра сведений "МестоУчетаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестоУчетаНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МиграцияПриложенийОчередьЗагрузки" 

	Дано Я открываю основную форму списка регистра сведений "МиграцияПриложенийОчередьЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийОчередьЗагрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МиграцияПриложенийОчередьЗагрузки"

	Дано Я открываю основную форму регистра сведений "МиграцияПриложенийОчередьЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийОчередьЗагрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МиграцияПриложенийСостояниеВыгрузки" 

	Дано Я открываю основную форму списка регистра сведений "МиграцияПриложенийСостояниеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийСостояниеВыгрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МиграцияПриложенийСостояниеВыгрузки"

	Дано Я открываю основную форму регистра сведений "МиграцияПриложенийСостояниеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийСостояниеВыгрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МиграцияПриложенийСостояниеЗагрузки" 

	Дано Я открываю основную форму списка регистра сведений "МиграцияПриложенийСостояниеЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийСостояниеЗагрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МиграцияПриложенийСостояниеЗагрузки"

	Дано Я открываю основную форму регистра сведений "МиграцияПриложенийСостояниеЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийСостояниеЗагрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МинимальнаяОплатаТрудаРФ" 

	Дано Я открываю основную форму списка регистра сведений "МинимальнаяОплатаТрудаРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МинимальнаяОплатаТрудаРФ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МинимальнаяОплатаТрудаРФ"

	Дано Я открываю основную форму регистра сведений "МинимальнаяОплатаТрудаРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МинимальнаяОплатаТрудаРФ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МножителиПартийИПолуфабрикатов" 

	Дано Я открываю основную форму списка регистра сведений "МножителиПартийИПолуфабрикатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МножителиПартийИПолуфабрикатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МножителиПартийИПолуфабрикатов"

	Дано Я открываю основную форму регистра сведений "МножителиПартийИПолуфабрикатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МножителиПартийИПолуфабрикатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МоделиФормированияСтоимости" 

	Дано Я открываю основную форму списка регистра сведений "МоделиФормированияСтоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МоделиФормированияСтоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МоделиФормированияСтоимости"

	Дано Я открываю основную форму регистра сведений "МоделиФормированияСтоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МоделиФормированияСтоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаградыФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "НаградыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаградыФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаградыФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "НаградыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаградыФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеДополнительныхОбработок" 

	Дано Я открываю основную форму списка регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеДополнительныхОбработок"

	Дано Я открываю основную форму регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НакопленныеСтажиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "НакопленныеСтажиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НакопленныеСтажиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НакопленныеСтажиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "НакопленныеСтажиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НакопленныеСтажиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаличиеНовыхЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "НаличиеНовыхЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеНовыхЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаличиеНовыхЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "НаличиеНовыхЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеНовыхЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаличиеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаличиеФайлов"

	Дано Я открываю основную форму регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НапоминанияПользователя" 

	Дано Я открываю основную форму списка регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НапоминанияПользователя"

	Дано Я открываю основную форму регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НапоминанияПользователяИСМП" 

	Дано Я открываю основную форму списка регистра сведений "НапоминанияПользователяИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователяИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НапоминанияПользователяИСМП"

	Дано Я открываю основную форму регистра сведений "НапоминанияПользователяИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователяИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаработкиОбъектовЭксплуатации" 

	Дано Я открываю основную форму списка регистра сведений "НаработкиОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаработкиОбъектовЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаработкиОбъектовЭксплуатации"

	Дано Я открываю основную форму регистра сведений "НаработкиОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаработкиОбъектовЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаработкиТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка регистра сведений "НаработкиТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаработкиТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаработкиТМЦВЭксплуатации"

	Дано Я открываю основную форму регистра сведений "НаработкиТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаработкиТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаследованиеНастроекПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаследованиеНастроекПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкаЗаполненияСвободныхСтрокФормСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "НастройкаЗаполненияСвободныхСтрокФормСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаЗаполненияСвободныхСтрокФормСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкаЗаполненияСвободныхСтрокФормСтатистики"

	Дано Я открываю основную форму регистра сведений "НастройкаЗаполненияСвободныхСтрокФормСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаЗаполненияСвободныхСтрокФормСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкаЗаполненияФормСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "НастройкаЗаполненияФормСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаЗаполненияФормСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкаЗаполненияФормСтатистики"

	Дано Я открываю основную форму регистра сведений "НастройкаЗаполненияФормСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаЗаполненияФормСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкаКонтроляОбеспечения" 

	Дано Я открываю основную форму списка регистра сведений "НастройкаКонтроляОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаКонтроляОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкаКонтроляОбеспечения"

	Дано Я открываю основную форму регистра сведений "НастройкаКонтроляОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаКонтроляОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкаПередачиМатериаловВПроизводство" 

	Дано Я открываю основную форму списка регистра сведений "НастройкаПередачиМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаПередачиМатериаловВПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкаПередачиМатериаловВПроизводство"

	Дано Я открываю основную форму регистра сведений "НастройкаПередачиМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаПередачиМатериаловВПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкаПередачиТоваровМеждуОрганизациями" 

	Дано Я открываю основную форму списка регистра сведений "НастройкаПередачиТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаПередачиТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкаПередачиТоваровМеждуОрганизациями"

	Дано Я открываю основную форму регистра сведений "НастройкаПередачиТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаПередачиТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкаРаспределенияПоНаправлениямДеятельности" 

	Дано Я открываю основную форму списка регистра сведений "НастройкаРаспределенияПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаРаспределенияПоНаправлениямДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкаРаспределенияПоНаправлениямДеятельности"

	Дано Я открываю основную форму регистра сведений "НастройкаРаспределенияПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаРаспределенияПоНаправлениямДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиАвторизацииВ1СДокументообороте" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиАвторизацииВ1СДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиАвторизацииВ1СДокументообороте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиАвторизацииВ1СДокументообороте"

	Дано Я открываю основную форму регистра сведений "НастройкиАвторизацииВ1СДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиАвторизацииВ1СДокументообороте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиАдресныхСкладов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиАдресныхСкладов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиАдресныхСкладов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиАдресныхСкладов"

	Дано Я открываю основную форму регистра сведений "НастройкиАдресныхСкладов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиАдресныхСкладов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВариантовОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВариантовОтчетов"

	Дано Я открываю основную форму регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВерсионированияОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВерсионированияОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВзаиморасчетовПоПрочимДоходам" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВзаиморасчетовПоПрочимДоходам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВзаиморасчетовПоПрочимДоходам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВзаиморасчетовПоПрочимДоходам"

	Дано Я открываю основную форму регистра сведений "НастройкиВзаиморасчетовПоПрочимДоходам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВзаиморасчетовПоПрочимДоходам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВзаиморасчетовССотрудниками" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВзаиморасчетовССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВзаиморасчетовССотрудниками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВзаиморасчетовССотрудниками"

	Дано Я открываю основную форму регистра сведений "НастройкиВзаиморасчетовССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВзаиморасчетовССотрудниками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВнутреннегоЭДО" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВнутреннегоЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВнутреннегоЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВнутреннегоЭДО"

	Дано Я открываю основную форму регистра сведений "НастройкиВнутреннегоЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВнутреннегоЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВоинскогоУчета" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВоинскогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВоинскогоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВоинскогоУчета"

	Дано Я открываю основную форму регистра сведений "НастройкиВоинскогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВоинскогоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВыплатПоДоговорамОпеки" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВыплатПоДоговорамОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВыплатПоДоговорамОпеки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВыплатПоДоговорамОпеки"

	Дано Я открываю основную форму регистра сведений "НастройкиВыплатПоДоговорамОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВыплатПоДоговорамОпеки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗаймовСотрудникам" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗаймовСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаймовСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗаймовСотрудникам"

	Дано Я открываю основную форму регистра сведений "НастройкиЗаймовСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаймовСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗаполненияДополнительныхПолей" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗаполненияДополнительныхПолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаполненияДополнительныхПолей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗаполненияДополнительныхПолей"

	Дано Я открываю основную форму регистра сведений "НастройкиЗаполненияДополнительныхПолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаполненияДополнительныхПолей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗаполненияСубконтоНаСчетахМеждународногоУчета" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗаполненияСубконтоНаСчетахМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаполненияСубконтоНаСчетахМеждународногоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗаполненияСубконтоНаСчетахМеждународногоУчета"

	Дано Я открываю основную форму регистра сведений "НастройкиЗаполненияСубконтоНаСчетахМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаполненияСубконтоНаСчетахМеждународногоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗарплатаКадры" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗарплатаКадры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗарплатаКадры"

	Дано Я открываю основную форму регистра сведений "НастройкиЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗарплатаКадры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗарплатаКадрыРасширенная" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗарплатаКадрыРасширенная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗарплатаКадрыРасширенная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗарплатаКадрыРасширенная"

	Дано Я открываю основную форму регистра сведений "НастройкиЗарплатаКадрыРасширенная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗарплатаКадрыРасширенная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗаявленийНаОтпускКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗаявленийНаОтпускКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаявленийНаОтпускКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗаявленийНаОтпускКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "НастройкиЗаявленийНаОтпускКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаявленийНаОтпускКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиИнтеграцииEDI" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиИнтеграцииEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиИнтеграцииEDI"

	Дано Я открываю основную форму регистра сведений "НастройкиИнтеграцииEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиИнтеграцииКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиИнтеграцииКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиИнтеграцииКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "НастройкиИнтеграцииКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиИнтеграцииСоСпринтером" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиИнтеграцииСоСпринтером"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииСоСпринтером"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиИнтеграцииСоСпринтером"

	Дано Я открываю основную форму регистра сведений "НастройкиИнтеграцииСоСпринтером"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииСоСпринтером"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"

	Дано Я открываю основную форму регистра сведений "НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиКадровогоУчета" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКадровогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКадровогоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиКадровогоУчета"

	Дано Я открываю основную форму регистра сведений "НастройкиКадровогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКадровогоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиКомандПечати" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиКомандПечати"

	Дано Я открываю основную форму регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЛьготСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЛьготСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЛьготСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЛьготСотрудников"

	Дано Я открываю основную форму регистра сведений "НастройкиЛьготСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЛьготСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаДаннымиXDTO" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаДаннымиXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаДаннымиXDTO"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаДаннымиXDTO"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаДаннымиXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаДаннымиXDTO"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаЕГАИС"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаМинобороны" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаМинобороны"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаМинобороны"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаМинобороны"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаМинобороны"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаМинобороны"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаРПН" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаРПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаРПН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаРПН"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаРПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаРПН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаРЭЦ" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаРЭЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаРЭЦ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаРЭЦ"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаРЭЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаРЭЦ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаСУЗ" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаСУЗ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаСУЗ"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаСУЗ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаФСРАР" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаФСРАР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФСРАР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаФСРАР"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаФСРАР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФСРАР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаФСС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаФСС"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаФТС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаФТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФТС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаФТС"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаФТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФТС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбщиеСервисДоставки" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбщиеСервисДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбщиеСервисДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбщиеСервисДоставки"

	Дано Я открываю основную форму регистра сведений "НастройкиОбщиеСервисДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбщиеСервисДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОткрытияФормПриНачалеРаботыСистемы" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОткрытияФормПриНачалеРаботыСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОткрытияФормПриНачалеРаботыСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОткрытияФормПриНачалеРаботыСистемы"

	Дано Я открываю основную форму регистра сведений "НастройкиОткрытияФормПриНачалеРаботыСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОткрытияФормПриНачалеРаботыСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтправителя" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтправителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправителя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтправителя"

	Дано Я открываю основную форму регистра сведений "НастройкиОтправителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправителя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтправкиОтчетностиВБанк" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтправкиОтчетностиВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиОтчетностиВБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтправкиОтчетностиВБанк"

	Дано Я открываю основную форму регистра сведений "НастройкиОтправкиОтчетностиВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиОтчетностиВБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтправкиЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтправкиЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтправкиЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "НастройкиОтправкиЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтправкиЭлектронныхДокументовПоВидам" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтправкиЭлектронныхДокументовПоВидам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиЭлектронныхДокументовПоВидам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтправкиЭлектронныхДокументовПоВидам"

	Дано Я открываю основную форму регистра сведений "НастройкиОтправкиЭлектронныхДокументовПоВидам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиЭлектронныхДокументовПоВидам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтраженияКорреспонденцийВМеждународномУчете" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтраженияКорреспонденцийВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтраженияКорреспонденцийВМеждународномУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтраженияКорреспонденцийВМеждународномУчете"

	Дано Я открываю основную форму регистра сведений "НастройкиОтраженияКорреспонденцийВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтраженияКорреспонденцийВМеждународномУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОчисткиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОчисткиФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПечатиОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПечатиОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПечатиОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПечатиОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиПечатиОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПечатиОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПодключенияВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПодключенияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПодключенияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПодключенияВЕТИС"

	Дано Я открываю основную форму регистра сведений "НастройкиПодключенияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПодключенияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПолученияУведомленийОбЭЛН" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПолученияУведомленийОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПолученияУведомленийОбЭЛН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПолученияУведомленийОбЭЛН"

	Дано Я открываю основную форму регистра сведений "НастройкиПолученияУведомленийОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПолученияУведомленийОбЭЛН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПолученияЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПолученияЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПолученияЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПолученияЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "НастройкиПолученияЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПолученияЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПользователейБИП" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПользователейБИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПользователейБИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПользователейБИП"

	Дано Я открываю основную форму регистра сведений "НастройкиПользователейБИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПользователейБИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПоставщикаEDI" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПоставщикаEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПоставщикаEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПоставщикаEDI"

	Дано Я открываю основную форму регистра сведений "НастройкиПоставщикаEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПоставщикаEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПроверкиОтчетностиПерсУчета" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПроверкиОтчетностиПерсУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПроверкиОтчетностиПерсУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПроверкиОтчетностиПерсУчета"

	Дано Я открываю основную форму регистра сведений "НастройкиПроверкиОтчетностиПерсУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПроверкиОтчетностиПерсУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПродленияСроковНалоговОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПродленияСроковНалоговОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПродленияСроковНалоговОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПродленияСроковНалоговОтчетов"

	Дано Я открываю основную форму регистра сведений "НастройкиПродленияСроковНалоговОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПродленияСроковНалоговОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПрямыхВыплатФССОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПрямыхВыплатФССОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПрямыхВыплатФССОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПрямыхВыплатФССОрганизаций"

	Дано Я открываю основную форму регистра сведений "НастройкиПрямыхВыплатФССОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПрямыхВыплатФССОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПрямыхВыплатФСССотрудников" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПрямыхВыплатФСССотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПрямыхВыплатФСССотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПрямыхВыплатФСССотрудников"

	Дано Я открываю основную форму регистра сведений "НастройкиПрямыхВыплатФСССотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПрямыхВыплатФСССотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПрямыхВыплатФСССотрудниковПодробности" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПрямыхВыплатФСССотрудниковПодробности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПрямыхВыплатФСССотрудниковПодробности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПрямыхВыплатФСССотрудниковПодробности"

	Дано Я открываю основную форму регистра сведений "НастройкиПрямыхВыплатФСССотрудниковПодробности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПрямыхВыплатФСССотрудниковПодробности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРаботыСПеревозчикамиСервисДоставки" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРаботыСПеревозчикамиСервисДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРаботыСПеревозчикамиСервисДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРаботыСПеревозчикамиСервисДоставки"

	Дано Я открываю основную форму регистра сведений "НастройкиРаботыСПеревозчикамиСервисДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРаботыСПеревозчикамиСервисДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРаспределенияПостатейныхРасходов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРаспределенияПостатейныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРаспределенияПостатейныхРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРаспределенияПостатейныхРасходов"

	Дано Я открываю основную форму регистра сведений "НастройкиРаспределенияПостатейныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРаспределенияПостатейныхРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРасчетаЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРасчетаЗарплаты"

	Дано Я открываю основную форму регистра сведений "НастройкиРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРасчетаЗарплатыРасширенный" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРасчетаЗарплатыРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаЗарплатыРасширенный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРасчетаЗарплатыРасширенный"

	Дано Я открываю основную форму регистра сведений "НастройкиРасчетаЗарплатыРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаЗарплатыРасширенный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРасчетаРезервовОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРасчетаРезервовОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаРезервовОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРасчетаРезервовОтпусков"

	Дано Я открываю основную форму регистра сведений "НастройкиРасчетаРезервовОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаРезервовОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРасчетаСреднегоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРасчетаСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРасчетаСреднегоЗаработка"

	Дано Я открываю основную форму регистра сведений "НастройкиРасчетаСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСервисаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСервисаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСервисаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "НастройкиСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСервисаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСинхронизацииФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСистемыНалогообложения" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСистемыНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСистемыНалогообложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСистемыНалогообложения"

	Дано Я открываю основную форму регистра сведений "НастройкиСистемыНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСистемыНалогообложения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСтатистикиПерсонала" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСтатистикиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСтатистикиПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСтатистикиПерсонала"

	Дано Я открываю основную форму регистра сведений "НастройкиСтатистикиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСтатистикиПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСчетовМеждународногоУчетаПоОбъектам" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСчетовМеждународногоУчетаПоОбъектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСчетовМеждународногоУчетаПоОбъектам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСчетовМеждународногоУчетаПоОбъектам"

	Дано Я открываю основную форму регистра сведений "НастройкиСчетовМеждународногоУчетаПоОбъектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСчетовМеждународногоУчетаПоОбъектам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаДанными"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаОбластейДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаОбластиДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаСообщениями" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаСообщениями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаСообщениями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаСообщениями"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаСообщениями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаСообщениями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУполномоченногоГашенияВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУполномоченногоГашенияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУполномоченногоГашенияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУполномоченногоГашенияВЕТИС"

	Дано Я открываю основную форму регистра сведений "НастройкиУполномоченногоГашенияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУполномоченногоГашенияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаВремени" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаВремени"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаМаркируемойПродукцииИСМП" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаМаркируемойПродукцииИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаМаркируемойПродукцииИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаМаркируемойПродукцииИСМП"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаМаркируемойПродукцииИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаМаркируемойПродукцииИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаНалогаНаПрибыль" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаНалогаНаПрибыль"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаНалогаНаПрибыль"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаНалогаНаПрибыль"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаНДС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаНДС"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаПособийСоциальногоСтрахования" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаПособийСоциальногоСтрахования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаПособийСоциальногоСтрахования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаПособийСоциальногоСтрахования"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаПособийСоциальногоСтрахования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаПособийСоциальногоСтрахования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаУСН" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаУСН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаУСН"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаУСН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетныхЗаписейЭлектроннойПочты" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетныхЗаписейЭлектроннойПочты"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетныхСистем" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетныхСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхСистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетныхСистем"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетныхСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхСистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиШтатногоРасписания" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиШтатногоРасписания"

	Дано Я открываю основную форму регистра сведений "НастройкиШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЭлектронныхТрудовыхКнижек" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЭлектронныхТрудовыхКнижек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЭлектронныхТрудовыхКнижек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЭлектронныхТрудовыхКнижек"

	Дано Я открываю основную форму регистра сведений "НастройкиЭлектронныхТрудовыхКнижек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЭлектронныхТрудовыхКнижек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальныеОстаткиОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "НачальныеОстаткиОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачальныеОстаткиОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальныеОстаткиОтпусков"

	Дано Я открываю основную форму регистра сведений "НачальныеОстаткиОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачальныеОстаткиОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияНеУчитываемыеПриРасчетеДоплатыЗаСовмещение" 

	Дано Я открываю основную форму списка регистра сведений "НачисленияНеУчитываемыеПриРасчетеДоплатыЗаСовмещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленияНеУчитываемыеПриРасчетеДоплатыЗаСовмещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияНеУчитываемыеПриРасчетеДоплатыЗаСовмещение"

	Дано Я открываю основную форму регистра сведений "НачисленияНеУчитываемыеПриРасчетеДоплатыЗаСовмещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленияНеУчитываемыеПриРасчетеДоплатыЗаСовмещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияПодключаемыеХарактеристики" 

	Дано Я открываю основную форму списка регистра сведений "НачисленияПодключаемыеХарактеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленияПодключаемыеХарактеристики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияПодключаемыеХарактеристики"

	Дано Я открываю основную форму регистра сведений "НачисленияПодключаемыеХарактеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленияПодключаемыеХарактеристики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленнаяЗарплатаПросмотрОрганизации" 

	Дано Я открываю основную форму списка регистра сведений "НачисленнаяЗарплатаПросмотрОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленнаяЗарплатаПросмотрОрганизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленнаяЗарплатаПросмотрОрганизации"

	Дано Я открываю основную форму регистра сведений "НачисленнаяЗарплатаПросмотрОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленнаяЗарплатаПросмотрОрганизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленнаяЗарплатаПросмотрФизическиеЛица" 

	Дано Я открываю основную форму списка регистра сведений "НачисленнаяЗарплатаПросмотрФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленнаяЗарплатаПросмотрФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленнаяЗарплатаПросмотрФизическиеЛица"

	Дано Я открываю основную форму регистра сведений "НачисленнаяЗарплатаПросмотрФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленнаяЗарплатаПросмотрФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленнаяЗарплатаРедактированиеОрганизации" 

	Дано Я открываю основную форму списка регистра сведений "НачисленнаяЗарплатаРедактированиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленнаяЗарплатаРедактированиеОрганизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленнаяЗарплатаРедактированиеОрганизации"

	Дано Я открываю основную форму регистра сведений "НачисленнаяЗарплатаРедактированиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленнаяЗарплатаРедактированиеОрганизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленнаяЗарплатаРедактированиеФизическиеЛица" 

	Дано Я открываю основную форму списка регистра сведений "НачисленнаяЗарплатаРедактированиеФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленнаяЗарплатаРедактированиеФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленнаяЗарплатаРедактированиеФизическиеЛица"

	Дано Я открываю основную форму регистра сведений "НачисленнаяЗарплатаРедактированиеФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачисленнаяЗарплатаРедактированиеФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДССостояниеРеализации0" 

	Дано Я открываю основную форму списка регистра сведений "НДССостояниеРеализации0"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НДССостояниеРеализации0"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДССостояниеРеализации0"

	Дано Я открываю основную форму регистра сведений "НДССостояниеРеализации0"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НДССостояниеРеализации0"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НематериальныеАктивыМеждународныйУчет" 

	Дано Я открываю основную форму списка регистра сведений "НематериальныеАктивыМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НематериальныеАктивыМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НематериальныеАктивыМеждународныйУчет"

	Дано Я открываю основную форму регистра сведений "НематериальныеАктивыМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НематериальныеАктивыМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеобрабатываемыеПакетыЭД" 

	Дано Я открываю основную форму списка регистра сведений "НеобрабатываемыеПакетыЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобрабатываемыеПакетыЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеобрабатываемыеПакетыЭД"

	Дано Я открываю основную форму регистра сведений "НеобрабатываемыеПакетыЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобрабатываемыеПакетыЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеобрабатываемыеТранспортныеСообщения" 

	Дано Я открываю основную форму списка регистра сведений "НеобрабатываемыеТранспортныеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобрабатываемыеТранспортныеСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеобрабатываемыеТранспортныеСообщения"

	Дано Я открываю основную форму регистра сведений "НеобрабатываемыеТранспортныеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобрабатываемыеТранспортныеСообщения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеобработанныеРезультатыСогласованияКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "НеобработанныеРезультатыСогласованияКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобработанныеРезультатыСогласованияКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеобработанныеРезультатыСогласованияКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "НеобработанныеРезультатыСогласованияКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобработанныеРезультатыСогласованияКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеобходимыеКорректировкиСтажаПФР" 

	Дано Я открываю основную форму списка регистра сведений "НеобходимыеКорректировкиСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобходимыеКорректировкиСтажаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеобходимыеКорректировкиСтажаПФР"

	Дано Я открываю основную форму регистра сведений "НеобходимыеКорректировкиСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобходимыеКорректировкиСтажаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеОтправленныеПрикладныеОбъектыEDI" 

	Дано Я открываю основную форму списка регистра сведений "НеОтправленныеПрикладныеОбъектыEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеОтправленныеПрикладныеОбъектыEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеОтправленныеПрикладныеОбъектыEDI"

	Дано Я открываю основную форму регистра сведений "НеОтправленныеПрикладныеОбъектыEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеОтправленныеПрикладныеОбъектыEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма" 

	Дано Я открываю основную форму списка регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"

	Дано Я открываю основную форму регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеразделенныеПользователи" 

	Дано Я открываю основную форму списка регистра сведений "НеразделенныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеразделенныеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеразделенныеПользователи"

	Дано Я открываю основную форму регистра сведений "НеразделенныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеразделенныеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеудаленныеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "НеудаленныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеудаленныеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеудаленныеОбъекты"

	Дано Я открываю основную форму регистра сведений "НеудаленныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеудаленныеОбъекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураКонтрагентовБЭД" 

	Дано Я открываю основную форму списка регистра сведений "НоменклатураКонтрагентовБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураКонтрагентовБЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураКонтрагентовБЭД"

	Дано Я открываю основную форму регистра сведений "НоменклатураКонтрагентовБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураКонтрагентовБЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураПродаваемаяСовместно" 

	Дано Я открываю основную форму списка регистра сведений "НоменклатураПродаваемаяСовместно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураПродаваемаяСовместно"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураПродаваемаяСовместно"

	Дано Я открываю основную форму регистра сведений "НоменклатураПродаваемаяСовместно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураПродаваемаяСовместно"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураСегмента" 

	Дано Я открываю основную форму списка регистра сведений "НоменклатураСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураСегмента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураСегмента"

	Дано Я открываю основную форму регистра сведений "НоменклатураСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураСегмента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураТорговойПлощадки" 

	Дано Я открываю основную форму списка регистра сведений "НоменклатураТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураТорговойПлощадки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураТорговойПлощадки"

	Дано Я открываю основную форму регистра сведений "НоменклатураТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураТорговойПлощадки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НомераОтсканированныхФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НомераОтсканированныхФайлов"

	Дано Я открываю основную форму регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НормативнаяДлительностьПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "НормативнаяДлительностьПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативнаяДлительностьПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НормативнаяДлительностьПроизводства"

	Дано Я открываю основную форму регистра сведений "НормативнаяДлительностьПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативнаяДлительностьПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НормативнаяДлительностьЭтаповПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "НормативнаяДлительностьЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативнаяДлительностьЭтаповПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НормативнаяДлительностьЭтаповПроизводства"

	Дано Я открываю основную форму регистра сведений "НормативнаяДлительностьЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативнаяДлительностьЭтаповПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НормативныйГрафикЭтаповПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "НормативныйГрафикЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативныйГрафикЭтаповПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НормативныйГрафикЭтаповПроизводства"

	Дано Я открываю основную форму регистра сведений "НормативныйГрафикЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативныйГрафикЭтаповПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НормативыРаспределенияПлановПродажПоКатегориям" 

	Дано Я открываю основную форму списка регистра сведений "НормативыРаспределенияПлановПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативыРаспределенияПлановПродажПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НормативыРаспределенияПлановПродажПоКатегориям"

	Дано Я открываю основную форму регистра сведений "НормативыРаспределенияПлановПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативыРаспределенияПлановПродажПоКатегориям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НумераторПачекПФР" 

	Дано Я открываю основную форму списка регистра сведений "НумераторПачекПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумераторПачекПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НумераторПачекПФР"

	Дано Я открываю основную форму регистра сведений "НумераторПачекПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумераторПачекПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НумерацияЧековККТ" 

	Дано Я открываю основную форму списка регистра сведений "НумерацияЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумерацияЧековККТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НумерацияЧековККТ"

	Дано Я открываю основную форму регистра сведений "НумерацияЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумерацияЧековККТ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиДействияСертификатовНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиДействияСертификатовНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДействияСертификатовНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиДействияСертификатовНоменклатуры"

	Дано Я открываю основную форму регистра сведений "ОбластиДействияСертификатовНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДействияСертификатовНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеКлючейДоступаКДанным" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеКлючейДоступаКДанным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаКДанным"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеКлючейДоступаКДанным"

	Дано Я открываю основную форму регистра сведений "ОбновлениеКлючейДоступаКДанным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаКДанным"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеКлючейДоступаПользователей" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеКлючейДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеКлючейДоступаПользователей"

	Дано Я открываю основную форму регистра сведений "ОбновлениеКлючейДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеКлючейДоступаТекущиеЗадания" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеКлючейДоступаТекущиеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаТекущиеЗадания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеКлючейДоступаТекущиеЗадания"

	Дано Я открываю основную форму регистра сведений "ОбновлениеКлючейДоступаТекущиеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаТекущиеЗадания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеЧерезКопиюДинамикаПроцесса" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеЧерезКопиюДинамикаПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеЧерезКопиюДинамикаПроцесса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеЧерезКопиюДинамикаПроцесса"

	Дано Я открываю основную форму регистра сведений "ОбновлениеЧерезКопиюДинамикаПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеЧерезКопиюДинамикаПроцесса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиОбменаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиОбменаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбменаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиОбменаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ОбработчикиОбменаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбменаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиОбновления" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбновления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиОбновления"

	Дано Я открываю основную форму регистра сведений "ОбработчикиОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбновления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиОбновленияОбщихДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиОбновленияОбщихДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбновленияОбщихДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиОбновленияОбщихДанных"

	Дано Я открываю основную форму регистра сведений "ОбработчикиОбновленияОбщихДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбновленияОбщихДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиСобытийСинхронизацииДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиСобытийСинхронизацииДанных"

	Дано Я открываю основную форму регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеНастройкиУзловИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеНастройкиУзловИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеПоставляемыеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ОбщиеПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеПоставляемыеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ОбщиеПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыДляУдаленияИзСервисаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыДляУдаленияИзСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыДляУдаленияИзСервисаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыДляУдаленияИзСервисаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ОбъектыДляУдаленияИзСервисаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыДляУдаленияИзСервисаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыИнтегрированныеС1СДокументооборотом" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыИнтегрированныеС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыИнтегрированныеС1СДокументооборотом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыИнтегрированныеС1СДокументооборотом"

	Дано Я открываю основную форму регистра сведений "ОбъектыИнтегрированныеС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыИнтегрированныеС1СДокументооборотом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыКОтправке" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыКОтправке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыКОтправке"

	Дано Я открываю основную форму регистра сведений "ОбъектыКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыКОтправке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыПроблемСостоянияСистемы" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыПроблемСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыПроблемСостоянияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыПроблемСостоянияСистемы"

	Дано Я открываю основную форму регистра сведений "ОбъектыПроблемСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыПроблемСостоянияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыТранспортныхКонтейнеровЭДО" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыТранспортныхКонтейнеровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыТранспортныхКонтейнеровЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыТранспортныхКонтейнеровЭДО"

	Дано Я открываю основную форму регистра сведений "ОбъектыТранспортныхКонтейнеровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыТранспортныхКонтейнеровЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыУчетаДокументовЭДО" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыУчетаДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыУчетаДокументовЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыУчетаДокументовЭДО"

	Дано Я открываю основную форму регистра сведений "ОбъектыУчетаДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыУчетаДокументовЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОграничениеСкоростиОтсылкиИнцидентов" 

	Дано Я открываю основную форму списка регистра сведений "ОграничениеСкоростиОтсылкиИнцидентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОграничениеСкоростиОтсылкиИнцидентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОграничениеСкоростиОтсылкиИнцидентов"

	Дано Я открываю основную форму регистра сведений "ОграничениеСкоростиОтсылкиИнцидентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОграничениеСкоростиОтсылкиИнцидентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОграниченныеДокументы" 

	Дано Я открываю основную форму списка регистра сведений "ОграниченныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОграниченныеДокументы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОграниченныеДокументы"

	Дано Я открываю основную форму регистра сведений "ОграниченныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОграниченныеДокументы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперативныеПоказателиДляВыявленияНачислений" 

	Дано Я открываю основную форму списка регистра сведений "ОперативныеПоказателиДляВыявленияНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперативныеПоказателиДляВыявленияНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперативныеПоказателиДляВыявленияНачислений"

	Дано Я открываю основную форму регистра сведений "ОперативныеПоказателиДляВыявленияНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперативныеПоказателиДляВыявленияНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперативныеПоказателиДляВыявленияУдержаний" 

	Дано Я открываю основную форму списка регистра сведений "ОперативныеПоказателиДляВыявленияУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперативныеПоказателиДляВыявленияУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперативныеПоказателиДляВыявленияУдержаний"

	Дано Я открываю основную форму регистра сведений "ОперативныеПоказателиДляВыявленияУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперативныеПоказателиДляВыявленияУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОператорыЭДО" 

	Дано Я открываю основную форму списка регистра сведений "ОператорыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОператорыЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОператорыЭДО"

	Дано Я открываю основную форму регистра сведений "ОператорыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОператорыЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииДляДиспетчирования" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииДляДиспетчирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииДляДиспетчирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииДляДиспетчирования"

	Дано Я открываю основную форму регистра сведений "ОперацииДляДиспетчирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииДляДиспетчирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииКСозданиюСменныхЗаданий" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииКСозданиюСменныхЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииКСозданиюСменныхЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииКСозданиюСменныхЗаданий"

	Дано Я открываю основную форму регистра сведений "ОперацииКСозданиюСменныхЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииКСозданиюСменныхЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииМаршрутовПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииМаршрутовПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииМаршрутовПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииМаршрутовПроизводства"

	Дано Я открываю основную форму регистра сведений "ОперацииМаршрутовПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииМаршрутовПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииРасчетаЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииРасчетаЗарплаты"

	Дано Я открываю основную форму регистра сведений "ОперацииРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииРегламентныхЗаданий" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииРегламентныхЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииРегламентныхЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииРегламентныхЗаданий"

	Дано Я открываю основную форму регистра сведений "ОперацииРегламентныхЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииРегламентныхЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииРегламентныхЗаданийОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииРегламентныхЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииРегламентныхЗаданийОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииРегламентныхЗаданийОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ОперацииРегламентныхЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииРегламентныхЗаданийОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииСПрослеживаемымиТоварами" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииСПрослеживаемымиТоварами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСПрослеживаемымиТоварами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииСПрослеживаемымиТоварами"

	Дано Я открываю основную форму регистра сведений "ОперацииСПрослеживаемымиТоварами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСПрослеживаемымиТоварами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписаниеGTINИС" 

	Дано Я открываю основную форму списка регистра сведений "ОписаниеGTINИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОписаниеGTINИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписаниеGTINИС"

	Дано Я открываю основную форму регистра сведений "ОписаниеGTINИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОписаниеGTINИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаВедомостейНаВыплатуЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "ОплатаВедомостейНаВыплатуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОплатаВедомостейНаВыплатуЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаВедомостейНаВыплатуЗарплаты"

	Дано Я открываю основную форму регистра сведений "ОплатаВедомостейНаВыплатуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОплатаВедомостейНаВыплатуЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплаченныеДоговоры" 

	Дано Я открываю основную форму списка регистра сведений "ОплаченныеДоговоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОплаченныеДоговоры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплаченныеДоговоры"

	Дано Я открываю основную форму регистра сведений "ОплаченныеДоговоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОплаченныеДоговоры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганизацииБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "ОрганизацииБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганизацииБизнесСеть"

	Дано Я открываю основную форму регистра сведений "ОрганизацииБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганизацииВКоторыхРаботалиСотрудники" 

	Дано Я открываю основную форму списка регистра сведений "ОрганизацииВКоторыхРаботалиСотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииВКоторыхРаботалиСотрудники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганизацииВКоторыхРаботалиСотрудники"

	Дано Я открываю основную форму регистра сведений "ОрганизацииВКоторыхРаботалиСотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииВКоторыхРаботалиСотрудники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганизацииДляОбменаГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "ОрганизацииДляОбменаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииДляОбменаГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганизацииДляОбменаГИСМ"

	Дано Я открываю основную форму регистра сведений "ОрганизацииДляОбменаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииДляОбменаГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОриентирыАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОриентирыАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияПолномочийОтветственныхЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ОснованияПолномочийОтветственныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОснованияПолномочийОтветственныхЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияПолномочийОтветственныхЛиц"

	Дано Я открываю основную форму регистра сведений "ОснованияПолномочийОтветственныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОснованияПолномочийОтветственныхЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияУвольненияВАрхиве" 

	Дано Я открываю основную форму списка регистра сведений "ОснованияУвольненияВАрхиве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОснованияУвольненияВАрхиве"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияУвольненияВАрхиве"

	Дано Я открываю основную форму регистра сведений "ОснованияУвольненияВАрхиве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОснованияУвольненияВАрхиве"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсновныеДанныеКонтрактаДоговораСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ОсновныеДанныеКонтрактаДоговораСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеДанныеКонтрактаДоговораСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсновныеДанныеКонтрактаДоговораСотрудника"

	Дано Я открываю основную форму регистра сведений "ОсновныеДанныеКонтрактаДоговораСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеДанныеКонтрактаДоговораСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсновныеДанныеКонтрактаДоговораСотрудникаИспр" 

	Дано Я открываю основную форму списка регистра сведений "ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"

	Дано Я открываю основную форму регистра сведений "ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсновныеМаршрутныеКарты" 

	Дано Я открываю основную форму списка регистра сведений "ОсновныеМаршрутныеКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеМаршрутныеКарты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсновныеМаршрутныеКарты"

	Дано Я открываю основную форму регистра сведений "ОсновныеМаршрутныеКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеМаршрутныеКарты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсновныеСотрудникиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ОсновныеСотрудникиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеСотрудникиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсновныеСотрудникиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ОсновныеСотрудникиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеСотрудникиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсновныеСредстваМеждународныйУчет" 

	Дано Я открываю основную форму списка регистра сведений "ОсновныеСредстваМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеСредстваМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсновныеСредстваМеждународныйУчет"

	Дано Я открываю основную форму регистра сведений "ОсновныеСредстваМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеСредстваМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОстаткиНаБанковскихСчетахПоДаннымВыписок" 

	Дано Я открываю основную форму списка регистра сведений "ОстаткиНаБанковскихСчетахПоДаннымВыписок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОстаткиНаБанковскихСчетахПоДаннымВыписок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОстаткиНаБанковскихСчетахПоДаннымВыписок"

	Дано Я открываю основную форму регистра сведений "ОстаткиНаБанковскихСчетахПоДаннымВыписок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОстаткиНаБанковскихСчетахПоДаннымВыписок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОстаткиПродукцииВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ОстаткиПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОстаткиПродукцииВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОстаткиПродукцииВЕТИС"

	Дано Я открываю основную форму регистра сведений "ОстаткиПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОстаткиПродукцииВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборыПоЛентамНовостейДляОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОтборыПоЛентамНовостейДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейДляОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборыПоЛентамНовостейДляОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОтборыПоЛентамНовостейДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейДляОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборыПоЛентамНовостейОбщие" 

	Дано Я открываю основную форму списка регистра сведений "ОтборыПоЛентамНовостейОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейОбщие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборыПоЛентамНовостейОбщие"

	Дано Я открываю основную форму регистра сведений "ОтборыПоЛентамНовостейОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейОбщие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборыПоЛентамНовостейПользовательские" 

	Дано Я открываю основную форму списка регистра сведений "ОтборыПоЛентамНовостейПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейПользовательские"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборыПоЛентамНовостейПользовательские"

	Дано Я открываю основную форму регистра сведений "ОтборыПоЛентамНовостейПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейПользовательские"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаВопросыАнкет" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаВопросыАнкет"

	Дано Я открываю основную форму регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму регистра сведений "ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаЗапросыИОН" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаЗапросыИОН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыИОН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаЗапросыИОН"

	Дано Я открываю основную форму регистра сведений "ОтветыНаЗапросыИОН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыИОН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаЗапросыИОС" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаЗапросыИОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыИОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаЗапросыИОС"

	Дано Я открываю основную форму регистра сведений "ОтветыНаЗапросыИОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыИОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтключенныеЛентыНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ОтключенныеЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтключенныеЛентыНовостей"

	Дано Я открываю основную форму регистра сведений "ОтключенныеЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтключенныеЛентыНовостейДляОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОтключенныеЛентыНовостейДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостейДляОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтключенныеЛентыНовостейДляОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОтключенныеЛентыНовостейДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостейДляОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтключенныеПанелиКонтекстныхНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ОтключенныеПанелиКонтекстныхНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеПанелиКонтекстныхНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтключенныеПанелиКонтекстныхНовостей"

	Дано Я открываю основную форму регистра сведений "ОтключенныеПанелиКонтекстныхНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеПанелиКонтекстныхНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтложенноеОткрытиеЛицевыхСчетовСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ОтложенноеОткрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтложенноеОткрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтложенноеОткрытиеЛицевыхСчетовСотрудников"

	Дано Я открываю основную форму регистра сведений "ОтложенноеОткрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтложенноеОткрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаКорректировокПланаПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "ОтменаКорректировокПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтменаКорректировокПланаПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаКорректировокПланаПроизводства"

	Дано Я открываю основную форму регистра сведений "ОтменаКорректировокПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтменаКорректировокПланаПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаКорректировокПлановОбеспечения" 

	Дано Я открываю основную форму списка регистра сведений "ОтменаКорректировокПлановОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтменаКорректировокПлановОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаКорректировокПлановОбеспечения"

	Дано Я открываю основную форму регистра сведений "ОтменаКорректировокПлановОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтменаКорректировокПлановОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтносительныеКурсыВалют" 

	Дано Я открываю основную форму списка регистра сведений "ОтносительныеКурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтносительныеКурсыВалют"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтносительныеКурсыВалют"

	Дано Я открываю основную форму регистра сведений "ОтносительныеКурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтносительныеКурсыВалют"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиОтчетностиКОбработке" 

	Дано Я открываю основную форму списка регистра сведений "ОтправкиОтчетностиКОбработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтправкиОтчетностиКОбработке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиОтчетностиКОбработке"

	Дано Я открываю основную форму регистра сведений "ОтправкиОтчетностиКОбработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтправкиОтчетностиКОбработке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправленныеОповещенияПоБюджетнымЗадачам" 

	Дано Я открываю основную форму списка регистра сведений "ОтправленныеОповещенияПоБюджетнымЗадачам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтправленныеОповещенияПоБюджетнымЗадачам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправленныеОповещенияПоБюджетнымЗадачам"

	Дано Я открываю основную форму регистра сведений "ОтправленныеОповещенияПоБюджетнымЗадачам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтправленныеОповещенияПоБюджетнымЗадачам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеВРегламентированномУчетеНастройкиОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ОтражениеВРегламентированномУчетеНастройкиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеВРегламентированномУчетеНастройкиОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеВРегламентированномУчетеНастройкиОрганизаций"

	Дано Я открываю основную форму регистра сведений "ОтражениеВРегламентированномУчетеНастройкиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеВРегламентированномУчетеНастройкиОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеДокументовВМеждународномУчете" 

	Дано Я открываю основную форму списка регистра сведений "ОтражениеДокументовВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеДокументовВМеждународномУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеДокументовВМеждународномУчете"

	Дано Я открываю основную форму регистра сведений "ОтражениеДокументовВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеДокументовВМеждународномУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеДокументовВРеглУчете" 

	Дано Я открываю основную форму списка регистра сведений "ОтражениеДокументовВРеглУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеДокументовВРеглУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеДокументовВРеглУчете"

	Дано Я открываю основную форму регистра сведений "ОтражениеДокументовВРеглУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеДокументовВРеглУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтсутствияСдвигающиеРабочийГод" 

	Дано Я открываю основную форму списка регистра сведений "ОтсутствияСдвигающиеРабочийГод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтсутствияСдвигающиеРабочийГод"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтсутствияСдвигающиеРабочийГод"

	Дано Я открываю основную форму регистра сведений "ОтсутствияСдвигающиеРабочийГод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтсутствияСдвигающиеРабочийГод"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетыПереданныеВСПАРК" 

	Дано Я открываю основную форму списка регистра сведений "ОтчетыПереданныеВСПАРК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтчетыПереданныеВСПАРК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетыПереданныеВСПАРК"

	Дано Я открываю основную форму регистра сведений "ОтчетыПереданныеВСПАРК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтчетыПереданныеВСПАРК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчитывающиесяПоВзносамОрганизации" 

	Дано Я открываю основную форму списка регистра сведений "ОтчитывающиесяПоВзносамОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтчитывающиесяПоВзносамОрганизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчитывающиесяПоВзносамОрганизации"

	Дано Я открываю основную форму регистра сведений "ОтчитывающиесяПоВзносамОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтчитывающиесяПоВзносамОрганизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаказовККорректировкеСтрокМерныхТоваров" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьЗаказовККорректировкеСтрокМерныхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьЗаказовККорректировкеСтрокМерныхТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЗаказовККорректировкеСтрокМерныхТоваров"

	Дано Я открываю основную форму регистра сведений "ОчередьЗаказовККорректировкеСтрокМерныхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьЗаказовККорректировкеСтрокМерныхТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИзвлеченияТекста" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИзвлеченияТекста"

	Дано Я открываю основную форму регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьКорректировокПотребностейКПересчету" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьКорректировокПотребностейКПересчету"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьКорректировокПотребностейКПересчету"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьКорректировокПотребностейКПересчету"

	Дано Я открываю основную форму регистра сведений "ОчередьКорректировокПотребностейКПересчету"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьКорректировокПотребностейКПересчету"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьОбновляемыхПоставляемыхРасширенийВОбластяхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьОбновляемыхПоставляемыхРасширенийВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьОбновляемыхПоставляемыхРасширенийВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьОбновляемыхПоставляемыхРасширенийВОбластяхДанных"

	Дано Я открываю основную форму регистра сведений "ОчередьОбновляемыхПоставляемыхРасширенийВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьОбновляемыхПоставляемыхРасширенийВОбластяхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьОбработкиКадровыхДанныхФСС" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьОбработкиКадровыхДанныхФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьОбработкиКадровыхДанныхФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьОбработкиКадровыхДанныхФСС"

	Дано Я открываю основную форму регистра сведений "ОчередьОбработкиКадровыхДанныхФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьОбработкиКадровыхДанныхФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПередачиДанныхГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПередачиДанныхГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПередачиДанныхГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПередачиДанныхГИСМ"

	Дано Я открываю основную форму регистра сведений "ОчередьПередачиДанныхГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПередачиДанныхГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПередачиДанныхЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПередачиДанныхЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПередачиДанныхЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПередачиДанныхЕГАИС"

	Дано Я открываю основную форму регистра сведений "ОчередьПередачиДанныхЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПередачиДанныхЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПереоформленияРасходныхОрдеров" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПереоформленияРасходныхОрдеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПереоформленияРасходныхОрдеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПереоформленияРасходныхОрдеров"

	Дано Я открываю основную форму регистра сведений "ОчередьПереоформленияРасходныхОрдеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПереоформленияРасходныхОрдеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПолученияДанныхГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПолученияДанныхГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПолученияДанныхГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПолученияДанныхГИСМ"

	Дано Я открываю основную форму регистра сведений "ОчередьПолученияДанныхГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПолученияДанныхГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПолученияКвитанцийОФиксацииГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПолученияКвитанцийОФиксацииГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПолученияКвитанцийОФиксацииГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПолученияКвитанцийОФиксацииГИСМ"

	Дано Я открываю основную форму регистра сведений "ОчередьПолученияКвитанцийОФиксацииГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПолученияКвитанцийОФиксацииГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПроизводственныхОпераций" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПроизводственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПроизводственныхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПроизводственныхОпераций"

	Дано Я открываю основную форму регистра сведений "ОчередьПроизводственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПроизводственныхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьРасчетаДефицитовПоЭтапам" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьРасчетаДефицитовПоЭтапам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасчетаДефицитовПоЭтапам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьРасчетаДефицитовПоЭтапам"

	Дано Я открываю основную форму регистра сведений "ОчередьРасчетаДефицитовПоЭтапам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасчетаДефицитовПоЭтапам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьРасчетаПланаПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьРасчетаПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасчетаПланаПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьРасчетаПланаПроизводства"

	Дано Я открываю основную форму регистра сведений "ОчередьРасчетаПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасчетаПланаПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьРасчетаПлановыхКалькуляций" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьРасчетаПлановыхКалькуляций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасчетаПлановыхКалькуляций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьРасчетаПлановыхКалькуляций"

	Дано Я открываю основную форму регистра сведений "ОчередьРасчетаПлановыхКалькуляций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасчетаПлановыхКалькуляций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьРасширенийДляОповещений" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьРасширенийДляОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасширенийДляОповещений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьРасширенийДляОповещений"

	Дано Я открываю основную форму регистра сведений "ОчередьРасширенийДляОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасширенийДляОповещений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСобытийДляОповещенийКлиентам" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСобытийДляОповещенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСобытийДляОповещенийКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСобытийДляОповещенийКлиентам"

	Дано Я открываю основную форму регистра сведений "ОчередьСобытийДляОповещенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСобытийДляОповещенийКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийВ1СДокументооборот" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийВ1СДокументооборот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВ1СДокументооборот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийВ1СДокументооборот"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийВ1СДокументооборот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВ1СДокументооборот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийВЕТИС"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийИСМП" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийИСМП"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийОбменаСОфлайнОборудованием" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийОбменаСОфлайнОборудованием"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийОбменаСОфлайнОборудованием"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийОбменаСОфлайнОборудованием"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийОбменаСОфлайнОборудованием"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийОбменаСОфлайнОборудованием"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"

	Дано Я открываю основную форму регистра сведений "ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЧековККТ" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьЧековККТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЧековККТ"

	Дано Я открываю основную форму регистра сведений "ОчередьЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьЧековККТ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОшибкиПередачиЭДО" 

	Дано Я открываю основную форму списка регистра сведений "ОшибкиПередачиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибкиПередачиЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОшибкиПередачиЭДО"

	Дано Я открываю основную форму регистра сведений "ОшибкиПередачиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибкиПередачиЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОшибкиРасчетаПартийИСебестоимости" 

	Дано Я открываю основную форму списка регистра сведений "ОшибкиРасчетаПартийИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибкиРасчетаПартийИСебестоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОшибкиРасчетаПартийИСебестоимости"

	Дано Я открываю основную форму регистра сведений "ОшибкиРасчетаПартийИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибкиРасчетаПартийИСебестоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОшибочныеРеквизитыКонтрагентов" 

	Дано Я открываю основную форму списка регистра сведений "ОшибочныеРеквизитыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибочныеРеквизитыКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОшибочныеРеквизитыКонтрагентов"

	Дано Я открываю основную форму регистра сведений "ОшибочныеРеквизитыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибочныеРеквизитыКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыАмортизацииНМА" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыАмортизацииНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыАмортизацииНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыАмортизацииНМА"

	Дано Я открываю основную форму регистра сведений "ПакетыАмортизацииНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыАмортизацииНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыАмортизацииОС" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыАмортизацииОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыАмортизацииОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыАмортизацииОС"

	Дано Я открываю основную форму регистра сведений "ПакетыАмортизацииОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыАмортизацииОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыДляОтправки" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыДляОтправки"

	Дано Я открываю основную форму регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыДокументовЭДО" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДокументовЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыДокументовЭДО"

	Дано Я открываю основную форму регистра сведений "ПакетыДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДокументовЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыИнформацииПриЗапуске" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыИнформацииПриЗапуске"

	Дано Я открываю основную форму регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыОтчетности" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыОтчетности"

	Дано Я открываю основную форму регистра сведений "ПакетыОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыПогашенияСтоимостиТМЦ" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыПогашенияСтоимостиТМЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыПогашенияСтоимостиТМЦ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыПогашенияСтоимостиТМЦ"

	Дано Я открываю основную форму регистра сведений "ПакетыПогашенияСтоимостиТМЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыПогашенияСтоимостиТМЦ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыАмортизацииНМАБУ" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыАмортизацииНМАБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыАмортизацииНМАБУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыАмортизацииНМАБУ"

	Дано Я открываю основную форму регистра сведений "ПараметрыАмортизацииНМАБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыАмортизацииНМАБУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыАмортизацииНМАУУ" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыАмортизацииНМАУУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыАмортизацииНМАУУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыАмортизацииНМАУУ"

	Дано Я открываю основную форму регистра сведений "ПараметрыАмортизацииНМАУУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыАмортизацииНМАУУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыАмортизацииОСБУ" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыАмортизацииОСБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыАмортизацииОСБУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыАмортизацииОСБУ"

	Дано Я открываю основную форму регистра сведений "ПараметрыАмортизацииОСБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыАмортизацииОСБУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыАмортизацииОСУУ" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыАмортизацииОСУУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыАмортизацииОСУУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыАмортизацииОСУУ"

	Дано Я открываю основную форму регистра сведений "ПараметрыАмортизацииОСУУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыАмортизацииОСУУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"

	Дано Я открываю основную форму регистра сведений "ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыМежоперационныхПереходов" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыМежоперационныхПереходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыМежоперационныхПереходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыМежоперационныхПереходов"

	Дано Я открываю основную форму регистра сведений "ПараметрыМежоперационныхПереходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыМежоперационныхПереходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыНазначенияСпецификаций" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыНазначенияСпецификаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыНазначенияСпецификаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыНазначенияСпецификаций"

	Дано Я открываю основную форму регистра сведений "ПараметрыНазначенияСпецификаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыНазначенияСпецификаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ПараметрыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыОграниченияДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыОграниченияДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОграниченияДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыОграниченияДоступа"

	Дано Я открываю основную форму регистра сведений "ПараметрыОграниченияДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОграниченияДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыПериодовСтажаПФР" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыПериодовСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыПериодовСтажаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыПериодовСтажаПФР"

	Дано Я открываю основную форму регистра сведений "ПараметрыПериодовСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыПериодовСтажаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыПериодовСтажаПФРИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыПериодовСтажаПФРИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыПериодовСтажаПФРИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыПериодовСтажаПФРИспр"

	Дано Я открываю основную форму регистра сведений "ПараметрыПериодовСтажаПФРИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыПериодовСтажаПФРИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыРаботыВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРаботыВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыРаботыПрограммы" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыПрограммы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРаботыПрограммы"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыПрограммы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыТорговыхТочек" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыТорговыхТочек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыТорговыхТочек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыТорговыхТочек"

	Дано Я открываю основную форму регистра сведений "ПараметрыТорговыхТочек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыТорговыхТочек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыЦелевогоФинансированияНМА" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыЦелевогоФинансированияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЦелевогоФинансированияНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыЦелевогоФинансированияНМА"

	Дано Я открываю основную форму регистра сведений "ПараметрыЦелевогоФинансированияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЦелевогоФинансированияНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыЦелевогоФинансированияОС" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыЦелевогоФинансированияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЦелевогоФинансированияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыЦелевогоФинансированияОС"

	Дано Я открываю основную форму регистра сведений "ПараметрыЦелевогоФинансированияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЦелевогоФинансированияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартнерыСегмента" 

	Дано Я открываю основную форму списка регистра сведений "ПартнерыСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПартнерыСегмента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартнерыСегмента"

	Дано Я открываю основную форму регистра сведений "ПартнерыСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПартнерыСегмента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПервоначальныеСведенияНМА" 

	Дано Я открываю основную форму списка регистра сведений "ПервоначальныеСведенияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПервоначальныеСведенияНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПервоначальныеСведенияНМА"

	Дано Я открываю основную форму регистра сведений "ПервоначальныеСведенияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПервоначальныеСведенияНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПервоначальныеСведенияОС" 

	Дано Я открываю основную форму списка регистра сведений "ПервоначальныеСведенияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПервоначальныеСведенияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПервоначальныеСведенияОС"

	Дано Я открываю основную форму регистра сведений "ПервоначальныеСведенияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПервоначальныеСведенияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереданныеВАрендуОС" 

	Дано Я открываю основную форму списка регистра сведений "ПереданныеВАрендуОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПереданныеВАрендуОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереданныеВАрендуОС"

	Дано Я открываю основную форму регистра сведений "ПереданныеВАрендуОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПереданныеВАрендуОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "ПерерасчетЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетЗарплаты"

	Дано Я открываю основную форму регистра сведений "ПерерасчетЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетСреднегоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "ПерерасчетСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетСреднегоЗаработка"

	Дано Я открываю основную форму регистра сведений "ПерерасчетСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетУдержаний" 

	Дано Я открываю основную форму списка регистра сведений "ПерерасчетУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетУдержаний"

	Дано Я открываю основную форму регистра сведений "ПерерасчетУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереходыВВебВерсиюСПАРК" 

	Дано Я открываю основную форму списка регистра сведений "ПереходыВВебВерсиюСПАРК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПереходыВВебВерсиюСПАРК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереходыВВебВерсиюСПАРК"

	Дано Я открываю основную форму регистра сведений "ПереходыВВебВерсиюСПАРК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПереходыВВебВерсиюСПАРК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодическиеЗначенияПоказателейРасчетаЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "ПериодическиеЗначенияПоказателейРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодическиеЗначенияПоказателейРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодическиеЗначенияПоказателейРасчетаЗарплаты"

	Дано Я открываю основную форму регистра сведений "ПериодическиеЗначенияПоказателейРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодическиеЗначенияПоказателейРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодическиеСвойстваНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ПериодическиеСвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодическиеСвойстваНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодическиеСвойстваНовостей"

	Дано Я открываю основную форму регистра сведений "ПериодическиеСвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодическиеСвойстваНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыАктуальностиОбъектовЭксплуатации" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыАктуальностиОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыАктуальностиОбъектовЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыАктуальностиОбъектовЭксплуатации"

	Дано Я открываю основную форму регистра сведений "ПериодыАктуальностиОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыАктуальностиОбъектовЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыБолезниУходаЗаДетьми" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыБолезниУходаЗаДетьми"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыБолезниУходаЗаДетьми"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыБолезниУходаЗаДетьми"

	Дано Я открываю основную форму регистра сведений "ПериодыБолезниУходаЗаДетьми"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыБолезниУходаЗаДетьми"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыДействияДоговоровГражданскоПравовогоХарактера" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыДействияДоговоровГражданскоПравовогоХарактера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыДействияДоговоровГражданскоПравовогоХарактера"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыДействияДоговоровГражданскоПравовогоХарактера"

	Дано Я открываю основную форму регистра сведений "ПериодыДействияДоговоровГражданскоПравовогоХарактера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыДействияДоговоровГражданскоПравовогоХарактера"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыНерабочихДнейКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыНерабочихДнейКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыНерабочихДнейКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыНерабочихДнейКалендаря"

	Дано Я открываю основную форму регистра сведений "ПериодыНерабочихДнейКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыНерабочихДнейКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыОплатыНерабочихДней" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыОплатыНерабочихДней"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыОплатыНерабочихДней"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыОплатыНерабочихДней"

	Дано Я открываю основную форму регистра сведений "ПериодыОплатыНерабочихДней"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыОплатыНерабочихДней"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыРаботыСКоронавирусом" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыРаботыСКоронавирусом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыРаботыСКоронавирусом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыРаботыСКоронавирусом"

	Дано Я открываю основную форму регистра сведений "ПериодыРаботыСКоронавирусом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыРаботыСКоронавирусом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыСтажаПФР" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыСтажаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыСтажаПФР"

	Дано Я открываю основную форму регистра сведений "ПериодыСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыСтажаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПечатныеБланкиРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "ПечатныеБланкиРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПечатныеБланкиРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПечатныеБланкиРегламентированныхОтчетов"

	Дано Я открываю основную форму регистра сведений "ПечатныеБланкиРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПечатныеБланкиРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПКУСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПКУСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПКУСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПКУСотрудников"

	Дано Я открываю основную форму регистра сведений "ПКУСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПКУСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПКУСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПКУСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПКУСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПКУСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ПКУСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПКУСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланированиеЗагрузкиВидовРабочихЦентров" 

	Дано Я открываю основную форму списка регистра сведений "ПланированиеЗагрузкиВидовРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланированиеЗагрузкиВидовРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланированиеЗагрузкиВидовРабочихЦентров"

	Дано Я открываю основную форму регистра сведений "ПланированиеЗагрузкиВидовРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланированиеЗагрузкиВидовРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеАвансы" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеАвансы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеАвансы"

	Дано Я открываю основную форму регистра сведений "ПлановыеАвансы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеАвансыИнтервальный" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеАвансыИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансыИнтервальный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеАвансыИнтервальный"

	Дано Я открываю основную форму регистра сведений "ПлановыеАвансыИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансыИнтервальный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеАвансыИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеАвансыИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансыИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеАвансыИспр"

	Дано Я открываю основную форму регистра сведений "ПлановыеАвансыИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансыИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеЕжегодныеОтпуска" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеЕжегодныеОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеЕжегодныеОтпуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеЕжегодныеОтпуска"

	Дано Я открываю основную форму регистра сведений "ПлановыеЕжегодныеОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеЕжегодныеОтпуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисления" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисления"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисленияИнтервальный" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисленияИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияИнтервальный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисленияИнтервальный"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисленияИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияИнтервальный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисленияИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисленияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисленияИспр"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисленияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисленияПоДоговорам" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисленияПоДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияПоДоговорам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисленияПоДоговорам"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисленияПоДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияПоДоговорам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисленияПросмотрОрганизации" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисленияПросмотрОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияПросмотрОрганизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисленияПросмотрОрганизации"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисленияПросмотрОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияПросмотрОрганизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисленияПросмотрФизическиеЛица" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисленияПросмотрФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияПросмотрФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисленияПросмотрФизическиеЛица"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисленияПросмотрФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияПросмотрФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисленияРедактированиеОрганизации" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисленияРедактированиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияРедактированиеОрганизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисленияРедактированиеОрганизации"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисленияРедактированиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияРедактированиеОрганизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисленияРедактированиеФизическиеЛица" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисленияРедактированиеФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияРедактированиеФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисленияРедактированиеФизическиеЛица"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисленияРедактированиеФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияРедактированиеФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеУдержания" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеУдержания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеУдержания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеУдержания"

	Дано Я открываю основную форму регистра сведений "ПлановыеУдержания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеУдержания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеУдержанияИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеУдержанияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеУдержанияИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеУдержанияИспр"

	Дано Я открываю основную форму регистра сведений "ПлановыеУдержанияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеУдержанияИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыйФОТ" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыйФОТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыйФОТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыйФОТ"

	Дано Я открываю основную форму регистра сведений "ПлановыйФОТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыйФОТ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыйФОТИтоги" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыйФОТИтоги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыйФОТИтоги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыйФОТИтоги"

	Дано Я открываю основную форму регистра сведений "ПлановыйФОТИтоги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыйФОТИтоги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланРемонтов" 

	Дано Я открываю основную форму списка регистра сведений "ПланРемонтов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланРемонтов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланРемонтов"

	Дано Я открываю основную форму регистра сведений "ПланРемонтов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланРемонтов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланСинхронизацииДокументовEDI" 

	Дано Я открываю основную форму списка регистра сведений "ПланСинхронизацииДокументовEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланСинхронизацииДокументовEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланСинхронизацииДокументовEDI"

	Дано Я открываю основную форму регистра сведений "ПланСинхронизацииДокументовEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланСинхронизацииДокументовEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыСчетовМеждународногоУчетаОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ПланыСчетовМеждународногоУчетаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланыСчетовМеждународногоУчетаОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыСчетовМеждународногоУчетаОрганизаций"

	Дано Я открываю основную форму регистра сведений "ПланыСчетовМеждународногоУчетаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланыСчетовМеждународногоУчетаОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлатежныеДокументыПеречисленияЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "ПлатежныеДокументыПеречисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлатежныеДокументыПеречисленияЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлатежныеДокументыПеречисленияЗарплаты"

	Дано Я открываю основную форму регистра сведений "ПлатежныеДокументыПеречисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлатежныеДокументыПеречисленияЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоддерживаемыеФорматыЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ПоддерживаемыеФорматыЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоддерживаемыеФорматыЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоддерживаемыеФорматыЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "ПоддерживаемыеФорматыЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоддерживаемыеФорматыЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодписанныеПечатныеФормы" 

	Дано Я открываю основную форму списка регистра сведений "ПодписанныеПечатныеФормы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписанныеПечатныеФормы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодписанныеПечатныеФормы"

	Дано Я открываю основную форму регистра сведений "ПодписанныеПечатныеФормы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписанныеПечатныеФормы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодписиСертификатовДокументооборота" 

	Дано Я открываю основную форму списка регистра сведений "ПодписиСертификатовДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписиСертификатовДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодписиСертификатовДокументооборота"

	Дано Я открываю основную форму регистра сведений "ПодписиСертификатовДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписиСертификатовДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодпискиНаУведомленияОбЭЛН" 

	Дано Я открываю основную форму списка регистра сведений "ПодпискиНаУведомленияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиНаУведомленияОбЭЛН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодпискиНаУведомленияОбЭЛН"

	Дано Я открываю основную форму регистра сведений "ПодпискиНаУведомленияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиНаУведомленияОбЭЛН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодпискиПолучателей" 

	Дано Я открываю основную форму списка регистра сведений "ПодпискиПолучателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиПолучателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодпискиПолучателей"

	Дано Я открываю основную форму регистра сведений "ПодпискиПолучателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиПолучателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодписываемыеВидыЭД" 

	Дано Я открываю основную форму списка регистра сведений "ПодписываемыеВидыЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписываемыеВидыЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодписываемыеВидыЭД"

	Дано Я открываю основную форму регистра сведений "ПодписываемыеВидыЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписываемыеВидыЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодразделенияЗаПределамиРФ" 

	Дано Я открываю основную форму списка регистра сведений "ПодразделенияЗаПределамиРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодразделенияЗаПределамиРФ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодразделенияЗаПределамиРФ"

	Дано Я открываю основную форму регистра сведений "ПодразделенияЗаПределамиРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодразделенияЗаПределамиРФ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодтверждениеОплатыНДСВБюджет" 

	Дано Я открываю основную форму списка регистра сведений "ПодтверждениеОплатыНДСВБюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодтверждениеОплатыНДСВБюджет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодтверждениеОплатыНДСВБюджет"

	Дано Я открываю основную форму регистра сведений "ПодтверждениеОплатыНДСВБюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодтверждениеОплатыНДСВБюджет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодчиненияУзловОбъектовЭксплуатации" 

	Дано Я открываю основную форму списка регистра сведений "ПодчиненияУзловОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодчиненияУзловОбъектовЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодчиненияУзловОбъектовЭксплуатации"

	Дано Я открываю основную форму регистра сведений "ПодчиненияУзловОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодчиненияУзловОбъектовЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодчиненностьПодразделенийОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ПодчиненностьПодразделенийОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодчиненностьПодразделенийОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодчиненностьПодразделенийОрганизаций"

	Дано Я открываю основную форму регистра сведений "ПодчиненностьПодразделенийОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодчиненностьПодразделенийОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодчиненностьСтруктурныхЕдиниц" 

	Дано Я открываю основную форму списка регистра сведений "ПодчиненностьСтруктурныхЕдиниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодчиненностьСтруктурныхЕдиниц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодчиненностьСтруктурныхЕдиниц"

	Дано Я открываю основную форму регистра сведений "ПодчиненностьСтруктурныхЕдиниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодчиненностьСтруктурныхЕдиниц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоказателиСовокупнойТарифнойСтавкиСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПоказателиСовокупнойТарифнойСтавкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоказателиСовокупнойТарифнойСтавкиСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоказателиСовокупнойТарифнойСтавкиСотрудников"

	Дано Я открываю основную форму регистра сведений "ПоказателиСовокупнойТарифнойСтавкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоказателиСовокупнойТарифнойСтавкиСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоложенныеВидыЕжегодныхОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "ПоложенныеВидыЕжегодныхОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоложенныеВидыЕжегодныхОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоложенныеВидыЕжегодныхОтпусков"

	Дано Я открываю основную форму регистра сведений "ПоложенныеВидыЕжегодныхОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоложенныеВидыЕжегодныхОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоложенныеВидыЕжегодныхОтпусковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПоложенныеВидыЕжегодныхОтпусковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоложенныеВидыЕжегодныхОтпусковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоложенныеВидыЕжегодныхОтпусковИспр"

	Дано Я открываю основную форму регистра сведений "ПоложенныеВидыЕжегодныхОтпусковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоложенныеВидыЕжегодныхОтпусковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПолучателиУдержаний" 

	Дано Я открываю основную форму списка регистра сведений "ПолучателиУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПолучателиУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПолучателиУдержаний"

	Дано Я открываю основную форму регистра сведений "ПолучателиУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПолучателиУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "ПользователиБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиБизнесСеть"

	Дано Я открываю основную форму регистра сведений "ПользователиБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиКОбновлениюУведомлений" 

	Дано Я открываю основную форму списка регистра сведений "ПользователиКОбновлениюУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиКОбновлениюУведомлений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиКОбновлениюУведомлений"

	Дано Я открываю основную форму регистра сведений "ПользователиКОбновлениюУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиКОбновлениюУведомлений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиУчетныхЗаписейДокументооборота" 

	Дано Я открываю основную форму списка регистра сведений "ПользователиУчетныхЗаписейДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиУчетныхЗаписейДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиУчетныхЗаписейДокументооборота"

	Дано Я открываю основную форму регистра сведений "ПользователиУчетныхЗаписейДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиУчетныхЗаписейДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиДоступаКОбработкам" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиДоступаКОбработкам"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПооперационноеРасписание" 

	Дано Я открываю основную форму списка регистра сведений "ПооперационноеРасписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПооперационноеРасписание"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПооперационноеРасписание"

	Дано Я открываю основную форму регистра сведений "ПооперационноеРасписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПооперационноеРасписание"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПооперационноеРасписание2_2" 

	Дано Я открываю основную форму списка регистра сведений "ПооперационноеРасписание2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПооперационноеРасписание2_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПооперационноеРасписание2_2"

	Дано Я открываю основную форму регистра сведений "ПооперационноеРасписание2_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПооперационноеРасписание2_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокВыплатыДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокВыплатыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокВыплатыДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокВыплатыДокументов"

	Дано Я открываю основную форму регистра сведений "ПорядокВыплатыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокВыплатыДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокОтраженияНаСчетахУчета" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокОтраженияНаСчетахУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокОтраженияНаСчетахУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокОтраженияНаСчетахУчета"

	Дано Я открываю основную форму регистра сведений "ПорядокОтраженияНаСчетахУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокОтраженияНаСчетахУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокОтраженияПрочихОпераций" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокОтраженияПрочихОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокОтраженияПрочихОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокОтраженияПрочихОпераций"

	Дано Я открываю основную форму регистра сведений "ПорядокОтраженияПрочихОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокОтраженияПрочихОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокПлатежногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокПлатежногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокПлатежногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокПлатежногоКалендаря"

	Дано Я открываю основную форму регистра сведений "ПорядокПлатежногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокПлатежногоКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"

	Дано Я открываю основную форму регистра сведений "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокУплатыНалоговНаМестах" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокУплатыНалоговНаМестах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУплатыНалоговНаМестах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокУплатыНалоговНаМестах"

	Дано Я открываю основную форму регистра сведений "ПорядокУплатыНалоговНаМестах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУплатыНалоговНаМестах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокУчетаНМА" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокУчетаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокУчетаНМА"

	Дано Я открываю основную форму регистра сведений "ПорядокУчетаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокУчетаНМАБУ" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокУчетаНМАБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаНМАБУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокУчетаНМАБУ"

	Дано Я открываю основную форму регистра сведений "ПорядокУчетаНМАБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаНМАБУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокУчетаНМАУУ" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокУчетаНМАУУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаНМАУУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокУчетаНМАУУ"

	Дано Я открываю основную форму регистра сведений "ПорядокУчетаНМАУУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаНМАУУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокУчетаОС" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокУчетаОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокУчетаОС"

	Дано Я открываю основную форму регистра сведений "ПорядокУчетаОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокУчетаОСБУ" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокУчетаОСБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаОСБУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокУчетаОСБУ"

	Дано Я открываю основную форму регистра сведений "ПорядокУчетаОСБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаОСБУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокУчетаОСУУ" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокУчетаОСУУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаОСУУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокУчетаОСУУ"

	Дано Я открываю основную форму регистра сведений "ПорядокУчетаОСУУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокУчетаОСУУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоследнийОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ПоследнийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоследнийОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоследнийОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ПоследнийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоследнийОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоследняяПопыткаРасшифровкиТранспортногоСообщения" 

	Дано Я открываю основную форму списка регистра сведений "ПоследняяПопыткаРасшифровкиТранспортногоСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоследняяПопыткаРасшифровкиТранспортногоСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоследняяПопыткаРасшифровкиТранспортногоСообщения"

	Дано Я открываю основную форму регистра сведений "ПоследняяПопыткаРасшифровкиТранспортногоСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоследняяПопыткаРасшифровкиТранспортногоСообщения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДанныеТребующиеОбработки" 

	Дано Я открываю основную форму списка регистра сведений "ПоставляемыеДанныеТребующиеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДанныеТребующиеОбработки"

	Дано Я открываю основную форму регистра сведений "ПоставляемыеДанныеТребующиеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДанныеТребующиеОбработкиВОбластях" 

	Дано Я открываю основную форму списка регистра сведений "ПоставляемыеДанныеТребующиеОбработкиВОбластях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработкиВОбластях"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДанныеТребующиеОбработкиВОбластях"

	Дано Я открываю основную форму регистра сведений "ПоставляемыеДанныеТребующиеОбработкиВОбластях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработкиВОбластях"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПотокиОбновления" 

	Дано Я открываю основную форму списка регистра сведений "ПотокиОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПотокиОбновления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПотокиОбновления"

	Дано Я открываю основную форму регистра сведений "ПотокиОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПотокиОбновления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПотребностьВСпециалистахНаПериодМобилизации" 

	Дано Я открываю основную форму списка регистра сведений "ПотребностьВСпециалистахНаПериодМобилизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПотребностьВСпециалистахНаПериодМобилизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПотребностьВСпециалистахНаПериодМобилизации"

	Дано Я открываю основную форму регистра сведений "ПотребностьВСпециалистахНаПериодМобилизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПотребностьВСпециалистахНаПериодМобилизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПраваДоступаПользователейВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ПраваДоступаПользователейВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваДоступаПользователейВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПраваДоступаПользователейВЕТИС"

	Дано Я открываю основную форму регистра сведений "ПраваДоступаПользователейВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваДоступаПользователейВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПраваРолей" 

	Дано Я открываю основную форму списка регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПраваРолей"

	Дано Я открываю основную форму регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаДляОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаДляОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаДляОбменаДанными"

	Дано Я открываю основную форму регистра сведений "ПравилаДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаДляОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаОбработкиЗаявокСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаОбработкиЗаявокСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаОбработкиЗаявокСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОбработкиЗаявокСотрудников"

	Дано Я открываю основную форму регистра сведений "ПравилаОбработкиЗаявокСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаОбработкиЗаявокСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаОтправкиОтчетностиПоФизЛицам" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаОтправкиОтчетностиПоФизЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаОтправкиОтчетностиПоФизЛицам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОтправкиОтчетностиПоФизЛицам"

	Дано Я открываю основную форму регистра сведений "ПравилаОтправкиОтчетностиПоФизЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаОтправкиОтчетностиПоФизЛицам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаОтраженияВМеждународномУчете" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаОтраженияВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаОтраженияВМеждународномУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОтраженияВМеждународномУчете"

	Дано Я открываю основную форму регистра сведений "ПравилаОтраженияВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаОтраженияВМеждународномУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаПреобразованияФорматов" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаПреобразованияФорматов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаПреобразованияФорматов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаПреобразованияФорматов"

	Дано Я открываю основную форму регистра сведений "ПравилаПреобразованияФорматов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаПреобразованияФорматов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаПубликацииКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаПубликацииКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаПубликацииКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаПубликацииКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ПравилаПубликацииКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаПубликацииКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаРазмещенияТоваровВЯчейках" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаРазмещенияТоваровВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаРазмещенияТоваровВЯчейках"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаРазмещенияТоваровВЯчейках"

	Дано Я открываю основную форму регистра сведений "ПравилаРазмещенияТоваровВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаРазмещенияТоваровВЯчейках"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаУточненияСчетовВМеждународномУчете" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаУточненияСчетовВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаУточненияСчетовВМеждународномУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаУточненияСчетовВМеждународномУчете"

	Дано Я открываю основную форму регистра сведений "ПравилаУточненияСчетовВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаУточненияСчетовВМеждународномУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредварительныеПерерасчеты" 

	Дано Я открываю основную форму списка регистра сведений "ПредварительныеПерерасчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредварительныеПерерасчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредварительныеПерерасчеты"

	Дано Я открываю основную форму регистра сведений "ПредварительныеПерерасчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредварительныеПерерасчеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредельнаяВеличинаБазыСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "ПредельнаяВеличинаБазыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредельнаяВеличинаБазыСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредельнаяВеличинаБазыСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "ПредельнаяВеличинаБазыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредельнаяВеличинаБазыСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредельныеСуммыУдержанийСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПредельныеСуммыУдержанийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредельныеСуммыУдержанийСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредельныеСуммыУдержанийСотрудников"

	Дано Я открываю основную форму регистра сведений "ПредельныеСуммыУдержанийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредельныеСуммыУдержанийСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредметыПапкиВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредметыПапкиВзаимодействий"

	Дано Я открываю основную форму регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредоставлениеСоциальныхВычетовУРаботодателя" 

	Дано Я открываю основную форму списка регистра сведений "ПредоставлениеСоциальныхВычетовУРаботодателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредоставлениеСоциальныхВычетовУРаботодателя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредоставлениеСоциальныхВычетовУРаботодателя"

	Дано Я открываю основную форму регистра сведений "ПредоставлениеСоциальныхВычетовУРаботодателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредоставлениеСоциальныхВычетовУРаботодателя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредприятияЗонОтветственностиВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ПредприятияЗонОтветственностиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредприятияЗонОтветственностиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредприятияЗонОтветственностиВЕТИС"

	Дано Я открываю основную форму регистра сведений "ПредприятияЗонОтветственностиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредприятияЗонОтветственностиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредставленияОснованийУвольнения" 

	Дано Я открываю основную форму списка регистра сведений "ПредставленияОснованийУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредставленияОснованийУвольнения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредставленияОснованийУвольнения"

	Дано Я открываю основную форму регистра сведений "ПредставленияОснованийУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредставленияОснованийУвольнения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПривязкаНовостейКМетаданным" 

	Дано Я открываю основную форму списка регистра сведений "ПривязкаНовостейКМетаданным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПривязкаНовостейКМетаданным"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПривязкаНовостейКМетаданным"

	Дано Я открываю основную форму регистра сведений "ПривязкаНовостейКМетаданным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПривязкаНовостейКМетаданным"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриглашенияКОбменуЭлектроннымиДокументами" 

	Дано Я открываю основную форму списка регистра сведений "ПриглашенияКОбменуЭлектроннымиДокументами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПриглашенияКОбменуЭлектроннымиДокументами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриглашенияКОбменуЭлектроннымиДокументами"

	Дано Я открываю основную форму регистра сведений "ПриглашенияКОбменуЭлектроннымиДокументами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПриглашенияКОбменуЭлектроннымиДокументами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПризнакиАрхивированияФайловДОСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка регистра сведений "ПризнакиАрхивированияФайловДОСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПризнакиАрхивированияФайловДОСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПризнакиАрхивированияФайловДОСКонтролирующимиОрганами"

	Дано Я открываю основную форму регистра сведений "ПризнакиАрхивированияФайловДОСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПризнакиАрхивированияФайловДОСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеПлановыхНачислений" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеПлановыхНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеПлановыхНачислений"

	Дано Я открываю основную форму регистра сведений "ПрименениеПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеПлановыхНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеПлановыхНачисленийИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеПлановыхНачисленийИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеПлановыхНачисленийИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеПлановыхНачисленийИспр"

	Дано Я открываю основную форму регистра сведений "ПрименениеПлановыхНачисленийИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеПлановыхНачисленийИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеСтандартныхВычетовПоНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеСтандартныхВычетовПоНДФЛ"

	Дано Я открываю основную форму регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеСтандартныхВычетовПоНДФЛВторичный" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛВторичный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеСтандартныхВычетовПоНДФЛВторичный"

	Дано Я открываю основную форму регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛВторичный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеСтандартныхВычетовПоНДФЛИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеСтандартныхВычетовПоНДФЛИспр"

	Дано Я открываю основную форму регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПримененияЕНВД" 

	Дано Я открываю основную форму списка регистра сведений "ПримененияЕНВД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПримененияЕНВД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПримененияЕНВД"

	Дано Я открываю основную форму регистра сведений "ПримененияЕНВД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПримененияЕНВД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПримененныеСтавкиОтложенногоНалога" 

	Дано Я открываю основную форму списка регистра сведений "ПримененныеСтавкиОтложенногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПримененныеСтавкиОтложенногоНалога"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПримененныеСтавкиОтложенногоНалога"

	Дано Я открываю основную форму регистра сведений "ПримененныеСтавкиОтложенногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПримененныеСтавкиОтложенногоНалога"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименяемыеТарифыСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "ПрименяемыеТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименяемыеТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименяемыеТарифыСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "ПрименяемыеТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименяемыеТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныИзмененияАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныИзмененияАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроблемыСостоянияСистемы" 

	Дано Я открываю основную форму списка регистра сведений "ПроблемыСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроблемыСостоянияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроблемыСостоянияСистемы"

	Дано Я открываю основную форму регистра сведений "ПроблемыСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроблемыСостоянияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрогнозныеКурсыСценариев" 

	Дано Я открываю основную форму списка регистра сведений "ПрогнозныеКурсыСценариев"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрогнозныеКурсыСценариев"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрогнозныеКурсыСценариев"

	Дано Я открываю основную форму регистра сведений "ПрогнозныеКурсыСценариев"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрогнозныеКурсыСценариев"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрогнозыРасходаУпаковок" 

	Дано Я открываю основную форму списка регистра сведений "ПрогнозыРасходаУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрогнозыРасходаУпаковок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрогнозыРасходаУпаковок"

	Дано Я открываю основную форму регистра сведений "ПрогнозыРасходаУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрогнозыРасходаУпаковок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПросмотренныеДанныеИнформационногоЦентра" 

	Дано Я открываю основную форму списка регистра сведений "ПросмотренныеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПросмотренныеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПросмотренныеДанныеИнформационногоЦентра"

	Дано Я открываю основную форму регистра сведений "ПросмотренныеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПросмотренныеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПростыеЭлектронныеПодписи" 

	Дано Я открываю основную форму списка регистра сведений "ПростыеЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПростыеЭлектронныеПодписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПростыеЭлектронныеПодписи"

	Дано Я открываю основную форму регистра сведений "ПростыеЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПростыеЭлектронныеПодписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПротоколыРасчетаПартийИСебестоимости" 

	Дано Я открываю основную форму списка регистра сведений "ПротоколыРасчетаПартийИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПротоколыРасчетаПартийИСебестоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПротоколыРасчетаПартийИСебестоимости"

	Дано Я открываю основную форму регистра сведений "ПротоколыРасчетаПартийИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПротоколыРасчетаПартийИСебестоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофессииФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ПрофессииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрофессииФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофессииФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ПрофессииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрофессииФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцентЕНВДДляУчетаЗатратНаЗарплату" 

	Дано Я открываю основную форму списка регистра сведений "ПроцентЕНВДДляУчетаЗатратНаЗарплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентЕНВДДляУчетаЗатратНаЗарплату"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцентЕНВДДляУчетаЗатратНаЗарплату"

	Дано Я открываю основную форму регистра сведений "ПроцентЕНВДДляУчетаЗатратНаЗарплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентЕНВДДляУчетаЗатратНаЗарплату"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцентныеСтавкиФинансовыхИнструментов" 

	Дано Я открываю основную форму списка регистра сведений "ПроцентныеСтавкиФинансовыхИнструментов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентныеСтавкиФинансовыхИнструментов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцентныеСтавкиФинансовыхИнструментов"

	Дано Я открываю основную форму регистра сведений "ПроцентныеСтавкиФинансовыхИнструментов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентныеСтавкиФинансовыхИнструментов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцентыСевернойНадбавкиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ПроцентыСевернойНадбавкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентыСевернойНадбавкиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцентыСевернойНадбавкиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ПроцентыСевернойНадбавкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентыСевернойНадбавкиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцессыДляЗапуска" 

	Дано Я открываю основную форму списка регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцессыДляЗапуска"

	Дано Я открываю основную форму регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПсевдонимыПредопределенныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ПсевдонимыПредопределенныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПсевдонимыПредопределенныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПсевдонимыПредопределенныхУзлов"

	Дано Я открываю основную форму регистра сведений "ПсевдонимыПредопределенныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПсевдонимыПредопределенныхУзлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПубликуемыеОбъектыКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ПубликуемыеОбъектыКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубликуемыеОбъектыКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПубликуемыеОбъектыКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ПубликуемыеОбъектыКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубликуемыеОбъектыКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПубличныеИдентификаторыСинхронизируемыхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПубличныеИдентификаторыСинхронизируемыхОбъектов"

	Дано Я открываю основную форму регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПулКодовМаркировкиСУЗ" 

	Дано Я открываю основную форму списка регистра сведений "ПулКодовМаркировкиСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПулКодовМаркировкиСУЗ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПулКодовМаркировкиСУЗ"

	Дано Я открываю основную форму регистра сведений "ПулКодовМаркировкиСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПулКодовМаркировкиСУЗ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux" 

	Дано Я открываю основную форму списка регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"

	Дано Я открываю основную форму регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеКаталогиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеКаталогиФайлов"

	Дано Я открываю основную форму регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеМестаУдержаний" 

	Дано Я открываю основную форму списка регистра сведений "РабочиеМестаУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеМестаУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеМестаУдержаний"

	Дано Я открываю основную форму регистра сведений "РабочиеМестаУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеМестаУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазмерВычетовНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "РазмерВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазмерВычетовНДФЛ"

	Дано Я открываю основную форму регистра сведений "РазмерВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерВычетовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазмерВычетовНДФЛВторичный" 

	Дано Я открываю основную форму списка регистра сведений "РазмерВычетовНДФЛВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерВычетовНДФЛВторичный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазмерВычетовНДФЛВторичный"

	Дано Я открываю основную форму регистра сведений "РазмерВычетовНДФЛВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерВычетовНДФЛВторичный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазмерыГосударственныхПособий" 

	Дано Я открываю основную форму списка регистра сведений "РазмерыГосударственныхПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерыГосударственныхПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазмерыГосударственныхПособий"

	Дано Я открываю основную форму регистра сведений "РазмерыГосударственныхПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерыГосударственныхПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазмещениеНоменклатурыПоСкладскимЯчейкам" 

	Дано Я открываю основную форму списка регистра сведений "РазмещениеНоменклатурыПоСкладскимЯчейкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмещениеНоменклатурыПоСкладскимЯчейкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазмещениеНоменклатурыПоСкладскимЯчейкам"

	Дано Я открываю основную форму регистра сведений "РазмещениеНоменклатурыПоСкладскимЯчейкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмещениеНоменклатурыПоСкладскимЯчейкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенныеДляРедактированияЛентыНовостей" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенныеДляРедактированияЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенныеДляРедактированияЛентыНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенныеДляРедактированияЛентыНовостей"

	Дано Я открываю основную форму регистра сведений "РазрешенныеДляРедактированияЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенныеДляРедактированияЛентыНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрядыКатегорииСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "РазрядыКатегорииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрядыКатегорииСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрядыКатегорииСотрудников"

	Дано Я открываю основную форму регистра сведений "РазрядыКатегорииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрядыКатегорииСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрядыКатегорииСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "РазрядыКатегорииСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрядыКатегорииСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрядыКатегорииСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "РазрядыКатегорииСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрядыКатегорииСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасписаниеРаботыРабочихЦентров" 

	Дано Я открываю основную форму списка регистра сведений "РасписаниеРаботыРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасписаниеРаботыРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасписаниеРаботыРабочихЦентров"

	Дано Я открываю основную форму регистра сведений "РасписаниеРаботыРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасписаниеРаботыРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеЗапасов" 

	Дано Я открываю основную форму списка регистра сведений "РаспределениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаспределениеЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеЗапасов"

	Дано Я открываю основную форму регистра сведений "РаспределениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаспределениеЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеПоТерриториямУсловиямТруда" 

	Дано Я открываю основную форму списка регистра сведений "РаспределениеПоТерриториямУсловиямТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаспределениеПоТерриториямУсловиямТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеПоТерриториямУсловиямТруда"

	Дано Я открываю основную форму регистра сведений "РаспределениеПоТерриториямУсловиямТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаспределениеПоТерриториямУсловиямТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеРезультатовНачислений" 

	Дано Я открываю основную форму списка регистра сведений "РаспределениеРезультатовНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаспределениеРезультатовНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеРезультатовНачислений"

	Дано Я открываю основную форму регистра сведений "РаспределениеРезультатовНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаспределениеРезультатовНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_ДляОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_ДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_ДляОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_ДляОбластиДанных"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_ДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_ДляОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_Общие" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_Общие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Общие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_Общие"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_Общие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Общие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_Пользовательские" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_Пользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Пользовательские"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_Пользовательские"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_Пользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Пользовательские"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасценкиРаботСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "РасценкиРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасценкиРаботСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасценкиРаботСотрудников"

	Дано Я открываю основную форму регистра сведений "РасценкиРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасценкиРаботСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетДефицитовПлановПоЭтапам" 

	Дано Я открываю основную форму списка регистра сведений "РасчетДефицитовПлановПоЭтапам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетДефицитовПлановПоЭтапам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетДефицитовПлановПоЭтапам"

	Дано Я открываю основную форму регистра сведений "РасчетДефицитовПлановПоЭтапам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетДефицитовПлановПоЭтапам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетДолейБазыНалогаНаПрибыль" 

	Дано Я открываю основную форму списка регистра сведений "РасчетДолейБазыНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетДолейБазыНалогаНаПрибыль"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетДолейБазыНалогаНаПрибыль"

	Дано Я открываю основную форму регистра сведений "РасчетДолейБазыНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетДолейБазыНалогаНаПрибыль"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетЗемельногоНалога" 

	Дано Я открываю основную форму списка регистра сведений "РасчетЗемельногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетЗемельногоНалога"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетЗемельногоНалога"

	Дано Я открываю основную форму регистра сведений "РасчетЗемельногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетЗемельногоНалога"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетНалогаНаИмущество" 

	Дано Я открываю основную форму списка регистра сведений "РасчетНалогаНаИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетНалогаНаИмущество"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетНалогаНаИмущество"

	Дано Я открываю основную форму регистра сведений "РасчетНалогаНаИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетНалогаНаИмущество"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетНалогаУСН" 

	Дано Я открываю основную форму списка регистра сведений "РасчетНалогаУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетНалогаУСН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетНалогаУСН"

	Дано Я открываю основную форму регистра сведений "РасчетНалогаУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетНалогаУСН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетНормированияРасходов" 

	Дано Я открываю основную форму списка регистра сведений "РасчетНормированияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетНормированияРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетНормированияРасходов"

	Дано Я открываю основную форму регистра сведений "РасчетНормированияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетНормированияРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетныеЛисткиКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "РасчетныеЛисткиКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетныеЛисткиКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетныеЛисткиКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "РасчетныеЛисткиКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетныеЛисткиКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетОтложенногоНалога" 

	Дано Я открываю основную форму списка регистра сведений "РасчетОтложенногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетОтложенногоНалога"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетОтложенногоНалога"

	Дано Я открываю основную форму регистра сведений "РасчетОтложенногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетОтложенногоНалога"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетПоказателейОтложенногоНалога" 

	Дано Я открываю основную форму списка регистра сведений "РасчетПоказателейОтложенногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетПоказателейОтложенногоНалога"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетПоказателейОтложенногоНалога"

	Дано Я открываю основную форму регистра сведений "РасчетПоказателейОтложенногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетПоказателейОтложенногоНалога"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетПризнанияРасходовНИОКР" 

	Дано Я открываю основную форму списка регистра сведений "РасчетПризнанияРасходовНИОКР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетПризнанияРасходовНИОКР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетПризнанияРасходовНИОКР"

	Дано Я открываю основную форму регистра сведений "РасчетПризнанияРасходовНИОКР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетПризнанияРасходовНИОКР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетРазницВОценкеАктивовИОбязательств" 

	Дано Я открываю основную форму списка регистра сведений "РасчетРазницВОценкеАктивовИОбязательств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРазницВОценкеАктивовИОбязательств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетРазницВОценкеАктивовИОбязательств"

	Дано Я открываю основную форму регистра сведений "РасчетРазницВОценкеАктивовИОбязательств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРазницВОценкеАктивовИОбязательств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетРасходовПоАренде" 

	Дано Я открываю основную форму списка регистра сведений "РасчетРасходовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРасходовПоАренде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетРасходовПоАренде"

	Дано Я открываю основную форму регистра сведений "РасчетРасходовПоАренде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРасходовПоАренде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетРезерваОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "РасчетРезерваОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРезерваОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетРезерваОтпусков"

	Дано Я открываю основную форму регистра сведений "РасчетРезерваОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРезерваОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетРезервовПоСомнительнымДолгам" 

	Дано Я открываю основную форму списка регистра сведений "РасчетРезервовПоСомнительнымДолгам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРезервовПоСомнительнымДолгам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетРезервовПоСомнительнымДолгам"

	Дано Я открываю основную форму регистра сведений "РасчетРезервовПоСомнительнымДолгам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРезервовПоСомнительнымДолгам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетСебестоимостиДатыКорректировокОстатков" 

	Дано Я открываю основную форму списка регистра сведений "РасчетСебестоимостиДатыКорректировокОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСебестоимостиДатыКорректировокОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетСебестоимостиДатыКорректировокОстатков"

	Дано Я открываю основную форму регистра сведений "РасчетСебестоимостиДатыКорректировокОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСебестоимостиДатыКорректировокОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетСтавкиНалогаНаПрибыльЗаМесяц" 

	Дано Я открываю основную форму списка регистра сведений "РасчетСтавкиНалогаНаПрибыльЗаМесяц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСтавкиНалогаНаПрибыльЗаМесяц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетСтавкиНалогаНаПрибыльЗаМесяц"

	Дано Я открываю основную форму регистра сведений "РасчетСтавкиНалогаНаПрибыльЗаМесяц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСтавкиНалогаНаПрибыльЗаМесяц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетСтоимостиНалоговыхАктивовИОбязательств" 

	Дано Я открываю основную форму списка регистра сведений "РасчетСтоимостиНалоговыхАктивовИОбязательств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСтоимостиНалоговыхАктивовИОбязательств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетСтоимостиНалоговыхАктивовИОбязательств"

	Дано Я открываю основную форму регистра сведений "РасчетСтоимостиНалоговыхАктивовИОбязательств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСтоимостиНалоговыхАктивовИОбязательств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль" 

	Дано Я открываю основную форму списка регистра сведений "РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль"

	Дано Я открываю основную форму регистра сведений "РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетТранспортногоНалога" 

	Дано Я открываю основную форму списка регистра сведений "РасчетТранспортногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетТранспортногоНалога"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетТранспортногоНалога"

	Дано Я открываю основную форму регистра сведений "РасчетТранспортногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетТранспортногоНалога"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетЭффектаИзмененияСтавокНалогаНаПрибыль" 

	Дано Я открываю основную форму списка регистра сведений "РасчетЭффектаИзмененияСтавокНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетЭффектаИзмененияСтавокНалогаНаПрибыль"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетЭффектаИзмененияСтавокНалогаНаПрибыль"

	Дано Я открываю основную форму регистра сведений "РасчетЭффектаИзмененияСтавокНалогаНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетЭффектаИзмененияСтавокНалогаНаПрибыль"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацииВНалоговомОргане" 

	Дано Я открываю основную форму списка регистра сведений "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацииВНалоговомОргане"

	Дано Я открываю основную форму регистра сведений "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияЗемельныхУчастков" 

	Дано Я открываю основную форму списка регистра сведений "РегистрацияЗемельныхУчастков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегистрацияЗемельныхУчастков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияЗемельныхУчастков"

	Дано Я открываю основную форму регистра сведений "РегистрацияЗемельныхУчастков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегистрацияЗемельныхУчастков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияТранспортныхСредств" 

	Дано Я открываю основную форму списка регистра сведений "РегистрацияТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегистрацияТранспортныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияТранспортныхСредств"

	Дано Я открываю основную форму регистра сведений "РегистрацияТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегистрацияТранспортныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентныеЗаданияЗакрытияМесяца" 

	Дано Я открываю основную форму списка регистра сведений "РегламентныеЗаданияЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегламентныеЗаданияЗакрытияМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентныеЗаданияЗакрытияМесяца"

	Дано Я открываю основную форму регистра сведений "РегламентныеЗаданияЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегламентныеЗаданияЗакрытияМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РедактируемыеРеквизитыКодаДоходаНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "РедактируемыеРеквизитыКодаДоходаНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РедактируемыеРеквизитыКодаДоходаНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РедактируемыеРеквизитыКодаДоходаНДФЛ"

	Дано Я открываю основную форму регистра сведений "РедактируемыеРеквизитыКодаДоходаНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РедактируемыеРеквизитыКодаДоходаНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрДокументов" 

	Дано Я открываю основную форму списка регистра сведений "РеестрДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрДокументов"

	Дано Я открываю основную форму регистра сведений "РеестрДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрКадровыхПриказов" 

	Дано Я открываю основную форму списка регистра сведений "РеестрКадровыхПриказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрКадровыхПриказов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрКадровыхПриказов"

	Дано Я открываю основную форму регистра сведений "РеестрКадровыхПриказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрКадровыхПриказов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрКадровыхПриказовИспр" 

	Дано Я открываю основную форму списка регистра сведений "РеестрКадровыхПриказовИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрКадровыхПриказовИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрКадровыхПриказовИспр"

	Дано Я открываю основную форму регистра сведений "РеестрКадровыхПриказовИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрКадровыхПриказовИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "РеестрОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрОтпусков"

	Дано Я открываю основную форму регистра сведений "РеестрОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулей" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулей"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулейВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулейВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулейОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулейОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулейОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулейОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатОбменаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "РезультатОбменаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатОбменаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатОбменаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "РезультатОбменаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатОбменаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыОбменаДанными"

	Дано Я открываю основную форму регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыПроверкиСредствамиККТИСМП" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыПроверкиСредствамиККТИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыПроверкиСредствамиККТИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыПроверкиСредствамиККТИСМП"

	Дано Я открываю основную форму регистра сведений "РезультатыПроверкиСредствамиККТИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыПроверкиСредствамиККТИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РейтингАктивностиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РейтингАктивностиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеквизитыПлатежныхДокументовПеречисленияЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "РеквизитыПлатежныхДокументовПеречисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыПлатежныхДокументовПеречисленияЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеквизитыПлатежныхДокументовПеречисленияЗарплаты"

	Дано Я открываю основную форму регистра сведений "РеквизитыПлатежныхДокументовПеречисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыПлатежныхДокументовПеречисленияЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей" 

	Дано Я открываю основную форму списка регистра сведений "РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"

	Дано Я открываю основную форму регистра сведений "РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеквизитыШтрихкодовУпаковокТоваровВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "РеквизитыШтрихкодовУпаковокТоваровВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыШтрихкодовУпаковокТоваровВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеквизитыШтрихкодовУпаковокТоваровВЕТИС"

	Дано Я открываю основную форму регистра сведений "РеквизитыШтрихкодовУпаковокТоваровВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыШтрихкодовУпаковокТоваровВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РемонтыРабочихЦентров" 

	Дано Я открываю основную форму списка регистра сведений "РемонтыРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РемонтыРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РемонтыРабочихЦентров"

	Дано Я открываю основную форму регистра сведений "РемонтыРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РемонтыРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РесурсыМеханизмаОнлайнСервисовРО" 

	Дано Я открываю основную форму списка регистра сведений "РесурсыМеханизмаОнлайнСервисовРО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РесурсыМеханизмаОнлайнСервисовРО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РесурсыМеханизмаОнлайнСервисовРО"

	Дано Я открываю основную форму регистра сведений "РесурсыМеханизмаОнлайнСервисовРО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РесурсыМеханизмаОнлайнСервисовРО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "РолиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РолиСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиСотрудников"

	Дано Я открываю основную форму регистра сведений "РолиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РолиСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "РолиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РолиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "РолиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РолиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РучныеИзмененияГрафиковРаботы" 

	Дано Я открываю основную форму списка регистра сведений "РучныеИзмененияГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РучныеИзмененияГрафиковРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РучныеИзмененияГрафиковРаботы"

	Дано Я открываю основную форму регистра сведений "РучныеИзмененияГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РучныеИзмененияГрафиковРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияКонтрактаДоговораСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "СведенияКонтрактаДоговораСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияКонтрактаДоговораСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияКонтрактаДоговораСотрудника"

	Дано Я открываю основную форму регистра сведений "СведенияКонтрактаДоговораСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияКонтрактаДоговораСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияКонтрактаДоговораСотрудникаИспр" 

	Дано Я открываю основную форму списка регистра сведений "СведенияКонтрактаДоговораСотрудникаИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияКонтрактаДоговораСотрудникаИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияКонтрактаДоговораСотрудникаИспр"

	Дано Я открываю основную форму регистра сведений "СведенияКонтрактаДоговораСотрудникаИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияКонтрактаДоговораСотрудникаИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОбИнвалидностиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОбИнвалидностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОбИнвалидностиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОбИнвалидностиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СведенияОбИнвалидностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОбИнвалидностиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОбЭЛН" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОбЭЛН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОбЭЛН"

	Дано Я открываю основную форму регистра сведений "СведенияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОбЭЛН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОВзносахВПФР" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОВзносахВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВзносахВПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОВзносахВПФР"

	Дано Я открываю основную форму регистра сведений "СведенияОВзносахВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВзносахВПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОВремениДляРасчетаСреднегоОбщий" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОВремениДляРасчетаСреднегоОбщий"

	Дано Я открываю основную форму регистра сведений "СведенияОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОВремениДляРасчетаСреднегоФCC" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОВремениДляРасчетаСреднегоФCC"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВремениДляРасчетаСреднегоФCC"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОВремениДляРасчетаСреднегоФCC"

	Дано Я открываю основную форму регистра сведений "СведенияОВремениДляРасчетаСреднегоФCC"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВремениДляРасчетаСреднегоФCC"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗастрахованныхЛицахФСС" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОЗастрахованныхЛицахФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОЗастрахованныхЛицахФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗастрахованныхЛицахФСС"

	Дано Я открываю основную форму регистра сведений "СведенияОЗастрахованныхЛицахФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОЗастрахованныхЛицахФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"

	Дано Я открываю основную форму регистра сведений "СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"

	Дано Я открываю основную форму регистра сведений "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"

	Дано Я открываю основную форму регистра сведений "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОПользователях" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОРежимахРаботыФормыСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОРежимахРаботыФормыСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОРежимахРаботыФормыСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОРежимахРаботыФормыСотрудника"

	Дано Я открываю основную форму регистра сведений "СведенияОРежимахРаботыФормыСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОРежимахРаботыФормыСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОРежимахРаботыФормыСотрудникаРасширенный" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОРежимахРаботыФормыСотрудникаРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОРежимахРаботыФормыСотрудникаРасширенный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОРежимахРаботыФормыСотрудникаРасширенный"

	Дано Я открываю основную форму регистра сведений "СведенияОРежимахРаботыФормыСотрудникаРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОРежимахРаботыФормыСотрудникаРасширенный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОСертификатахОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОСертификатахОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОСертификатахОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОСертификатахОбменСБанками"

	Дано Я открываю основную форму регистра сведений "СведенияОСертификатахОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОСертификатахОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОФайлах" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОФайлах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОФайлах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОФайлах"

	Дано Я открываю основную форму регистра сведений "СведенияОФайлах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОФайлах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоЖурнал" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоЖурнал"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоЖурнал"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоЖурнал"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоЖурнал"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоЖурнал"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоЛицензии" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоЛицензии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоЛицензии"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоЛицензии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил11Раздел1" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил11Раздел1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил11Раздел1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил11Раздел1"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил11Раздел1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил11Раздел1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил11Раздел2" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил11Раздел2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил11Раздел2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил11Раздел2"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил11Раздел2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил11Раздел2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил12Раздел1" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил12Раздел1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил12Раздел1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил12Раздел1"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил12Раздел1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил12Раздел1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил12Раздел2" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил12Раздел2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил12Раздел2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил12Раздел2"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил12Раздел2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил12Раздел2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил13Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил13Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил13Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил13Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил13Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил13Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил14Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил14Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил14Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил14Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил14Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил14Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил15Поставщики" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил15Поставщики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил15Поставщики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил15Поставщики"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил15Поставщики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил15Поставщики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил15Производство" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил15Производство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил15Производство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил15Производство"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил15Производство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил15Производство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил16Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил16Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил16Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил16Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил16Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил16Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил17Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил17Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил17Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил17Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил17Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил17Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил18Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил18Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил18Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил18Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил18Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил18Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил19Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил19Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил19Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил19Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил19Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил19Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил20Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил20Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил20Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил20Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил20Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил20Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил21Раздел1Поставки" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил21Раздел1Поставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил21Раздел1Поставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил21Раздел1Поставки"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил21Раздел1Поставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил21Раздел1Поставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил21Раздел2Возвраты" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил21Раздел2Возвраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил21Раздел2Возвраты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил21Раздел2Возвраты"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил21Раздел2Возвраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил21Раздел2Возвраты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил22Раздел1Поступления" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил22Раздел1Поступления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил22Раздел1Поступления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил22Раздел1Поступления"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил22Раздел1Поступления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил22Раздел1Поступления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил22Раздел2Возвраты" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил22Раздел2Возвраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил22Раздел2Возвраты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил22Раздел2Возвраты"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил22Раздел2Возвраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил22Раздел2Возвраты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил23Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил23Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил23Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил23Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил23Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил23Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил24Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил24Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил24Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил24Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил24Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил24Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил25Раздел1Обороты" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил25Раздел1Обороты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил25Раздел1Обороты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил25Раздел1Обороты"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил25Раздел1Обороты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил25Раздел1Обороты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил25Раздел2Поступления" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил25Раздел2Поступления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил25Раздел2Поступления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил25Раздел2Поступления"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил25Раздел2Поступления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил25Раздел2Поступления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил25Раздел3Возвраты" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил25Раздел3Возвраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил25Раздел3Возвраты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил25Раздел3Возвраты"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил25Раздел3Возвраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил25Раздел3Возвраты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил26Раздел1Обороты" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил26Раздел1Обороты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил26Раздел1Обороты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил26Раздел1Обороты"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил26Раздел1Обороты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил26Раздел1Обороты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил26Раздел2Поступления" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил26Раздел2Поступления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил26Раздел2Поступления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил26Раздел2Поступления"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил26Раздел2Поступления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил26Раздел2Поступления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил26Раздел3Возвраты" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил26Раздел3Возвраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил26Раздел3Возвраты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил26Раздел3Возвраты"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил26Раздел3Возвраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил26Раздел3Возвраты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил27Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил27Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил27Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил27Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил27Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил27Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил28Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил28Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил28Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил28Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил28Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил28Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил29Поставщики" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил29Поставщики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил29Поставщики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил29Поставщики"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил29Поставщики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил29Поставщики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил29Производство" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил29Производство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил29Производство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил29Производство"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил29Производство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил29Производство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил30Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил30Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил30Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил30Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил30Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил30Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияРеглОтчетАлкоПрил31Декларация" 

	Дано Я открываю основную форму списка регистра сведений "СведенияРеглОтчетАлкоПрил31Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил31Декларация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияРеглОтчетАлкоПрил31Декларация"

	Дано Я открываю основную форму регистра сведений "СведенияРеглОтчетАлкоПрил31Декларация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияРеглОтчетАлкоПрил31Декларация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияТаможенныхДекларацийЭкспорт" 

	Дано Я открываю основную форму списка регистра сведений "СведенияТаможенныхДекларацийЭкспорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияТаможенныхДекларацийЭкспорт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияТаможенныхДекларацийЭкспорт"

	Дано Я открываю основную форму регистра сведений "СведенияТаможенныхДекларацийЭкспорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияТаможенныхДекларацийЭкспорт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СводныеПриложенияОчередьЗагрузки" 

	Дано Я открываю основную форму списка регистра сведений "СводныеПриложенияОчередьЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СводныеПриложенияОчередьЗагрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СводныеПриложенияОчередьЗагрузки"

	Дано Я открываю основную форму регистра сведений "СводныеПриложенияОчередьЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СводныеПриложенияОчередьЗагрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СводныеПриложенияСостояниеВыгрузки" 

	Дано Я открываю основную форму списка регистра сведений "СводныеПриложенияСостояниеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СводныеПриложенияСостояниеВыгрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СводныеПриложенияСостояниеВыгрузки"

	Дано Я открываю основную форму регистра сведений "СводныеПриложенияСостояниеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СводныеПриложенияСостояниеВыгрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СводныеПриложенияСостояниеЗагрузки" 

	Дано Я открываю основную форму списка регистра сведений "СводныеПриложенияСостояниеЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СводныеПриложенияСостояниеЗагрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СводныеПриложенияСостояниеЗагрузки"

	Дано Я открываю основную форму регистра сведений "СводныеПриложенияСостояниеЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СводныеПриложенияСостояниеЗагрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваЗаданий" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваЗаданий"

	Дано Я открываю основную форму регистра сведений "СвойстваЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваКонтрагентовСПАРКРиски" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваКонтрагентовСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваКонтрагентовСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваКонтрагентовСПАРКРиски"

	Дано Я открываю основную форму регистра сведений "СвойстваКонтрагентовСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваКонтрагентовСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваНовостей" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваНовостей"

	Дано Я открываю основную форму регистра сведений "СвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваТранзакцийОбменаСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваТранзакцийОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваТранзакцийОбменаСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваТранзакцийОбменаСБанками"

	Дано Я открываю основную форму регистра сведений "СвойстваТранзакцийОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваТранзакцийОбменаСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваТранспортныхСообщений" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваТранспортныхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваТранспортныхСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваТранспортныхСообщений"

	Дано Я открываю основную форму регистра сведений "СвойстваТранспортныхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваТранспортныхСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязанныеОбъектыОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СвязанныеОбъектыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязанныеОбъектыОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязанныеОбъектыОбменСБанками"

	Дано Я открываю основную форму регистра сведений "СвязанныеОбъектыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязанныеОбъектыОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязиАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СвязиАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязиАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "СвязиАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязиМеждуПартнерами" 

	Дано Я открываю основную форму списка регистра сведений "СвязиМеждуПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиМеждуПартнерами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязиМеждуПартнерами"

	Дано Я открываю основную форму регистра сведений "СвязиМеждуПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиМеждуПартнерами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязиМеждуФизЛицами" 

	Дано Я открываю основную форму списка регистра сведений "СвязиМеждуФизЛицами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиМеждуФизЛицами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязиМеждуФизЛицами"

	Дано Я открываю основную форму регистра сведений "СвязиМеждуФизЛицами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиМеждуФизЛицами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязиПоказателейБюджетов" 

	Дано Я открываю основную форму списка регистра сведений "СвязиПоказателейБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиПоказателейБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязиПоказателейБюджетов"

	Дано Я открываю основную форму регистра сведений "СвязиПоказателейБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиПоказателейБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязьВидовИФорматовДокументовЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СвязьВидовИФорматовДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязьВидовИФорматовДокументовЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязьВидовИФорматовДокументовЭДО"

	Дано Я открываю основную форму регистра сведений "СвязьВидовИФорматовДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязьВидовИФорматовДокументовЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СезонныеКоэффициенты" 

	Дано Я открываю основную форму списка регистра сведений "СезонныеКоэффициенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СезонныеКоэффициенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СезонныеКоэффициенты"

	Дано Я открываю основную форму регистра сведений "СезонныеКоэффициенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СезонныеКоэффициенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыОрганизацийДляОбменаСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СертификатыОрганизацийДляОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыОрганизацийДляОбменаСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыОрганизацийДляОбменаСБанками"

	Дано Я открываю основную форму регистра сведений "СертификатыОрганизацийДляОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыОрганизацийДляОбменаСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыПереданныеПФР" 

	Дано Я открываю основную форму списка регистра сведений "СертификатыПереданныеПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыПереданныеПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыПереданныеПФР"

	Дано Я открываю основную форму регистра сведений "СертификатыПереданныеПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыПереданныеПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыПользователяDSS" 

	Дано Я открываю основную форму списка регистра сведений "СертификатыПользователяDSS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыПользователяDSS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыПользователяDSS"

	Дано Я открываю основную форму регистра сведений "СертификатыПользователяDSS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыПользователяDSS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыУчетныхЗаписейЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СертификатыУчетныхЗаписейЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыУчетныхЗаписейЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыУчетныхЗаписейЭДО"

	Дано Я открываю основную форму регистра сведений "СертификатыУчетныхЗаписейЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыУчетныхЗаписейЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыШифрования" 

	Дано Я открываю основную форму списка регистра сведений "СертификатыШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыШифрования"

	Дано Я открываю основную форму регистра сведений "СертификатыШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СессииОбменаСообщениямиСистемы" 

	Дано Я открываю основную форму списка регистра сведений "СессииОбменаСообщениямиСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СессииОбменаСообщениямиСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СессииОбменаСообщениямиСистемы"

	Дано Я открываю основную форму регистра сведений "СессииОбменаСообщениямиСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СессииОбменаСообщениямиСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СинхронизацияКлассификаторовВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СинхронизацияКлассификаторовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СинхронизацияКлассификаторовВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СинхронизацияКлассификаторовВЕТИС"

	Дано Я открываю основную форму регистра сведений "СинхронизацияКлассификаторовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СинхронизацияКлассификаторовВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СинхронизацияОбъектовВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СинхронизацияОбъектовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СинхронизацияОбъектовВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СинхронизацияОбъектовВЕТИС"

	Дано Я открываю основную форму регистра сведений "СинхронизацияОбъектовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СинхронизацияОбъектовВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкидкиТорговыхПредложений" 

	Дано Я открываю основную форму списка регистра сведений "СкидкиТорговыхПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СкидкиТорговыхПредложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкидкиТорговыхПредложений"

	Дано Я открываю основную форму регистра сведений "СкидкиТорговыхПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СкидкиТорговыхПредложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкидкиТорговыхПредложенийВидыЦен" 

	Дано Я открываю основную форму списка регистра сведений "СкидкиТорговыхПредложенийВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СкидкиТорговыхПредложенийВидыЦен"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкидкиТорговыхПредложенийВидыЦен"

	Дано Я открываю основную форму регистра сведений "СкидкиТорговыхПредложенийВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СкидкиТорговыхПредложенийВидыЦен"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СклоненияПредставленийОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СклоненияПредставленийОбъектов"

	Дано Я открываю основную форму регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкрытыеРегламентированныеОтчеты" 

	Дано Я открываю основную форму списка регистра сведений "СкрытыеРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СкрытыеРегламентированныеОтчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкрытыеРегламентированныеОтчеты"

	Дано Я открываю основную форму регистра сведений "СкрытыеРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СкрытыеРегламентированныеОтчеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СловарьСопоставленияНоменклатурыБЭД" 

	Дано Я открываю основную форму списка регистра сведений "СловарьСопоставленияНоменклатурыБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СловарьСопоставленияНоменклатурыБЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СловарьСопоставленияНоменклатурыБЭД"

	Дано Я открываю основную форму регистра сведений "СловарьСопоставленияНоменклатурыБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СловарьСопоставленияНоменклатурыБЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СлужебныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СлужебныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СобытияКалендаряБухгалтера" 

	Дано Я открываю основную форму списка регистра сведений "СобытияКалендаряБухгалтера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияКалендаряБухгалтера"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СобытияКалендаряБухгалтера"

	Дано Я открываю основную форму регистра сведений "СобытияКалендаряБухгалтера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияКалендаряБухгалтера"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СобытияМониторингаСПАРКРиски" 

	Дано Я открываю основную форму списка регистра сведений "СобытияМониторингаСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияМониторингаСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СобытияМониторингаСПАРКРиски"

	Дано Я открываю основную форму регистра сведений "СобытияМониторингаСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияМониторингаСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СобытияОСОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "СобытияОСОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияОСОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СобытияОСОрганизаций"

	Дано Я открываю основную форму регистра сведений "СобытияОСОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияОСОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СовместимостьОператоровЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СовместимостьОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СовместимостьОператоровЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СовместимостьОператоровЭДО"

	Дано Я открываю основную форму регистра сведений "СовместимостьОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СовместимостьОператоровЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласиеОПредоставленииИнформацииГИСМТ" 

	Дано Я открываю основную форму списка регистра сведений "СогласиеОПредоставленииИнформацииГИСМТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласиеОПредоставленииИнформацииГИСМТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласиеОПредоставленииИнформацииГИСМТ"

	Дано Я открываю основную форму регистра сведений "СогласиеОПредоставленииИнформацииГИСМТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласиеОПредоставленииИнформацииГИСМТ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласияНаУведомленияОбЭЛН" 

	Дано Я открываю основную форму списка регистра сведений "СогласияНаУведомленияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаУведомленияОбЭЛН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласияНаУведомленияОбЭЛН"

	Дано Я открываю основную форму регистра сведений "СогласияНаУведомленияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаУведомленияОбЭЛН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СодержаниеКорректировокПланаПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "СодержаниеКорректировокПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СодержаниеКорректировокПланаПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СодержаниеКорректировокПланаПроизводства"

	Дано Я открываю основную форму регистра сведений "СодержаниеКорректировокПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СодержаниеКорректировокПланаПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СодержимоеТранспортныхКонтейнеров" 

	Дано Я открываю основную форму списка регистра сведений "СодержимоеТранспортныхКонтейнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СодержимоеТранспортныхКонтейнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СодержимоеТранспортныхКонтейнеров"

	Дано Я открываю основную форму регистра сведений "СодержимоеТранспортныхКонтейнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СодержимоеТранспортныхКонтейнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбменаДанными"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбменаДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбменаДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияФССОбИзмененииСостоянийЭЛН" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияФССОбИзмененииСостоянийЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияФССОбИзмененииСостоянийЭЛН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияФССОбИзмененииСостоянийЭЛН"

	Дано Я открываю основную форму регистра сведений "СообщенияФССОбИзмененииСостоянийЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияФССОбИзмененииСостоянийЭЛН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеВидовНоменклатурыРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеВидовНоменклатурыРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеВидовНоменклатурыРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеВидовНоменклатурыРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "СоответствиеВидовНоменклатурыРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеВидовНоменклатурыРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеЗначенийРеквизитовРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеНоменклатурыВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеНоменклатурыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеНоменклатурыВЕТИС"

	Дано Я открываю основную форму регистра сведений "СоответствиеНоменклатурыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеНоменклатурыЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеНоменклатурыЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеНоменклатурыЕГАИС"

	Дано Я открываю основную форму регистра сведений "СоответствиеНоменклатурыЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеНоменклатурыМобильногоПриложения1СЗаказы" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"

	Дано Я открываю основную форму регистра сведений "СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеНоменклатурыРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеНоменклатурыРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеНоменклатурыРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "СоответствиеНоменклатурыРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеРегОтчетовУведомлениям" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеРегОтчетовУведомлениям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеРегОтчетовУведомлениям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеРегОтчетовУведомлениям"

	Дано Я открываю основную форму регистра сведений "СоответствиеРегОтчетовУведомлениям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеРегОтчетовУведомлениям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеРеквизитовРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеРеквизитовРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеРеквизитовРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеРеквизитовРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "СоответствиеРеквизитовРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеРеквизитовРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеУсловийПродажМобильногоПриложения1СЗаказы" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"

	Дано Я открываю основную форму регистра сведений "СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствияОбъектовИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставГруппСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СоставГруппСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставГруппСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставГруппСотрудников"

	Дано Я открываю основную форму регистра сведений "СоставГруппСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставГруппСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставДокументовЗарплатаКадры" 

	Дано Я открываю основную форму списка регистра сведений "СоставДокументовЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставДокументовЗарплатаКадры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставДокументовЗарплатаКадры"

	Дано Я открываю основную форму регистра сведений "СоставДокументовЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставДокументовЗарплатаКадры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставЕГДС" 

	Дано Я открываю основную форму списка регистра сведений "СоставЕГДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставЕГДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставЕГДС"

	Дано Я открываю основную форму регистра сведений "СоставЕГДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставЕГДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставПакетовДокументовЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СоставПакетовДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставПакетовДокументовЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставПакетовДокументовЭДО"

	Дано Я открываю основную форму регистра сведений "СоставПакетовДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставПакетовДокументовЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставыГруппПользователей" 

	Дано Я открываю основную форму списка регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставыГруппПользователей"

	Дано Я открываю основную форму регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеНастройкиЗаполненияФормСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеНастройкиЗаполненияФормСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеНастройкиЗаполненияФормСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеНастройкиЗаполненияФормСтатистики"

	Дано Я открываю основную форму регистра сведений "СостояниеНастройкиЗаполненияФормСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеНастройкиЗаполненияФормСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеОрганизацийБЭД" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеОрганизацийБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеОрганизацийБЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеОрганизацийБЭД"

	Дано Я открываю основную форму регистра сведений "СостояниеОрганизацийБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеОрганизацийБЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеОтложенногоПодключенияКСервису" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеОтложенногоПодключенияКСервису"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеОтложенногоПодключенияКСервису"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеОтложенногоПодключенияКСервису"

	Дано Я открываю основную форму регистра сведений "СостояниеОтложенногоПодключенияКСервису"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеОтложенногоПодключенияКСервису"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеПереходаНаЦенообразованиеВерсии25" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеПереходаНаЦенообразованиеВерсии25"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеПереходаНаЦенообразованиеВерсии25"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеПереходаНаЦенообразованиеВерсии25"

	Дано Я открываю основную форму регистра сведений "СостояниеПереходаНаЦенообразованиеВерсии25"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеПереходаНаЦенообразованиеВерсии25"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеПодключенияКЭДОсПФР" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеПодключенияКЭДОсПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеПодключенияКЭДОсПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеПодключенияКЭДОсПФР"

	Дано Я открываю основную форму регистра сведений "СостояниеПодключенияКЭДОсПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеПодключенияКЭДОсПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеПодписанияЭД" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеПодписанияЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеПодписанияЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеПодписанияЭД"

	Дано Я открываю основную форму регистра сведений "СостояниеПодписанияЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеПодписанияЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияБронированияЗаявокНаКомандировку" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияБронированияЗаявокНаКомандировку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияБронированияЗаявокНаКомандировку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияБронированияЗаявокНаКомандировку"

	Дано Я открываю основную форму регистра сведений "СостоянияБронированияЗаявокНаКомандировку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияБронированияЗаявокНаКомандировку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияВБракеФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияВБракеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВБракеФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияВБракеФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СостоянияВБракеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВБракеФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияВнутреннихЗаказов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияВнутреннихЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВнутреннихЗаказов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияВнутреннихЗаказов"

	Дано Я открываю основную форму регистра сведений "СостоянияВнутреннихЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВнутреннихЗаказов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияВыгрузкиНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияВыгрузкиНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВыгрузкиНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияВыгрузкиНоменклатуры"

	Дано Я открываю основную форму регистра сведений "СостоянияВыгрузкиНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВыгрузкиНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияДокументовEDI" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияДокументовEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияДокументовEDI"

	Дано Я открываю основную форму регистра сведений "СостоянияДокументовEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияДокументовЗачисленияЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияДокументовЗачисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовЗачисленияЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияДокументовЗачисленияЗарплаты"

	Дано Я открываю основную форму регистра сведений "СостоянияДокументовЗачисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовЗачисленияЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияДокументовОткрытияЛицевыхСчетов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияДокументовОткрытияЛицевыхСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовОткрытияЛицевыхСчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияДокументовОткрытияЛицевыхСчетов"

	Дано Я открываю основную форму регистра сведений "СостоянияДокументовОткрытияЛицевыхСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовОткрытияЛицевыхСчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияДокументовЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияДокументовЭДО"

	Дано Я открываю основную форму регистра сведений "СостоянияДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗаказовКлиентов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗаказовКлиентов"

	Дано Я открываю основную форму регистра сведений "СостоянияЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗаказовНаПроизводство" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияЗаказовНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовНаПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗаказовНаПроизводство"

	Дано Я открываю основную форму регистра сведений "СостоянияЗаказовНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовНаПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗаказовПоставщикам" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовПоставщикам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗаказовПоставщикам"

	Дано Я открываю основную форму регистра сведений "СостоянияЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовПоставщикам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗапросовКоммерческихПредложений" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияЗапросовКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗапросовКоммерческихПредложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗапросовКоммерческихПредложений"

	Дано Я открываю основную форму регистра сведений "СостоянияЗапросовКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗапросовКоммерческихПредложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияИнтеграцииОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияИнтеграцииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияИнтеграцииОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияИнтеграцииОбъектов"

	Дано Я открываю основную форму регистра сведений "СостоянияИнтеграцииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияИнтеграцииОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияИРеквизитыДоставки" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияИРеквизитыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияИРеквизитыДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияИРеквизитыДоставки"

	Дано Я открываю основную форму регистра сведений "СостоянияИРеквизитыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияИРеквизитыДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКоммерческихПредложенийКлиентам" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКоммерческихПредложенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКоммерческихПредложенийКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКоммерческихПредложенийКлиентам"

	Дано Я открываю основную форму регистра сведений "СостоянияКоммерческихПредложенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКоммерческихПредложенийКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКонтактовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКонтактовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКонтрагентов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКонтрагентов"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКонтрагентовБЭД" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтрагентовБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтрагентовБЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКонтрагентовБЭД"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтрагентовБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтрагентовБЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияНовостей" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияНовостей"

	Дано Я открываю основную форму регистра сведений "СостоянияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовССайтом" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовССайтом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовССайтом"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовССайтом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовЭДЧерезОператоровЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовЭДЧерезОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовЭДЧерезОператоровЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовЭДЧерезОператоровЭДО"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовЭДЧерезОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовЭДЧерезОператоровЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменСБанками"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбновленияДанныхEDI" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбновленияДанныхEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбновленияДанныхEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбновленияДанныхEDI"

	Дано Я открываю основную форму регистра сведений "СостоянияОбновленияДанныхEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбновленияДанныхEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОригиналовПервичныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОригиналовПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОригиналовПервичныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОригиналовПервичныхДокументов"

	Дано Я открываю основную форму регистра сведений "СостоянияОригиналовПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОригиналовПервичныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПапокПисем" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПапокПисем"

	Дано Я открываю основную форму регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПересчетовЯчеек" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПересчетовЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПересчетовЯчеек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПересчетовЯчеек"

	Дано Я открываю основную форму регистра сведений "СостоянияПересчетовЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПересчетовЯчеек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПлановыхКалькуляций" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПлановыхКалькуляций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПлановыхКалькуляций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПлановыхКалькуляций"

	Дано Я открываю основную форму регистра сведений "СостоянияПлановыхКалькуляций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПлановыхКалькуляций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПоОбъектамУчетаЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПоОбъектамУчетаЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПоОбъектамУчетаЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПоОбъектамУчетаЭДО"

	Дано Я открываю основную форму регистра сведений "СостоянияПоОбъектамУчетаЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПоОбъектамУчетаЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПредметовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПредметовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияРассылокОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияРассылокОтчетов"

	Дано Я открываю основную форму регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСинхронизацииСервисНастроекЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияСинхронизацииСервисНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСинхронизацииСервисНастроекЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСинхронизацииСервисНастроекЭДО"

	Дано Я открываю основную форму регистра сведений "СостоянияСинхронизацииСервисНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСинхронизацииСервисНастроекЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСинхронизацииТорговыеПредложения" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияСинхронизацииТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСинхронизацииТорговыеПредложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСинхронизацииТорговыеПредложения"

	Дано Я открываю основную форму регистра сведений "СостоянияСинхронизацииТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСинхронизацииТорговыеПредложения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСогласованияВДокументообороте" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияСогласованияВДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСогласованияВДокументообороте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСогласованияВДокументообороте"

	Дано Я открываю основную форму регистра сведений "СостоянияСогласованияВДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСогласованияВДокументообороте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСотрудников"

	Дано Я открываю основную форму регистра сведений "СостоянияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияУспешныхОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияУспешныхОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЭтаповПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЭтаповПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЭтаповПроизводства"

	Дано Я открываю основную форму регистра сведений "СостоянияЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЭтаповПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СотрудникиДляОбновленияПубликацииГрафикаОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "СотрудникиДляОбновленияПубликацииГрафикаОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СотрудникиДляОбновленияПубликацииГрафикаОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СотрудникиДляОбновленияПубликацииГрафикаОтпусков"

	Дано Я открываю основную форму регистра сведений "СотрудникиДляОбновленияПубликацииГрафикаОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СотрудникиДляОбновленияПубликацииГрафикаОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СотрудникиДляОбновленияПубликацииПравНаОтпуск" 

	Дано Я открываю основную форму списка регистра сведений "СотрудникиДляОбновленияПубликацииПравНаОтпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СотрудникиДляОбновленияПубликацииПравНаОтпуск"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СотрудникиДляОбновленияПубликацииПравНаОтпуск"

	Дано Я открываю основную форму регистра сведений "СотрудникиДляОбновленияПубликацииПравНаОтпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СотрудникиДляОбновленияПубликацииПравНаОтпуск"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СотрудникиДляОбновленияПубликуемыхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СотрудникиДляОбновленияПубликуемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СотрудникиДляОбновленияПубликуемыхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СотрудникиДляОбновленияПубликуемыхОбъектов"

	Дано Я открываю основную форму регистра сведений "СотрудникиДляОбновленияПубликуемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СотрудникиДляОбновленияПубликуемыхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СотрудникиМагазинов" 

	Дано Я открываю основную форму списка регистра сведений "СотрудникиМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СотрудникиМагазинов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СотрудникиМагазинов"

	Дано Я открываю основную форму регистра сведений "СотрудникиМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СотрудникиМагазинов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпециальностиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СпециальностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпециальностиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпециальностиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СпециальностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпециальностиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпецификацииИзделий" 

	Дано Я открываю основную форму списка регистра сведений "СпецификацииИзделий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпецификацииИзделий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпецификацииИзделий"

	Дано Я открываю основную форму регистра сведений "СпецификацииИзделий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпецификацииИзделий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособОтраженияДляЗаменыУстаревшейАналитикиВБухучете" 

	Дано Я открываю основную форму списка регистра сведений "СпособОтраженияДляЗаменыУстаревшейАналитикиВБухучете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпособОтраженияДляЗаменыУстаревшейАналитикиВБухучете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособОтраженияДляЗаменыУстаревшейАналитикиВБухучете"

	Дано Я открываю основную форму регистра сведений "СпособОтраженияДляЗаменыУстаревшейАналитикиВБухучете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпособОтраженияДляЗаменыУстаревшейАналитикиВБухучете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыОтраженияРасходовПоИмущественнымНалогам" 

	Дано Я открываю основную форму списка регистра сведений "СпособыОтраженияРасходовПоИмущественнымНалогам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпособыОтраженияРасходовПоИмущественнымНалогам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыОтраженияРасходовПоИмущественнымНалогам"

	Дано Я открываю основную форму регистра сведений "СпособыОтраженияРасходовПоИмущественнымНалогам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпособыОтраженияРасходовПоИмущественнымНалогам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиНДФЛДляИФНССведенияОВычетах" 

	Дано Я открываю основную форму списка регистра сведений "СправкиНДФЛДляИФНССведенияОВычетах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СправкиНДФЛДляИФНССведенияОВычетах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиНДФЛДляИФНССведенияОВычетах"

	Дано Я открываю основную форму регистра сведений "СправкиНДФЛДляИФНССведенияОВычетах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СправкиНДФЛДляИФНССведенияОВычетах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиНДФЛДляИФНССведенияОДоходах" 

	Дано Я открываю основную форму списка регистра сведений "СправкиНДФЛДляИФНССведенияОДоходах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СправкиНДФЛДляИФНССведенияОДоходах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиНДФЛДляИФНССведенияОДоходах"

	Дано Я открываю основную форму регистра сведений "СправкиНДФЛДляИФНССведенияОДоходах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СправкиНДФЛДляИФНССведенияОДоходах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СреднемесячныеНормыВремениГрафиковРаботыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СреднемесячныеНормыВремениГрафиковРаботыСотрудников"

	Дано Я открываю основную форму регистра сведений "СреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев" 

	Дано Я открываю основную форму списка регистра сведений "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"

	Дано Я открываю основную форму регистра сведений "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкаКомпенсацииЗаЗадержкуЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "СтавкаКомпенсацииЗаЗадержкуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаКомпенсацииЗаЗадержкуЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкаКомпенсацииЗаЗадержкуЗарплаты"

	Дано Я открываю основную форму регистра сведений "СтавкаКомпенсацииЗаЗадержкуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаКомпенсацииЗаЗадержкуЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкаРефинансированияЦБ" 

	Дано Я открываю основную форму списка регистра сведений "СтавкаРефинансированияЦБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаРефинансированияЦБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкаРефинансированияЦБ"

	Дано Я открываю основную форму регистра сведений "СтавкаРефинансированияЦБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаРефинансированияЦБ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкиДисконтирования" 

	Дано Я открываю основную форму списка регистра сведений "СтавкиДисконтирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиДисконтирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкиДисконтирования"

	Дано Я открываю основную форму регистра сведений "СтавкиДисконтирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиДисконтирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкиНалогаНаИмущество" 

	Дано Я открываю основную форму списка регистра сведений "СтавкиНалогаНаИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиНалогаНаИмущество"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкиНалогаНаИмущество"

	Дано Я открываю основную форму регистра сведений "СтавкиНалогаНаИмущество"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиНалогаНаИмущество"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам" 

	Дано Я открываю основную форму списка регистра сведений "СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам"

	Дано Я открываю основную форму регистра сведений "СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкиНалогаНаПрибыльВБюджетСубъектовРФ" 

	Дано Я открываю основную форму списка регистра сведений "СтавкиНалогаНаПрибыльВБюджетСубъектовРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиНалогаНаПрибыльВБюджетСубъектовРФ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкиНалогаНаПрибыльВБюджетСубъектовРФ"

	Дано Я открываю основную форму регистра сведений "СтавкиНалогаНаПрибыльВБюджетСубъектовРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиНалогаНаПрибыльВБюджетСубъектовРФ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкиНалогаНаПрибыльДляВсехОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "СтавкиНалогаНаПрибыльДляВсехОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиНалогаНаПрибыльДляВсехОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкиНалогаНаПрибыльДляВсехОрганизаций"

	Дано Я открываю основную форму регистра сведений "СтавкиНалогаНаПрибыльДляВсехОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиНалогаНаПрибыльДляВсехОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкиТранспортногоНалога" 

	Дано Я открываю основную форму списка регистра сведений "СтавкиТранспортногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиТранспортногоНалога"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкиТранспортногоНалога"

	Дано Я открываю основную форму регистра сведений "СтавкиТранспортногоНалога"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкиТранспортногоНалога"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтажиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СтажиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтажиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтажиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СтажиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтажиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтандартныеВычетыНаДетейНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "СтандартныеВычетыНаДетейНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыНаДетейНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтандартныеВычетыНаДетейНДФЛ"

	Дано Я открываю основную форму регистра сведений "СтандартныеВычетыНаДетейНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыНаДетейНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтандартныеВычетыНаДетейНДФЛИспр" 

	Дано Я открываю основную форму списка регистра сведений "СтандартныеВычетыНаДетейНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыНаДетейНДФЛИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтандартныеВычетыНаДетейНДФЛИспр"

	Дано Я открываю основную форму регистра сведений "СтандартныеВычетыНаДетейНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыНаДетейНДФЛИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтандартныеВычетыПоНДФЛВторичный" 

	Дано Я открываю основную форму списка регистра сведений "СтандартныеВычетыПоНДФЛВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыПоНДФЛВторичный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтандартныеВычетыПоНДФЛВторичный"

	Дано Я открываю основную форму регистра сведений "СтандартныеВычетыПоНДФЛВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыПоНДФЛВторичный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтандартныеВычетыФизическихЛицНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "СтандартныеВычетыФизическихЛицНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыФизическихЛицНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтандартныеВычетыФизическихЛицНДФЛ"

	Дано Я открываю основную форму регистра сведений "СтандартныеВычетыФизическихЛицНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыФизическихЛицНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтандартныеВычетыФизическихЛицНДФЛИспр" 

	Дано Я открываю основную форму списка регистра сведений "СтандартныеВычетыФизическихЛицНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыФизическихЛицНДФЛИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтандартныеВычетыФизическихЛицНДФЛИспр"

	Дано Я открываю основную форму регистра сведений "СтандартныеВычетыФизическихЛицНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыФизическихЛицНДФЛИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистикаКонфигурации" 

	Дано Я открываю основную форму списка регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистикаКонфигурации"

	Дано Я открываю основную форму регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистикаПозицийТорговыхПредложений" 

	Дано Я открываю основную форму списка регистра сведений "СтатистикаПозицийТорговыхПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаПозицийТорговыхПредложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистикаПозицийТорговыхПредложений"

	Дано Я открываю основную форму регистра сведений "СтатистикаПозицийТорговыхПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаПозицийТорговыхПредложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистикаСделокСКлиентами" 

	Дано Я открываю основную форму списка регистра сведений "СтатистикаСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаСделокСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистикаСделокСКлиентами"

	Дано Я открываю основную форму регистра сведений "СтатистикаСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаСделокСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистикаСловСловаряСопоставленияНоменклатурыБЭД" 

	Дано Я открываю основную форму списка регистра сведений "СтатистикаСловСловаряСопоставленияНоменклатурыБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаСловСловаряСопоставленияНоменклатурыБЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистикаСловСловаряСопоставленияНоменклатурыБЭД"

	Дано Я открываю основную форму регистра сведений "СтатистикаСловСловаряСопоставленияНоменклатурыБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаСловСловаряСопоставленияНоменклатурыБЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусОбменовСЯндексКассой" 

	Дано Я открываю основную форму списка регистра сведений "СтатусОбменовСЯндексКассой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусОбменовСЯндексКассой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусОбменовСЯндексКассой"

	Дано Я открываю основную форму регистра сведений "СтатусОбменовСЯндексКассой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусОбменовСЯндексКассой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусФизическихЛицКакНалогоплательщиковНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусФизическихЛицКакНалогоплательщиковНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусФизическихЛицКакНалогоплательщиковНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусФизическихЛицКакНалогоплательщиковНДФЛ"

	Дано Я открываю основную форму регистра сведений "СтатусФизическихЛицКакНалогоплательщиковНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусФизическихЛицКакНалогоплательщиковНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный" 

	Дано Я открываю основную форму списка регистра сведений "СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный"

	Дано Я открываю основную форму регистра сведений "СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыДокументовВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыДокументовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыДокументовВЕТИС"

	Дано Я открываю основную форму регистра сведений "СтатусыДокументовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыДокументовЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыДокументовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыДокументовЕГАИС"

	Дано Я открываю основную форму регистра сведений "СтатусыДокументовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыДокументовИСМП" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыДокументовИСМП"

	Дано Я открываю основную форму регистра сведений "СтатусыДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыЗапросовДляПоискаКоммерческихПредложений" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыЗапросовДляПоискаКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗапросовДляПоискаКоммерческихПредложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыЗапросовДляПоискаКоммерческихПредложений"

	Дано Я открываю основную форму регистра сведений "СтатусыЗапросовДляПоискаКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗапросовДляПоискаКоммерческихПредложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыЗапросовРеестровСчетовФактур" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыЗапросовРеестровСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗапросовРеестровСчетовФактур"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыЗапросовРеестровСчетовФактур"

	Дано Я открываю основную форму регистра сведений "СтатусыЗапросовРеестровСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗапросовРеестровСчетовФактур"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыЗастрахованныхФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыЗастрахованныхФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗастрахованныхФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыЗастрахованныхФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СтатусыЗастрахованныхФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗастрахованныхФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыЗаявокНаВыпускКиЗГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыЗаявокНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗаявокНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыЗаявокНаВыпускКиЗГИСМ"

	Дано Я открываю основную форму регистра сведений "СтатусыЗаявокНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗаявокНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыИнформированияГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыИнформированияГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыИнформированияГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыИнформированияГИСМ"

	Дано Я открываю основную форму регистра сведений "СтатусыИнформированияГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыИнформированияГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыОтправки" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОтправки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыОтправки"

	Дано Я открываю основную форму регистра сведений "СтатусыОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОтправки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыОформленияДокументовВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыОформленияДокументовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыОформленияДокументовВЕТИС"

	Дано Я открываю основную форму регистра сведений "СтатусыОформленияДокументовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыОформленияДокументовЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыОформленияДокументовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыОформленияДокументовЕГАИС"

	Дано Я открываю основную форму регистра сведений "СтатусыОформленияДокументовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыОформленияДокументовИСМП" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыОформленияДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыОформленияДокументовИСМП"

	Дано Я открываю основную форму регистра сведений "СтатусыОформленияДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыПроверкиДокументов" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыПроверкиДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыПроверкиДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыПроверкиДокументов"

	Дано Я открываю основную форму регистра сведений "СтатусыПроверкиДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыПроверкиДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыПроверкиИПодбораДокументовИСМП" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыПроверкиИПодбораДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыПроверкиИПодбораДокументовИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыПроверкиИПодбораДокументовИСМП"

	Дано Я открываю основную форму регистра сведений "СтатусыПроверкиИПодбораДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыПроверкиИПодбораДокументовИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыСборкиИДоставки" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыСборкиИДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСборкиИДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыСборкиИДоставки"

	Дано Я открываю основную форму регистра сведений "СтатусыСборкиИДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСборкиИДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыСинхронизацииФайловСОблачнымСервисом" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыСинхронизацииФайловСОблачнымСервисом"

	Дано Я открываю основную форму регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму регистра сведений "СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму регистра сведений "СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиФинансированияБазыСреднегоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "СтатьиФинансированияБазыСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатьиФинансированияБазыСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиФинансированияБазыСреднегоЗаработка"

	Дано Я открываю основную форму регистра сведений "СтатьиФинансированияБазыСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатьиФинансированияБазыСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьяФинансированияДляЗаменыУстаревшейАналитикиВБухучете" 

	Дано Я открываю основную форму списка регистра сведений "СтатьяФинансированияДляЗаменыУстаревшейАналитикиВБухучете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатьяФинансированияДляЗаменыУстаревшейАналитикиВБухучете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьяФинансированияДляЗаменыУстаревшейАналитикиВБухучете"

	Дано Я открываю основную форму регистра сведений "СтатьяФинансированияДляЗаменыУстаревшейАналитикиВБухучете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатьяФинансированияДляЗаменыУстаревшейАналитикиВБухучете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтоимостьТоваров" 

	Дано Я открываю основную форму списка регистра сведений "СтоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтоимостьТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтоимостьТоваров"

	Дано Я открываю основную форму регистра сведений "СтоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтоимостьТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраховыеВзносыСкидкиКДоходам" 

	Дано Я открываю основную форму списка регистра сведений "СтраховыеВзносыСкидкиКДоходам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтраховыеВзносыСкидкиКДоходам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраховыеВзносыСкидкиКДоходам"

	Дано Я открываю основную форму регистра сведений "СтраховыеВзносыСкидкиКДоходам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтраховыеВзносыСкидкиКДоходам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы" 

	Дано Я открываю основную форму списка регистра сведений "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"

	Дано Я открываю основную форму регистра сведений "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов" 

	Дано Я открываю основную форму списка регистра сведений "СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"

	Дано Я открываю основную форму регистра сведений "СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтроковыеСведенияФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СтроковыеСведенияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтроковыеСведенияФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтроковыеСведенияФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СтроковыеСведенияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтроковыеСведенияФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СубъектыДляСкрытияПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "СубъектыДляСкрытияПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СубъектыДляСкрытияПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СубъектыДляСкрытияПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "СубъектыДляСкрытияПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СубъектыДляСкрытияПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СуммыДокументовВВалютахУчета" 

	Дано Я открываю основную форму списка регистра сведений "СуммыДокументовВВалютахУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СуммыДокументовВВалютахУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СуммыДокументовВВалютахУчета"

	Дано Я открываю основную форму регистра сведений "СуммыДокументовВВалютахУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СуммыДокументовВВалютахУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СхемыОбеспечения" 

	Дано Я открываю основную форму списка регистра сведений "СхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СхемыОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СхемыОбеспечения"

	Дано Я открываю основную форму регистра сведений "СхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СхемыОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СхемыОбеспеченияПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "СхемыОбеспеченияПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СхемыОбеспеченияПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СхемыОбеспеченияПроизводства"

	Дано Я открываю основную форму регистра сведений "СхемыОбеспеченияПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СхемыОбеспеченияПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетаМеждународногоУчетаТребующиеНастройки" 

	Дано Я открываю основную форму списка регистра сведений "СчетаМеждународногоУчетаТребующиеНастройки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаМеждународногоУчетаТребующиеНастройки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетаМеждународногоУчетаТребующиеНастройки"

	Дано Я открываю основную форму регистра сведений "СчетаМеждународногоУчетаТребующиеНастройки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаМеждународногоУчетаТребующиеНастройки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетаРеглУчетаИгнорируемыеПриОтраженииВМеждународномУчете" 

	Дано Я открываю основную форму списка регистра сведений "СчетаРеглУчетаИгнорируемыеПриОтраженииВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаРеглУчетаИгнорируемыеПриОтраженииВМеждународномУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетаРеглУчетаИгнорируемыеПриОтраженииВМеждународномУчете"

	Дано Я открываю основную форму регистра сведений "СчетаРеглУчетаИгнорируемыеПриОтраженииВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаРеглУчетаИгнорируемыеПриОтраженииВМеждународномУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетаРеглУчетаТребующиеНастройки" 

	Дано Я открываю основную форму списка регистра сведений "СчетаРеглУчетаТребующиеНастройки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаРеглУчетаТребующиеНастройки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетаРеглУчетаТребующиеНастройки"

	Дано Я открываю основную форму регистра сведений "СчетаРеглУчетаТребующиеНастройки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаРеглУчетаТребующиеНастройки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетаФактурыКомиссионерамКОформлению" 

	Дано Я открываю основную форму списка регистра сведений "СчетаФактурыКомиссионерамКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыКомиссионерамКОформлению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетаФактурыКомиссионерамКОформлению"

	Дано Я открываю основную форму регистра сведений "СчетаФактурыКомиссионерамКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыКомиссионерамКОформлению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетаФактурыКомитентовКРегистрации" 

	Дано Я открываю основную форму списка регистра сведений "СчетаФактурыКомитентовКРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыКомитентовКРегистрации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетаФактурыКомитентовКРегистрации"

	Дано Я открываю основную форму регистра сведений "СчетаФактурыКомитентовКРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыКомитентовКРегистрации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетаФактурыПоставщиковКПеревыставлениюКомитентам" 

	Дано Я открываю основную форму списка регистра сведений "СчетаФактурыПоставщиковКПеревыставлениюКомитентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыПоставщиковКПеревыставлениюКомитентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетаФактурыПоставщиковКПеревыставлениюКомитентам"

	Дано Я открываю основную форму регистра сведений "СчетаФактурыПоставщиковКПеревыставлениюКомитентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыПоставщиковКПеревыставлениюКомитентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетчикВыгрузокОтчетностиВБанк" 

	Дано Я открываю основную форму списка регистра сведений "СчетчикВыгрузокОтчетностиВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетчикВыгрузокОтчетностиВБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетчикВыгрузокОтчетностиВБанк"

	Дано Я открываю основную форму регистра сведений "СчетчикВыгрузокОтчетностиВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетчикВыгрузокОтчетностиВБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетчикиВыгрузок" 

	Дано Я открываю основную форму списка регистра сведений "СчетчикиВыгрузок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетчикиВыгрузок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетчикиВыгрузок"

	Дано Я открываю основную форму регистра сведений "СчетчикиВыгрузок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетчикиВыгрузок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаблицыГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаблицыГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаможенныеДекларацииЭкспортКРегистрации" 

	Дано Я открываю основную форму списка регистра сведений "ТаможенныеДекларацииЭкспортКРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаможенныеДекларацииЭкспортКРегистрации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаможенныеДекларацииЭкспортКРегистрации"

	Дано Я открываю основную форму регистра сведений "ТаможенныеДекларацииЭкспортКРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаможенныеДекларацииЭкспортКРегистрации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией" 

	Дано Я открываю основную форму списка регистра сведений "ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"

	Дано Я открываю основную форму регистра сведений "ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда" 

	Дано Я открываю основную форму списка регистра сведений "ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"

	Дано Я открываю основную форму регистра сведений "ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифыСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "ТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифыСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "ТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТекущаяТарифнаяСтавкаСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ТекущаяТарифнаяСтавкаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущаяТарифнаяСтавкаСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТекущаяТарифнаяСтавкаСотрудников"

	Дано Я открываю основную форму регистра сведений "ТекущаяТарифнаяСтавкаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущаяТарифнаяСтавкаСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТекущиеИтогиПоСтатусамEDI" 

	Дано Я открываю основную форму списка регистра сведений "ТекущиеИтогиПоСтатусамEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущиеИтогиПоСтатусамEDI"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТекущиеИтогиПоСтатусамEDI"

	Дано Я открываю основную форму регистра сведений "ТекущиеИтогиПоСтатусамEDI"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущиеИтогиПоСтатусамEDI"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТекущиеКадровыеДанныеСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ТекущиеКадровыеДанныеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущиеКадровыеДанныеСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТекущиеКадровыеДанныеСотрудников"

	Дано Я открываю основную форму регистра сведений "ТекущиеКадровыеДанныеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущиеКадровыеДанныеСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриториальныеУсловияДополнительныеПФР" 

	Дано Я открываю основную форму списка регистра сведений "ТерриториальныеУсловияДополнительныеПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриториальныеУсловияДополнительныеПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриториальныеУсловияДополнительныеПФР"

	Дано Я открываю основную форму регистра сведений "ТерриториальныеУсловияДополнительныеПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриториальныеУсловияДополнительныеПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриториальныеУсловияПФР" 

	Дано Я открываю основную форму списка регистра сведений "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриториальныеУсловияПФР"

	Дано Я открываю основную форму регистра сведений "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииОрганизацийПоКоронавирусу" 

	Дано Я открываю основную форму списка регистра сведений "ТерриторииОрганизацийПоКоронавирусу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииОрганизацийПоКоронавирусу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииОрганизацийПоКоронавирусу"

	Дано Я открываю основную форму регистра сведений "ТерриторииОрганизацийПоКоронавирусу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииОрганизацийПоКоронавирусу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ТерриторииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииСотрудников"

	Дано Я открываю основную форму регистра сведений "ТерриторииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииСотрудниковИнтервальный" 

	Дано Я открываю основную форму списка регистра сведений "ТерриторииСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудниковИнтервальный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииСотрудниковИнтервальный"

	Дано Я открываю основную форму регистра сведений "ТерриторииСотрудниковИнтервальный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудниковИнтервальный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ТерриторииСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ТерриторииСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТикетыОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ТикетыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТикетыОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТикетыОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ТикетыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТикетыОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварныеОграничения" 

	Дано Я открываю основную форму списка регистра сведений "ТоварныеОграничения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварныеОграничения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварныеОграничения"

	Дано Я открываю основную форму регистра сведений "ТоварныеОграничения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварныеОграничения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыДругогоКачества" 

	Дано Я открываю основную форму списка регистра сведений "ТоварыДругогоКачества"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварыДругогоКачества"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыДругогоКачества"

	Дано Я открываю основную форму регистра сведений "ТоварыДругогоКачества"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварыДругогоКачества"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКДоставке" 

	Дано Я открываю основную форму списка регистра сведений "ТоварыКДоставке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварыКДоставке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКДоставке"

	Дано Я открываю основную форму регистра сведений "ТоварыКДоставке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварыКДоставке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТорговыеПредложенияТорговойПлощадки" 

	Дано Я открываю основную форму списка регистра сведений "ТорговыеПредложенияТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТорговыеПредложенияТорговойПлощадки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТорговыеПредложенияТорговойПлощадки"

	Дано Я открываю основную форму регистра сведений "ТорговыеПредложенияТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТорговыеПредложенияТорговойПлощадки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортныеКонтейнеры" 

	Дано Я открываю основную форму списка регистра сведений "ТранспортныеКонтейнеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТранспортныеКонтейнеры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортныеКонтейнеры"

	Дано Я открываю основную форму регистра сведений "ТранспортныеКонтейнеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТранспортныеКонтейнеры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТраншиЗаймаСотруднику" 

	Дано Я открываю основную форму списка регистра сведений "ТраншиЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТраншиЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТраншиЗаймаСотруднику"

	Дано Я открываю основную форму регистра сведений "ТраншиЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТраншиЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТребуетсяОформлениеСчетаФактуры" 

	Дано Я открываю основную форму списка регистра сведений "ТребуетсяОформлениеСчетаФактуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТребуетсяОформлениеСчетаФактуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТребуетсяОформлениеСчетаФактуры"

	Дано Я открываю основную форму регистра сведений "ТребуетсяОформлениеСчетаФактуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТребуетсяОформлениеСчетаФактуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТребуетсяСправочноеУказаниеСерий" 

	Дано Я открываю основную форму списка регистра сведений "ТребуетсяСправочноеУказаниеСерий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТребуетсяСправочноеУказаниеСерий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТребуетсяСправочноеУказаниеСерий"

	Дано Я открываю основную форму регистра сведений "ТребуетсяСправочноеУказаниеСерий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТребуетсяСправочноеУказаниеСерий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТрудоваяДеятельностьФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ТрудоваяДеятельностьФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТрудоваяДеятельностьФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТрудоваяДеятельностьФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ТрудоваяДеятельностьФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТрудоваяДеятельностьФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомленияОПрочтении" 

	Дано Я открываю основную форму списка регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомленияОПрочтении"

	Дано Я открываю основную форму регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьАктуальныеДокументыЭДО" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьАктуальныеДокументыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьАктуальныеДокументыЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьАктуальныеДокументыЭДО"

	Дано Я открываю основную форму регистра сведений "УдалитьАктуальныеДокументыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьАктуальныеДокументыЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьАналитикаУчетаПартийПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьАналитикаУчетаПартийПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьАналитикаУчетаПартийПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьАналитикаУчетаПартийПроизводства"

	Дано Я открываю основную форму регистра сведений "УдалитьАналитикаУчетаПартийПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьАналитикаУчетаПартийПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВерсииЗаявокКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВерсииЗаявокКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииЗаявокКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВерсииЗаявокКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "УдалитьВерсииЗаявокКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииЗаявокКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВерсииКлассификаторовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВерсииКлассификаторовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииКлассификаторовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВерсииКлассификаторовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьВерсииКлассификаторовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииКлассификаторовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВложенияНеформализованныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВложенияНеформализованныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВложенияНеформализованныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВложенияНеформализованныхДокументов"

	Дано Я открываю основную форму регистра сведений "УдалитьВложенияНеформализованныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВложенияНеформализованныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьГрафикиАмортизацииОСБухгалтерскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьГрафикиАмортизацииОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГрафикиАмортизацииОСБухгалтерскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьГрафикиАмортизацииОСБухгалтерскийУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьГрафикиАмортизацииОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГрафикиАмортизацииОСБухгалтерскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьГрафикНачисленийЛизинга" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьГрафикНачисленийЛизинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГрафикНачисленийЛизинга"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьГрафикНачисленийЛизинга"

	Дано Я открываю основную форму регистра сведений "УдалитьГрафикНачисленийЛизинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГрафикНачисленийЛизинга"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьГрафикОплатЛизинга" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьГрафикОплатЛизинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГрафикОплатЛизинга"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьГрафикОплатЛизинга"

	Дано Я открываю основную форму регистра сведений "УдалитьГрафикОплатЛизинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГрафикОплатЛизинга"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьГрупповыеУпаковкиИСМП" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьГрупповыеУпаковкиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГрупповыеУпаковкиИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьГрупповыеУпаковкиИСМП"

	Дано Я открываю основную форму регистра сведений "УдалитьГрупповыеУпаковкиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГрупповыеУпаковкиИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДополнительныеФайлыУведомлений" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьДополнительныеФайлыУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьДополнительныеФайлыУведомлений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДополнительныеФайлыУведомлений"

	Дано Я открываю основную форму регистра сведений "УдалитьДополнительныеФайлыУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьДополнительныеФайлыУведомлений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЖурналСобытийЭД" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЖурналСобытийЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЖурналСобытийЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЖурналСобытийЭД"

	Дано Я открываю основную форму регистра сведений "УдалитьЖурналСобытийЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЖурналСобытийЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"

	Дано Я открываю основную форму регистра сведений "УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗаданияКРасчетуДлительностиПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗаданияКРасчетуДлительностиПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗаданияКРасчетуДлительностиПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗаданияКРасчетуДлительностиПроизводства"

	Дано Я открываю основную форму регистра сведений "УдалитьЗаданияКРасчетуДлительностиПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗаданияКРасчетуДлительностиПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗамерыВремени3" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремени3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗамерыВремени3"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремени3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьИдентификаторыДокументовОснованийВладельцевЭД" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьИдентификаторыДокументовОснованийВладельцевЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИдентификаторыДокументовОснованийВладельцевЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьИдентификаторыДокументовОснованийВладельцевЭД"

	Дано Я открываю основную форму регистра сведений "УдалитьИдентификаторыДокументовОснованийВладельцевЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИдентификаторыДокументовОснованийВладельцевЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКлючиДоступаКРегиструПриглашенияКОбменуЭлектроннымиДокументами" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьКлючиДоступаКРегиструПриглашенияКОбменуЭлектроннымиДокументами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьКлючиДоступаКРегиструПриглашенияКОбменуЭлектроннымиДокументами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКлючиДоступаКРегиструПриглашенияКОбменуЭлектроннымиДокументами"

	Дано Я открываю основную форму регистра сведений "УдалитьКлючиДоступаКРегиструПриглашенияКОбменуЭлектроннымиДокументами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьКлючиДоступаКРегиструПриглашенияКОбменуЭлектроннымиДокументами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЛицевыеСчетаСотрудниковПоЗарплатнымПроектам" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"

	Дано Я открываю основную форму регистра сведений "УдалитьЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьМестонахождениеОСБухгалтерскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьМестонахождениеОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьМестонахождениеОСБухгалтерскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьМестонахождениеОСБухгалтерскийУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьМестонахождениеОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьМестонахождениеОСБухгалтерскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиОбменаФСС" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНастройкиОбменаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиОбменаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиОбменаФСС"

	Дано Я открываю основную форму регистра сведений "УдалитьНастройкиОбменаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиОбменаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиРаспределения" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНастройкиРаспределения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиРаспределения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиРаспределения"

	Дано Я открываю основную форму регистра сведений "УдалитьНастройкиРаспределения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиРаспределения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиТранспортаОбмена" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиТранспортаОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиТранспортаОбмена"

	Дано Я открываю основную форму регистра сведений "УдалитьНастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиТранспортаОбмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьНачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНачислениеАмортизацииОСБухгалтерскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНачислениеАмортизацииОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачислениеАмортизацииОСБухгалтерскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНачислениеАмортизацииОСБухгалтерскийУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьНачислениеАмортизацииОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачислениеАмортизацииОСБухгалтерскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНачислениеАмортизацииОСНалоговыйУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНачислениеАмортизацииОСНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачислениеАмортизацииОСНалоговыйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНачислениеАмортизацииОСНалоговыйУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьНачислениеАмортизацииОСНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачислениеАмортизацииОСНалоговыйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьНачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"

	Дано Я открываю основную форму регистра сведений "УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНовыеДокументыВСервисеЭДО" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНовыеДокументыВСервисеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНовыеДокументыВСервисеЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНовыеДокументыВСервисеЭДО"

	Дано Я открываю основную форму регистра сведений "УдалитьНовыеДокументыВСервисеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНовыеДокументыВСервисеЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОбластиПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОбластиПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму регистра сведений "УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОтветыНаЗапросыИОН" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОтветыНаЗапросыИОН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОтветыНаЗапросыИОН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОтветыНаЗапросыИОН"

	Дано Я открываю основную форму регистра сведений "УдалитьОтветыНаЗапросыИОН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОтветыНаЗапросыИОН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОчередьРасчетаПланаПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОчередьРасчетаПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьРасчетаПланаПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОчередьРасчетаПланаПроизводства"

	Дано Я открываю основную форму регистра сведений "УдалитьОчередьРасчетаПланаПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьРасчетаПланаПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПараметрыАмортизацииОСБухгалтерскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПараметрыАмортизацииОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыАмортизацииОСБухгалтерскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПараметрыАмортизацииОСБухгалтерскийУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьПараметрыАмортизацииОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыАмортизацииОСБухгалтерскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПараметрыАмортизацииОСНалоговыйУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПараметрыАмортизацииОСНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыАмортизацииОСНалоговыйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПараметрыАмортизацииОСНалоговыйУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьПараметрыАмортизацииОСНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыАмортизацииОСНалоговыйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПараметрыИнтернетПоддержкиПользователей" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПараметрыИнтернетПоддержкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыИнтернетПоддержкиПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПараметрыИнтернетПоддержкиПользователей"

	Дано Я открываю основную форму регистра сведений "УдалитьПараметрыИнтернетПоддержкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыИнтернетПоддержкиПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПервоначальныеСведенияНМАБухгалтерскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПервоначальныеСведенияНМАБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПервоначальныеСведенияНМАБухгалтерскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПервоначальныеСведенияНМАБухгалтерскийУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьПервоначальныеСведенияНМАБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПервоначальныеСведенияНМАБухгалтерскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПервоначальныеСведенияНМАНалоговыйУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПервоначальныеСведенияНМАНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПервоначальныеСведенияНМАНалоговыйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПервоначальныеСведенияНМАНалоговыйУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьПервоначальныеСведенияНМАНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПервоначальныеСведенияНМАНалоговыйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПервоначальныеСведенияОСБухгалтерскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПервоначальныеСведенияОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПервоначальныеСведенияОСБухгалтерскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПервоначальныеСведенияОСБухгалтерскийУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьПервоначальныеСведенияОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПервоначальныеСведенияОСБухгалтерскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПервоначальныеСведенияОСНалоговыйУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПервоначальныеСведенияОСНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПервоначальныеСведенияОСНалоговыйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПервоначальныеСведенияОСНалоговыйУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьПервоначальныеСведенияОСНалоговыйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПервоначальныеСведенияОСНалоговыйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПодпискиНаУведомленияОбЭЛН" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПодпискиНаУведомленияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПодпискиНаУведомленияОбЭЛН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПодпискиНаУведомленияОбЭЛН"

	Дано Я открываю основную форму регистра сведений "УдалитьПодпискиНаУведомленияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПодпискиНаУведомленияОбЭЛН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПорядокОтраженияДоходов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПорядокОтраженияДоходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияДоходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПорядокОтраженияДоходов"

	Дано Я открываю основную форму регистра сведений "УдалитьПорядокОтраженияДоходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияДоходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПорядокОтраженияНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПорядокОтраженияНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПорядокОтраженияНоменклатуры"

	Дано Я открываю основную форму регистра сведений "УдалитьПорядокОтраженияНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПорядокОтраженияНоменклатурыПереданной" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПорядокОтраженияНоменклатурыПереданной"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияНоменклатурыПереданной"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПорядокОтраженияНоменклатурыПереданной"

	Дано Я открываю основную форму регистра сведений "УдалитьПорядокОтраженияНоменклатурыПереданной"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияНоменклатурыПереданной"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПорядокОтраженияПодарочныхСертификатов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПорядокОтраженияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПорядокОтраженияПодарочныхСертификатов"

	Дано Я открываю основную форму регистра сведений "УдалитьПорядокОтраженияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПорядокОтраженияПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПорядокОтраженияПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПорядокОтраженияПроизводства"

	Дано Я открываю основную форму регистра сведений "УдалитьПорядокОтраженияПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПорядокОтраженияРасходов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПорядокОтраженияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПорядокОтраженияРасходов"

	Дано Я открываю основную форму регистра сведений "УдалитьПорядокОтраженияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПорядокОтраженияРасчетовСПартнерами" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПорядокОтраженияРасчетовСПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияРасчетовСПартнерами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПорядокОтраженияРасчетовСПартнерами"

	Дано Я открываю основную форму регистра сведений "УдалитьПорядокОтраженияРасчетовСПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияРасчетовСПартнерами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПорядокОтраженияРезервов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПорядокОтраженияРезервов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияРезервов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПорядокОтраженияРезервов"

	Дано Я открываю основную форму регистра сведений "УдалитьПорядокОтраженияРезервов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияРезервов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПорядокОтраженияТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПорядокОтраженияТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПорядокОтраженияТМЦВЭксплуатации"

	Дано Я открываю основную форму регистра сведений "УдалитьПорядокОтраженияТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПорядокОтраженияТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПриглашенияКОбменуЭлектроннымиДокументами" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПриглашенияКОбменуЭлектроннымиДокументами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПриглашенияКОбменуЭлектроннымиДокументами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПриглашенияКОбменуЭлектроннымиДокументами"

	Дано Я открываю основную форму регистра сведений "УдалитьПриглашенияКОбменуЭлектроннымиДокументами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПриглашенияКОбменуЭлектроннымиДокументами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПротоколОбменаЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПротоколОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПротоколОбменаЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПротоколОбменаЕГАИС"

	Дано Я открываю основную форму регистра сведений "УдалитьПротоколОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПротоколОбменаЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПротоколыРасчетаПлановПроизводства" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПротоколыРасчетаПлановПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПротоколыРасчетаПлановПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПротоколыРасчетаПлановПроизводства"

	Дано Я открываю основную форму регистра сведений "УдалитьПротоколыРасчетаПлановПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПротоколыРасчетаПлановПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРегистрацияЗемельныхУчастков" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРегистрацияЗемельныхУчастков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРегистрацияЗемельныхУчастков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРегистрацияЗемельныхУчастков"

	Дано Я открываю основную форму регистра сведений "УдалитьРегистрацияЗемельныхУчастков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРегистрацияЗемельныхУчастков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРегистрацияТранспортныхСредств" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРегистрацияТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРегистрацияТранспортныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРегистрацияТранспортныхСредств"

	Дано Я открываю основную форму регистра сведений "УдалитьРегистрацияТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРегистрацияТранспортныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРеестрДокументов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРеестрДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРеестрДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРеестрДокументов"

	Дано Я открываю основную форму регистра сведений "УдалитьРеестрДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРеестрДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРезультатыОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРезультатыОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРезультатыОбменаДанными"

	Дано Я открываю основную форму регистра сведений "УдалитьРезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРезультатыОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРесурсыМеханизмаОнлайнСервисовРО" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРесурсыМеханизмаОнлайнСервисовРО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРесурсыМеханизмаОнлайнСервисовРО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРесурсыМеханизмаОнлайнСервисовРО"

	Дано Я открываю основную форму регистра сведений "УдалитьРесурсыМеханизмаОнлайнСервисовРО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРесурсыМеханизмаОнлайнСервисовРО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСогласияНаУведомленияОбЭЛН" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСогласияНаУведомленияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСогласияНаУведомленияОбЭЛН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСогласияНаУведомленияОбЭЛН"

	Дано Я открываю основную форму регистра сведений "УдалитьСогласияНаУведомленияОбЭЛН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСогласияНаУведомленияОбЭЛН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСоответствиеЗначенийРеквизитовБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСоответствиеЗначенийРеквизитовБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеЗначенийРеквизитовБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСоответствиеЗначенийРеквизитовБизнесСеть"

	Дано Я открываю основную форму регистра сведений "УдалитьСоответствиеЗначенийРеквизитовБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеЗначенийРеквизитовБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСоответствиеНоменклатурыБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСоответствиеНоменклатурыБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеНоменклатурыБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСоответствиеНоменклатурыБизнесСеть"

	Дано Я открываю основную форму регистра сведений "УдалитьСоответствиеНоменклатурыБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеНоменклатурыБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСоответствиеПоискаРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСоответствиеПоискаРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеПоискаРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСоответствиеПоискаРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "УдалитьСоответствиеПоискаРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеПоискаРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСоответствиеРеквизитовБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСоответствиеРеквизитовБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеРеквизитовБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСоответствиеРеквизитовБизнесСеть"

	Дано Я открываю основную форму регистра сведений "УдалитьСоответствиеРеквизитовБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеРеквизитовБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСостоянияНМАОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСостоянияНМАОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСостоянияНМАОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСостоянияНМАОрганизаций"

	Дано Я открываю основную форму регистра сведений "УдалитьСостоянияНМАОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСостоянияНМАОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСостоянияОСОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСостоянияОСОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСостоянияОСОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСостоянияОСОрганизаций"

	Дано Я открываю основную форму регистра сведений "УдалитьСостоянияОСОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСостоянияОСОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьСпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет"

	Дано Я открываю основную форму регистра сведений "УдалитьСпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСтатусОбменовСЯндексКассой" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСтатусОбменовСЯндексКассой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтатусОбменовСЯндексКассой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСтатусОбменовСЯндексКассой"

	Дано Я открываю основную форму регистра сведений "УдалитьСтатусОбменовСЯндексКассой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтатусОбменовСЯндексКассой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСтатусыРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСтатусыРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтатусыРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСтатусыРегламентированныхОтчетов"

	Дано Я открываю основную форму регистра сведений "УдалитьСтатусыРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтатусыРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСчетаБухгалтерскогоУчетаНМА" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСчетаБухгалтерскогоУчетаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСчетаБухгалтерскогоУчетаНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСчетаБухгалтерскогоУчетаНМА"

	Дано Я открываю основную форму регистра сведений "УдалитьСчетаБухгалтерскогоУчетаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСчетаБухгалтерскогоУчетаНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСчетаБухгалтерскогоУчетаОС" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСчетаБухгалтерскогоУчетаОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСчетаБухгалтерскогоУчетаОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСчетаБухгалтерскогоУчетаОС"

	Дано Я открываю основную форму регистра сведений "УдалитьСчетаБухгалтерскогоУчетаОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСчетаБухгалтерскогоУчетаОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьУчастникиОбменовЭДЧерезОператоровЭДО" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"

	Дано Я открываю основную форму регистра сведений "УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьУчетнаяПолитикаОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьУчетнаяПолитикаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьУчетнаяПолитикаОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьУчетнаяПолитикаОрганизаций"

	Дано Я открываю основную форму регистра сведений "УдалитьУчетнаяПолитикаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьУчетнаяПолитикаОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"

	Дано Я открываю основную форму регистра сведений "УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьФайлыСведенийРОКИ" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьФайлыСведенийРОКИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыСведенийРОКИ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьФайлыСведенийРОКИ"

	Дано Я открываю основную форму регистра сведений "УдалитьФайлыСведенийРОКИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыСведенийРОКИ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьФайлыСведенийСпецоператоры" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьФайлыСведенийСпецоператоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыСведенийСпецоператоры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьФайлыСведенийСпецоператоры"

	Дано Я открываю основную форму регистра сведений "УдалитьФайлыСведенийСпецоператоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыСведенийСпецоператоры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьФорматыОбменаЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьФорматыОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФорматыОбменаЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьФорматыОбменаЕГАИС"

	Дано Я открываю основную форму регистра сведений "УдалитьФорматыОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФорматыОбменаЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"

	Дано Я открываю основную форму регистра сведений "УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьХранимыеФайлыВерсий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьХранимыеФайлыВерсий"

	Дано Я открываю основную форму регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдаляемыеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "УдаляемыеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдаляемыеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдаляемыеОбъекты"

	Дано Я открываю основную форму регистра сведений "УдаляемыеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдаляемыеОбъекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УзлыКомпонентыАмортизации" 

	Дано Я открываю основную форму списка регистра сведений "УзлыКомпонентыАмортизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УзлыКомпонентыАмортизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УзлыКомпонентыАмортизации"

	Дано Я открываю основную форму регистра сведений "УзлыКомпонентыАмортизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УзлыКомпонентыАмортизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УровниСокращенийАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УровниСокращенийАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияВыплатПоДоговоруОпеки" 

	Дано Я открываю основную форму списка регистра сведений "УсловияВыплатПоДоговоруОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияВыплатПоДоговоруОпеки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияВыплатПоДоговоруОпеки"

	Дано Я открываю основную форму регистра сведений "УсловияВыплатПоДоговоруОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияВыплатПоДоговоруОпеки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияДоговораГПХ" 

	Дано Я открываю основную форму списка регистра сведений "УсловияДоговораГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораГПХ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияДоговораГПХ"

	Дано Я открываю основную форму регистра сведений "УсловияДоговораГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораГПХ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияДоговораЗаймаСотруднику" 

	Дано Я открываю основную форму списка регистра сведений "УсловияДоговораЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияДоговораЗаймаСотруднику"

	Дано Я открываю основную форму регистра сведений "УсловияДоговораЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияДоговораОпеки" 

	Дано Я открываю основную форму списка регистра сведений "УсловияДоговораОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораОпеки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияДоговораОпеки"

	Дано Я открываю основную форму регистра сведений "УсловияДоговораОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораОпеки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияДоговоровАренды" 

	Дано Я открываю основную форму списка регистра сведений "УсловияДоговоровАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговоровАренды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияДоговоровАренды"

	Дано Я открываю основную форму регистра сведений "УсловияДоговоровАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговоровАренды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияЗакупок" 

	Дано Я открываю основную форму списка регистра сведений "УсловияЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияЗакупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияЗакупок"

	Дано Я открываю основную форму регистра сведений "УсловияЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияЗакупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияОплатыОтпускаПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка регистра сведений "УсловияОплатыОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияОплатыОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияОплатыОтпускаПоУходуЗаРебенком"

	Дано Я открываю основную форму регистра сведений "УсловияОплатыОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияОплатыОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияОплатыОтпускаПоУходуЗаРебенкомИспр" 

	Дано Я открываю основную форму списка регистра сведений "УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"

	Дано Я открываю основную форму регистра сведений "УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияУдержанияПоИсполнительномуДокументу" 

	Дано Я открываю основную форму списка регистра сведений "УсловияУдержанияПоИсполнительномуДокументу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияУдержанияПоИсполнительномуДокументу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияУдержанияПоИсполнительномуДокументу"

	Дано Я открываю основную форму регистра сведений "УсловияУдержанияПоИсполнительномуДокументу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияУдержанияПоИсполнительномуДокументу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УспешныеОбменыССайтом" 

	Дано Я открываю основную форму списка регистра сведений "УспешныеОбменыССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УспешныеОбменыССайтом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УспешныеОбменыССайтом"

	Дано Я открываю основную форму регистра сведений "УспешныеОбменыССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УспешныеОбменыССайтом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстаревшиеВидыЗапасовСОстатками" 

	Дано Я открываю основную форму списка регистра сведений "УстаревшиеВидыЗапасовСОстатками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УстаревшиеВидыЗапасовСОстатками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстаревшиеВидыЗапасовСОстатками"

	Дано Я открываю основную форму регистра сведений "УстаревшиеВидыЗапасовСОстатками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УстаревшиеВидыЗапасовСОстатками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УченыеЗванияФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "УченыеЗванияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УченыеЗванияФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченыеЗванияФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "УченыеЗванияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УченыеЗванияФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УченыеСтепениФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "УченыеСтепениФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УченыеСтепениФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченыеСтепениФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "УченыеСтепениФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УченыеСтепениФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетнаяПолитикаБухУчета" 

	Дано Я открываю основную форму списка регистра сведений "УчетнаяПолитикаБухУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаБухУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетнаяПолитикаБухУчета"

	Дано Я открываю основную форму регистра сведений "УчетнаяПолитикаБухУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаБухУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетнаяПолитикаПоНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "УчетнаяПолитикаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетнаяПолитикаПоНДФЛ"

	Дано Я открываю основную форму регистра сведений "УчетнаяПолитикаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетнаяПолитикаПоНДФЛРасширенный" 

	Дано Я открываю основную форму списка регистра сведений "УчетнаяПолитикаПоНДФЛРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаПоНДФЛРасширенный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетнаяПолитикаПоНДФЛРасширенный"

	Дано Я открываю основную форму регистра сведений "УчетнаяПолитикаПоНДФЛРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаПоНДФЛРасширенный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетнаяПолитикаФинансовогоУчета" 

	Дано Я открываю основную форму списка регистра сведений "УчетнаяПолитикаФинансовогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаФинансовогоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетнаяПолитикаФинансовогоУчета"

	Дано Я открываю основную форму регистра сведений "УчетнаяПолитикаФинансовогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаФинансовогоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиЭДО" 

	Дано Я открываю основную форму списка регистра сведений "УчетныеЗаписиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетныеЗаписиЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиЭДО"

	Дано Я открываю основную форму регистра сведений "УчетныеЗаписиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетныеЗаписиЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыВРабочемКаталоге" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыВРабочемКаталоге"

	Дано Я открываю основную форму регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыДокументовРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"

	Дано Я открываю основную форму регистра сведений "ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ФайлыОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыСведенийРОКИ" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыСведенийРОКИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыСведенийРОКИ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыСведенийРОКИ"

	Дано Я открываю основную форму регистра сведений "ФайлыСведенийРОКИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыСведенийРОКИ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыСведенийСпецоператоры" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыСведенийСпецоператоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыСведенийСпецоператоры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыСведенийСпецоператоры"

	Дано Я открываю основную форму регистра сведений "ФайлыСведенийСпецоператоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыСведенийСпецоператоры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛицаДляОбновленияПубликацииВычетовНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ФизическиеЛицаДляОбновленияПубликацииВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФизическиеЛицаДляОбновленияПубликацииВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛицаДляОбновленияПубликацииВычетовНДФЛ"

	Дано Я открываю основную форму регистра сведений "ФизическиеЛицаДляОбновленияПубликацииВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФизическиеЛицаДляОбновленияПубликацииВычетовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛицаДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ФизическиеЛицаДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФизическиеЛицаДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛицаДокументов"

	Дано Я открываю основную форму регистра сведений "ФизическиеЛицаДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФизическиеЛицаДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛицаКабинетСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ФизическиеЛицаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФизическиеЛицаКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛицаКабинетСотрудника"

	Дано Я открываю основную форму регистра сведений "ФизическиеЛицаКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФизическиеЛицаКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФИОФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ФИОФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФИОФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФИОФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ФИОФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФИОФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФискальныеОперации" 

	Дано Я открываю основную форму списка регистра сведений "ФискальныеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФискальныеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФискальныеОперации"

	Дано Я открываю основную форму регистра сведений "ФискальныеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФискальныеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Форма57ТРаздел2Сотрудники" 

	Дано Я открываю основную форму списка регистра сведений "Форма57ТРаздел2Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Форма57ТРаздел2Сотрудники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Форма57ТРаздел2Сотрудники"

	Дано Я открываю основную форму регистра сведений "Форма57ТРаздел2Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Форма57ТРаздел2Сотрудники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФорматыДляПреобразования" 

	Дано Я открываю основную форму списка регистра сведений "ФорматыДляПреобразования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФорматыДляПреобразования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФорматыДляПреобразования"

	Дано Я открываю основную форму регистра сведений "ФорматыДляПреобразования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФорматыДляПреобразования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФорматыЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ФорматыЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФорматыЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФорматыЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "ФорматыЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФорматыЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФотографииФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ФотографииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФотографииФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФотографииФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ФотографииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФотографииФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХозяйственныеОперацииНеОтражаемыеВМеждународномУчете" 

	Дано Я открываю основную форму списка регистра сведений "ХозяйственныеОперацииНеОтражаемыеВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХозяйственныеОперацииНеОтражаемыеВМеждународномУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХозяйственныеОперацииНеОтражаемыеВМеждународномУчете"

	Дано Я открываю основную форму регистра сведений "ХозяйственныеОперацииНеОтражаемыеВМеждународномУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХозяйственныеОперацииНеОтражаемыеВМеждународномУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранилищеСертификатов" 

	Дано Я открываю основную форму списка регистра сведений "ХранилищеСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранилищеСертификатов"

	Дано Я открываю основную форму регистра сведений "ХранилищеСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"

	Дано Я открываю основную форму регистра сведений "ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦелевыеЗначенияВариантовАнализа" 

	Дано Я открываю основную форму списка регистра сведений "ЦелевыеЗначенияВариантовАнализа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦелевыеЗначенияВариантовАнализа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦелевыеЗначенияВариантовАнализа"

	Дано Я открываю основную форму регистра сведений "ЦелевыеЗначенияВариантовАнализа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦелевыеЗначенияВариантовАнализа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеныНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "ЦеныНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеныНоменклатуры"

	Дано Я открываю основную форму регистра сведений "ЦеныНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеныНоменклатуры25" 

	Дано Я открываю основную форму списка регистра сведений "ЦеныНоменклатуры25"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатуры25"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеныНоменклатуры25"

	Дано Я открываю основную форму регистра сведений "ЦеныНоменклатуры25"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатуры25"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеныНоменклатурыПоставщиков" 

	Дано Я открываю основную форму списка регистра сведений "ЦеныНоменклатурыПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатурыПоставщиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеныНоменклатурыПоставщиков"

	Дано Я открываю основную форму регистра сведений "ЦеныНоменклатурыПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатурыПоставщиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныПечатиМашиночитаемыхФорм" 

	Дано Я открываю основную форму списка регистра сведений "ШаблоныПечатиМашиночитаемыхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШаблоныПечатиМашиночитаемыхФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныПечатиМашиночитаемыхФорм"

	Дано Я открываю основную форму регистра сведений "ШаблоныПечатиМашиночитаемыхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШаблоныПечатиМашиночитаемыхФорм"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЭВФОтчетовСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ШаблоныЭВФОтчетовСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШаблоныЭВФОтчетовСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЭВФОтчетовСтатистики"

	Дано Я открываю основную форму регистра сведений "ШаблоныЭВФОтчетовСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШаблоныЭВФОтчетовСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШтатноеРасписаниеПодключаемыеХарактеристики" 

	Дано Я открываю основную форму списка регистра сведений "ШтатноеРасписаниеПодключаемыеХарактеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШтатноеРасписаниеПодключаемыеХарактеристики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШтатноеРасписаниеПодключаемыеХарактеристики"

	Дано Я открываю основную форму регистра сведений "ШтатноеРасписаниеПодключаемыеХарактеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШтатноеРасписаниеПодключаемыеХарактеристики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШтрихкодыНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "ШтрихкодыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШтрихкодыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШтрихкодыНоменклатуры"

	Дано Я открываю основную форму регистра сведений "ШтрихкодыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШтрихкодыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныеПодписи" 

	Дано Я открываю основную форму списка регистра сведений "ЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЭлектронныеПодписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныеПодписи"

	Дано Я открываю основную форму регистра сведений "ЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЭлектронныеПодписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвансовыеПлатежиИностранцевПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "АвансовыеПлатежиИностранцевПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления АвансовыеПлатежиИностранцевПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыеПлатежиИностранцевПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "АвансовыеПлатежиИностранцевПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления АвансовыеПлатежиИностранцевПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияНМА" 

	Дано Я открываю основную форму списка регистра накопления "АмортизацияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления АмортизацияНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияНМА"

	Дано Я открываю основную форму регистра накопления "АмортизацияНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления АмортизацияНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияОС" 

	Дано Я открываю основную форму списка регистра накопления "АмортизацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления АмортизацияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияОС"

	Дано Я открываю основную форму регистра накопления "АмортизацияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления АмортизацияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БонусныеБаллы" 

	Дано Я открываю основную форму списка регистра накопления "БонусныеБаллы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БонусныеБаллы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БонусныеБаллы"

	Дано Я открываю основную форму регистра накопления "БонусныеБаллы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БонусныеБаллы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БракВПроизводстве" 

	Дано Я открываю основную форму списка регистра накопления "БракВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БракВПроизводстве"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БракВПроизводстве"

	Дано Я открываю основную форму регистра накопления "БракВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БракВПроизводстве"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухгалтерскиеВзаиморасчетыССотрудниками" 

	Дано Я открываю основную форму списка регистра накопления "БухгалтерскиеВзаиморасчетыССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухгалтерскиеВзаиморасчетыССотрудниками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухгалтерскиеВзаиморасчетыССотрудниками"

	Дано Я открываю основную форму регистра накопления "БухгалтерскиеВзаиморасчетыССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухгалтерскиеВзаиморасчетыССотрудниками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетНачисленияУдержанияПоКонтрагентамАкционерам" 

	Дано Я открываю основную форму списка регистра накопления "БухучетНачисленияУдержанияПоКонтрагентамАкционерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоКонтрагентамАкционерам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетНачисленияУдержанияПоКонтрагентамАкционерам"

	Дано Я открываю основную форму регистра накопления "БухучетНачисленияУдержанияПоКонтрагентамАкционерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоКонтрагентамАкционерам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетНачисленияУдержанияПоСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "БухучетНачисленияУдержанияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетНачисленияУдержанияПоСотрудникам"

	Дано Я открываю основную форму регистра накопления "БухучетНачисленияУдержанияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетНачисленияУдержанияПоСотрудникамАвансом" 

	Дано Я открываю основную форму списка регистра накопления "БухучетНачисленияУдержанияПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоСотрудникамАвансом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетНачисленияУдержанияПоСотрудникамАвансом"

	Дано Я открываю основную форму регистра накопления "БухучетНачисленияУдержанияПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоСотрудникамАвансом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаиморасчетыПоЗаймамСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "ВзаиморасчетыПоЗаймамСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыПоЗаймамСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаиморасчетыПоЗаймамСотрудникам"

	Дано Я открываю основную форму регистра накопления "ВзаиморасчетыПоЗаймамСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыПоЗаймамСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаиморасчетыСКонтрагентамиАкционерами" 

	Дано Я открываю основную форму списка регистра накопления "ВзаиморасчетыСКонтрагентамиАкционерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыСКонтрагентамиАкционерами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаиморасчетыСКонтрагентамиАкционерами"

	Дано Я открываю основную форму регистра накопления "ВзаиморасчетыСКонтрагентамиАкционерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыСКонтрагентамиАкционерами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаиморасчетыССотрудниками" 

	Дано Я открываю основную форму списка регистра накопления "ВзаиморасчетыССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыССотрудниками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаиморасчетыССотрудниками"

	Дано Я открываю основную форму регистра накопления "ВзаиморасчетыССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыССотрудниками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыпускПродукции" 

	Дано Я открываю основную форму списка регистра накопления "ВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыпускПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыпускПродукции"

	Дано Я открываю основную форму регистра накопления "ВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыпускПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыработкаНМА" 

	Дано Я открываю основную форму списка регистра накопления "ВыработкаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыработкаНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыработкаНМА"

	Дано Я открываю основную форму регистра накопления "ВыработкаНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыработкаНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыручкаИСебестоимостьПродаж" 

	Дано Я открываю основную форму списка регистра накопления "ВыручкаИСебестоимостьПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыручкаИСебестоимостьПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыручкаИСебестоимостьПродаж"

	Дано Я открываю основную форму регистра накопления "ВыручкаИСебестоимостьПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыручкаИСебестоимостьПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВытесняемоеПлановоеВремяСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ВытесняемоеПлановоеВремяСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВытесняемоеПлановоеВремяСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВытесняемоеПлановоеВремяСотрудников"

	Дано Я открываю основную форму регистра накопления "ВытесняемоеПлановоеВремяСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВытесняемоеПлановоеВремяСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеИндивидуальныхГрафиковСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеИндивидуальныхГрафиковСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеИндивидуальныхГрафиковСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеИндивидуальныхГрафиковСотрудников"

	Дано Я открываю основную форму регистра накопления "ДанныеИндивидуальныхГрафиковСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеИндивидуальныхГрафиковСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОВремениДляРасчетаСреднегоОбщий" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОВремениДляРасчетаСреднегоОбщий"

	Дано Я открываю основную форму регистра накопления "ДанныеОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"

	Дано Я открываю основную форму регистра накопления "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"

	Дано Я открываю основную форму регистра накопления "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОперативногоУчетаРабочегоВремениСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеОперативногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОперативногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОперативногоУчетаРабочегоВремениСотрудников"

	Дано Я открываю основную форму регистра накопления "ДанныеОперативногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОперативногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеСводногоУчетаРабочегоВремениСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеСводногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеСводногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеСводногоУчетаРабочегоВремениСотрудников"

	Дано Я открываю основную форму регистра накопления "ДанныеСводногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеСводногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"

	Дано Я открываю основную форму регистра накопления "ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеТабельногоУчетаРабочегоВремениСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеТабельногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеТабельногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеТабельногоУчетаРабочегоВремениСотрудников"

	Дано Я открываю основную форму регистра накопления "ДанныеТабельногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеТабельногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияДенежныеСредстваДоходыРасходы" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияДенежныеСредстваДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныеСредстваДоходыРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияДенежныеСредстваДоходыРасходы"

	Дано Я открываю основную форму регистра накопления "ДвиженияДенежныеСредстваДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныеСредстваДоходыРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияДенежныеСредстваКонтрагент" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияДенежныеСредстваКонтрагент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныеСредстваКонтрагент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияДенежныеСредстваКонтрагент"

	Дано Я открываю основную форму регистра накопления "ДвиженияДенежныеСредстваКонтрагент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныеСредстваКонтрагент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияДенежныхСредств" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияДенежныхСредств"

	Дано Я открываю основную форму регистра накопления "ДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияДоходыРасходыПрочиеАктивыПассивы" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияДоходыРасходыПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДоходыРасходыПрочиеАктивыПассивы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияДоходыРасходыПрочиеАктивыПассивы"

	Дано Я открываю основную форму регистра накопления "ДвиженияДоходыРасходыПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДоходыРасходыПрочиеАктивыПассивы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияКонтрагентДоходыРасходы" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияКонтрагентДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияКонтрагентДоходыРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияКонтрагентДоходыРасходы"

	Дано Я открываю основную форму регистра накопления "ДвиженияКонтрагентДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияКонтрагентДоходыРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияКонтрагентКонтрагент" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияКонтрагентКонтрагент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияКонтрагентКонтрагент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияКонтрагентКонтрагент"

	Дано Я открываю основную форму регистра накопления "ДвиженияКонтрагентКонтрагент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияКонтрагентКонтрагент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияНоменклатураДоходыРасходы" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияНоменклатураДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияНоменклатураДоходыРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияНоменклатураДоходыРасходы"

	Дано Я открываю основную форму регистра накопления "ДвиженияНоменклатураДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияНоменклатураДоходыРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияНоменклатураНоменклатура" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияНоменклатураНоменклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияНоменклатураНоменклатура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияНоменклатураНоменклатура"

	Дано Я открываю основную форму регистра накопления "ДвиженияНоменклатураНоменклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияНоменклатураНоменклатура"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияПоНДС" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияПоНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияПоНДС"

	Дано Я открываю основную форму регистра накопления "ДвиженияПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияПоНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияПоПрочимАктивамПассивам" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияПоПрочимАктивамПассивам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияПоПрочимАктивамПассивам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияПоПрочимАктивамПассивам"

	Дано Я открываю основную форму регистра накопления "ДвиженияПоПрочимАктивамПассивам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияПоПрочимАктивамПассивам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияСерийТоваров" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияСерийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияСерийТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияСерийТоваров"

	Дано Я открываю основную форму регистра накопления "ДвиженияСерийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияСерийТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеДокументы" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеДокументы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеДокументы"

	Дано Я открываю основную форму регистра накопления "ДенежныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеДокументы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваБезналичные" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваБезналичные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваБезналичные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваБезналичные"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваБезналичные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваБезналичные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваВКассахККМ" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваВКассахККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваВКассахККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваВКассахККМ"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваВКассахККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваВКассахККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваВПути" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваВПути"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваВПути"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваВПути"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваВПути"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваВПути"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваКВыплате" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваКВыплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваКВыплате"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваКВыплате"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваКВыплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваКВыплате"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваНаличные" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваНаличные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваНаличные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваНаличные"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваНаличные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваНаличные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваУПодотчетныхЛиц" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваУПодотчетныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваУПодотчетныхЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваУПодотчетныхЛиц"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваУПодотчетныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваУПодотчетныхЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДетализацияПартийТоваровДляНДСиУСН" 

	Дано Я открываю основную форму списка регистра накопления "ДетализацияПартийТоваровДляНДСиУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДетализацияПартийТоваровДляНДСиУСН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДетализацияПартийТоваровДляНДСиУСН"

	Дано Я открываю основную форму регистра накопления "ДетализацияПартийТоваровДляНДСиУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДетализацияПартийТоваровДляНДСиУСН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДетализацияПартийТоваровДляНДСиУСН2_4" 

	Дано Я открываю основную форму списка регистра накопления "ДетализацияПартийТоваровДляНДСиУСН2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДетализацияПартийТоваровДляНДСиУСН2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДетализацияПартийТоваровДляНДСиУСН2_4"

	Дано Я открываю основную форму регистра накопления "ДетализацияПартийТоваровДляНДСиУСН2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДетализацияПартийТоваровДляНДСиУСН2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДниЧасыОтгулов" 

	Дано Я открываю основную форму списка регистра накопления "ДниЧасыОтгулов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДниЧасыОтгулов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДниЧасыОтгулов"

	Дано Я открываю основную форму регистра накопления "ДниЧасыОтгулов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДниЧасыОтгулов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнениеРасчетнойБазыУдержаний" 

	Дано Я открываю основную форму списка регистра накопления "ДополнениеРасчетнойБазыУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДополнениеРасчетнойБазыУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнениеРасчетнойБазыУдержаний"

	Дано Я открываю основную форму регистра накопления "ДополнениеРасчетнойБазыУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДополнениеРасчетнойБазыУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступностьВидовРабочихЦентров" 

	Дано Я открываю основную форму списка регистра накопления "ДоступностьВидовРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДоступностьВидовРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступностьВидовРабочихЦентров"

	Дано Я открываю основную форму регистра накопления "ДоступностьВидовРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДоступностьВидовРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗадолженностьПоУдержаниямФизическихЛиц" 

	Дано Я открываю основную форму списка регистра накопления "ЗадолженностьПоУдержаниямФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗадолженностьПоУдержаниямФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗадолженностьПоУдержаниямФизическихЛиц"

	Дано Я открываю основную форму регистра накопления "ЗадолженностьПоУдержаниямФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗадолженностьПоУдержаниямФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыКлиентов" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыКлиентов"

	Дано Я открываю основную форму регистра накопления "ЗаказыКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыМатериаловВПроизводство" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыМатериаловВПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыМатериаловВПроизводство"

	Дано Я открываю основную форму регистра накопления "ЗаказыМатериаловВПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыМатериаловВПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыМатериаловСУчетомКорректировок" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыМатериаловСУчетомКорректировок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыМатериаловСУчетомКорректировок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыМатериаловСУчетомКорректировок"

	Дано Я открываю основную форму регистра накопления "ЗаказыМатериаловСУчетомКорректировок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыМатериаловСУчетомКорректировок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыНаВнутреннееПотребление" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаВнутреннееПотребление"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыНаВнутреннееПотребление"

	Дано Я открываю основную форму регистра накопления "ЗаказыНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаВнутреннееПотребление"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыНаПеремещение" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаПеремещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыНаПеремещение"

	Дано Я открываю основную форму регистра накопления "ЗаказыНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаПеремещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыНаПроизводствоСпецификации" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыНаПроизводствоСпецификации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаПроизводствоСпецификации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыНаПроизводствоСпецификации"

	Дано Я открываю основную форму регистра накопления "ЗаказыНаПроизводствоСпецификации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаПроизводствоСпецификации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыНаПроизводствоТрудозатраты" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыНаПроизводствоТрудозатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаПроизводствоТрудозатраты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыНаПроизводствоТрудозатраты"

	Дано Я открываю основную форму регистра накопления "ЗаказыНаПроизводствоТрудозатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаПроизводствоТрудозатраты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыНаСборку" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаСборку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыНаСборку"

	Дано Я открываю основную форму регистра накопления "ЗаказыНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаСборку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыПоставщикам" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыПоставщикам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыПоставщикам"

	Дано Я открываю основную форму регистра накопления "ЗаказыПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыПоставщикам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Закупки" 

	Дано Я открываю основную форму списка регистра накопления "Закупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Закупки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Закупки"

	Дано Я открываю основную форму регистра накопления "Закупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Закупки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗарплатаКВыплате" 

	Дано Я открываю основную форму списка регистра накопления "ЗарплатаКВыплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗарплатаКВыплате"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗарплатаКВыплате"

	Дано Я открываю основную форму регистра накопления "ЗарплатаКВыплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗарплатаКВыплате"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗарплатаКВыплатеАвансом" 

	Дано Я открываю основную форму списка регистра накопления "ЗарплатаКВыплатеАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗарплатаКВыплатеАвансом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗарплатаКВыплатеАвансом"

	Дано Я открываю основную форму регистра накопления "ЗарплатаКВыплатеАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗарплатаКВыплатеАвансом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкиНаВозвратТоваровОтКлиентов" 

	Дано Я открываю основную форму списка регистра накопления "ЗаявкиНаВозвратТоваровОтКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаявкиНаВозвратТоваровОтКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкиНаВозвратТоваровОтКлиентов"

	Дано Я открываю основную форму регистра накопления "ЗаявкиНаВозвратТоваровОтКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаявкиНаВозвратТоваровОтКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"

	Дано Я открываю основную форму регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"

	Дано Я открываю основную форму регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИмущественныеВычетыНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "ИмущественныеВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ИмущественныеВычетыНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИмущественныеВычетыНДФЛ"

	Дано Я открываю основную форму регистра накопления "ИмущественныеВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ИмущественныеВычетыНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсчисленныеСтраховыеВзносы" 

	Дано Я открываю основную форму списка регистра накопления "ИсчисленныеСтраховыеВзносы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ИсчисленныеСтраховыеВзносы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсчисленныеСтраховыеВзносы"

	Дано Я открываю основную форму регистра накопления "ИсчисленныеСтраховыеВзносы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ИсчисленныеСтраховыеВзносы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КнигаУчетаДоходовИРасходов" 

	Дано Я открываю основную форму списка регистра накопления "КнигаУчетаДоходовИРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления КнигаУчетаДоходовИРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КнигаУчетаДоходовИРасходов"

	Дано Я открываю основную форму регистра накопления "КнигаУчетаДоходовИРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления КнигаУчетаДоходовИРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КнигаУчетаДоходовИРасходовРаздел2" 

	Дано Я открываю основную форму списка регистра накопления "КнигаУчетаДоходовИРасходовРаздел2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления КнигаУчетаДоходовИРасходовРаздел2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КнигаУчетаДоходовИРасходовРаздел2"

	Дано Я открываю основную форму регистра накопления "КнигаУчетаДоходовИРасходовРаздел2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления КнигаУчетаДоходовИРасходовРаздел2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтролируемыеСделкиОрганизаций" 

	Дано Я открываю основную форму списка регистра накопления "КонтролируемыеСделкиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления КонтролируемыеСделкиОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтролируемыеСделкиОрганизаций"

	Дано Я открываю основную форму регистра накопления "КонтролируемыеСделкиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления КонтролируемыеСделкиОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкиПлановыхПотребностей" 

	Дано Я открываю основную форму списка регистра накопления "КорректировкиПлановыхПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления КорректировкиПлановыхПотребностей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкиПлановыхПотребностей"

	Дано Я открываю основную форму регистра накопления "КорректировкиПлановыхПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления КорректировкиПлановыхПотребностей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛимитыРасходаДенежныхСредств" 

	Дано Я открываю основную форму списка регистра накопления "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛимитыРасходаДенежныхСредств"

	Дано Я открываю основную форму регистра накопления "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МатериалыИРаботыВПроизводстве" 

	Дано Я открываю основную форму списка регистра накопления "МатериалыИРаботыВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления МатериалыИРаботыВПроизводстве"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МатериалыИРаботыВПроизводстве"

	Дано Я открываю основную форму регистра накопления "МатериалыИРаботыВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления МатериалыИРаботыВПроизводстве"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияПоДоговорамГПХ" 

	Дано Я открываю основную форму списка регистра накопления "НачисленияПоДоговорамГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияПоДоговорамГПХ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияПоДоговорамГПХ"

	Дано Я открываю основную форму регистра накопления "НачисленияПоДоговорамГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияПоДоговорамГПХ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияУдержанияПоКонтрагентамАкционерам" 

	Дано Я открываю основную форму списка регистра накопления "НачисленияУдержанияПоКонтрагентамАкционерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоКонтрагентамАкционерам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияУдержанияПоКонтрагентамАкционерам"

	Дано Я открываю основную форму регистра накопления "НачисленияУдержанияПоКонтрагентамАкционерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоКонтрагентамАкционерам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияУдержанияПоСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "НачисленияУдержанияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияУдержанияПоСотрудникам"

	Дано Я открываю основную форму регистра накопления "НачисленияУдержанияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияУдержанияПоСотрудникамАвансом" 

	Дано Я открываю основную форму списка регистра накопления "НачисленияУдержанияПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоСотрудникамАвансом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияУдержанияПоСотрудникамАвансом"

	Дано Я открываю основную форму регистра накопления "НачисленияУдержанияПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоСотрудникамАвансом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДСАвансыВыданные" 

	Дано Я открываю основную форму списка регистра накопления "НДСАвансыВыданные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСАвансыВыданные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДСАвансыВыданные"

	Дано Я открываю основную форму регистра накопления "НДСАвансыВыданные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСАвансыВыданные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДСАвансыПолученные" 

	Дано Я открываю основную форму списка регистра накопления "НДСАвансыПолученные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСАвансыПолученные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДСАвансыПолученные"

	Дано Я открываю основную форму регистра накопления "НДСАвансыПолученные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСАвансыПолученные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДСЗаписиКнигиПокупок" 

	Дано Я открываю основную форму списка регистра накопления "НДСЗаписиКнигиПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиКнигиПокупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДСЗаписиКнигиПокупок"

	Дано Я открываю основную форму регистра накопления "НДСЗаписиКнигиПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиКнигиПокупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДСЗаписиКнигиПродаж" 

	Дано Я открываю основную форму списка регистра накопления "НДСЗаписиКнигиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиКнигиПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДСЗаписиКнигиПродаж"

	Дано Я открываю основную форму регистра накопления "НДСЗаписиКнигиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиКнигиПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДСЗаписиРаздела7Декларации" 

	Дано Я открываю основную форму списка регистра накопления "НДСЗаписиРаздела7Декларации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиРаздела7Декларации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДСЗаписиРаздела7Декларации"

	Дано Я открываю основную форму регистра накопления "НДСЗаписиРаздела7Декларации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиРаздела7Декларации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДСПредъявленный" 

	Дано Я открываю основную форму списка регистра накопления "НДСПредъявленный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСПредъявленный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДСПредъявленный"

	Дано Я открываю основную форму регистра накопления "НДСПредъявленный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСПредъявленный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛКПеречислению" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛКПеречислению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛКПеречислению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛКПеречислению"

	Дано Я открываю основную форму регистра накопления "НДФЛКПеречислению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛКПеречислению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛПеречисленный" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛПеречисленный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛПеречисленный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛПеречисленный"

	Дано Я открываю основную форму регистра накопления "НДФЛПеречисленный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛПеречисленный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбеспечениеПроизводственныхПроцессов" 

	Дано Я открываю основную форму списка регистра накопления "ОбеспечениеПроизводственныхПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОбеспечениеПроизводственныхПроцессов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбеспечениеПроизводственныхПроцессов"

	Дано Я открываю основную форму регистра накопления "ОбеспечениеПроизводственныхПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОбеспечениеПроизводственныхПроцессов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбесценениеВНА" 

	Дано Я открываю основную форму списка регистра накопления "ОбесценениеВНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОбесценениеВНА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбесценениеВНА"

	Дано Я открываю основную форму регистра накопления "ОбесценениеВНА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОбесценениеВНА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОборотыБюджетов" 

	Дано Я открываю основную форму списка регистра накопления "ОборотыБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОборотыБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОборотыБюджетов"

	Дано Я открываю основную форму регистра накопления "ОборотыБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОборотыБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОстаткиАлкогольнойПродукцииЕГАИС" 

	Дано Я открываю основную форму списка регистра накопления "ОстаткиАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОстаткиАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОстаткиАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму регистра накопления "ОстаткиАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОстаткиАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтработанноеВремяПоСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "ОтработанноеВремяПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтработанноеВремяПоСотрудникам"

	Дано Я открываю основную форму регистра накопления "ОтработанноеВремяПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтработанноеВремяПоСотрудникамАвансом" 

	Дано Я открываю основную форму списка регистра накопления "ОтработанноеВремяПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникамАвансом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтработанноеВремяПоСотрудникамАвансом"

	Дано Я открываю основную форму регистра накопления "ОтработанноеВремяПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникамАвансом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтработанноеВремяПоСотрудникамКорректировка" 

	Дано Я открываю основную форму списка регистра накопления "ОтработанноеВремяПоСотрудникамКорректировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникамКорректировка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтработанноеВремяПоСотрудникамКорректировка"

	Дано Я открываю основную форму регистра накопления "ОтработанноеВремяПоСотрудникамКорректировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникамКорректировка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеЗарплатыВФинансовомУчете" 

	Дано Я открываю основную форму списка регистра накопления "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеЗарплатыВФинансовомУчете"

	Дано Я открываю основную форму регистра накопления "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОценочныеОбязательства" 

	Дано Я открываю основную форму списка регистра накопления "ОценочныеОбязательства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОценочныеОбязательства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОценочныеОбязательства"

	Дано Я открываю основную форму регистра накопления "ОценочныеОбязательства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОценочныеОбязательства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОценочныеОбязательстваПоСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "ОценочныеОбязательстваПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОценочныеОбязательстваПоСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОценочныеОбязательстваПоСотрудникам"

	Дано Я открываю основную форму регистра накопления "ОценочныеОбязательстваПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОценочныеОбязательстваПоСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииЗатратНаВыпуск" 

	Дано Я открываю основную форму списка регистра накопления "ПартииЗатратНаВыпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииЗатратНаВыпуск"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииЗатратНаВыпуск"

	Дано Я открываю основную форму регистра накопления "ПартииЗатратНаВыпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииЗатратНаВыпуск"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииНДСКРаспределению" 

	Дано Я открываю основную форму списка регистра накопления "ПартииНДСКРаспределению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииНДСКРаспределению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииНДСКРаспределению"

	Дано Я открываю основную форму регистра накопления "ПартииНДСКРаспределению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииНДСКРаспределению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииНезавершенногоПроизводства" 

	Дано Я открываю основную форму списка регистра накопления "ПартииНезавершенногоПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииНезавершенногоПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииНезавершенногоПроизводства"

	Дано Я открываю основную форму регистра накопления "ПартииНезавершенногоПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииНезавершенногоПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииПроизводственныхЗатрат" 

	Дано Я открываю основную форму списка регистра накопления "ПартииПроизводственныхЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииПроизводственныхЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииПроизводственныхЗатрат"

	Дано Я открываю основную форму регистра накопления "ПартииПроизводственныхЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииПроизводственныхЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииПрочихРасходов" 

	Дано Я открываю основную форму списка регистра накопления "ПартииПрочихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииПрочихРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииПрочихРасходов"

	Дано Я открываю основную форму регистра накопления "ПартииПрочихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииПрочихРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииРасходовНаСебестоимостьТоваров" 

	Дано Я открываю основную форму списка регистра накопления "ПартииРасходовНаСебестоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииРасходовНаСебестоимостьТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииРасходовНаСебестоимостьТоваров"

	Дано Я открываю основную форму регистра накопления "ПартииРасходовНаСебестоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииРасходовНаСебестоимостьТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииТоваровОрганизаций" 

	Дано Я открываю основную форму списка регистра накопления "ПартииТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииТоваровОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииТоваровОрганизаций"

	Дано Я открываю основную форму регистра накопления "ПартииТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииТоваровОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииТоваровПереданныеНаКомиссию" 

	Дано Я открываю основную форму списка регистра накопления "ПартииТоваровПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииТоваровПереданныеНаКомиссию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииТоваровПереданныеНаКомиссию"

	Дано Я открываю основную форму регистра накопления "ПартииТоваровПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииТоваровПереданныеНаКомиссию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереданнаяВозвратнаяТара" 

	Дано Я открываю основную форму списка регистра накопления "ПереданнаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПереданнаяВозвратнаяТара"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереданнаяВозвратнаяТара"

	Дано Я открываю основную форму регистра накопления "ПереданнаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПереданнаяВозвратнаяТара"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереработкаПоГрафикуПроизводства" 

	Дано Я открываю основную форму списка регистра накопления "ПереработкаПоГрафикуПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПереработкаПоГрафикуПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереработкаПоГрафикуПроизводства"

	Дано Я открываю основную форму регистра накопления "ПереработкаПоГрафикуПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПереработкаПоГрафикуПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыУходаЗаБольнымиРодственниками" 

	Дано Я открываю основную форму списка регистра накопления "ПериодыУходаЗаБольнымиРодственниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПериодыУходаЗаБольнымиРодственниками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыУходаЗаБольнымиРодственниками"

	Дано Я открываю основную форму регистра накопления "ПериодыУходаЗаБольнымиРодственниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПериодыУходаЗаБольнымиРодственниками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеМатериальныеЗатраты" 

	Дано Я открываю основную форму списка регистра накопления "ПлановыеМатериальныеЗатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПлановыеМатериальныеЗатраты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеМатериальныеЗатраты"

	Дано Я открываю основную форму регистра накопления "ПлановыеМатериальныеЗатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПлановыеМатериальныеЗатраты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеПрочиеЗатраты" 

	Дано Я открываю основную форму списка регистра накопления "ПлановыеПрочиеЗатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПлановыеПрочиеЗатраты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеПрочиеЗатраты"

	Дано Я открываю основную форму регистра накопления "ПлановыеПрочиеЗатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПлановыеПрочиеЗатраты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеТрудозатраты" 

	Дано Я открываю основную форму списка регистра накопления "ПлановыеТрудозатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПлановыеТрудозатраты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеТрудозатраты"

	Дано Я открываю основную форму регистра накопления "ПлановыеТрудозатраты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПлановыеТрудозатраты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыВнутреннихПотреблений" 

	Дано Я открываю основную форму списка регистра накопления "ПланыВнутреннихПотреблений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыВнутреннихПотреблений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыВнутреннихПотреблений"

	Дано Я открываю основную форму регистра накопления "ПланыВнутреннихПотреблений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыВнутреннихПотреблений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыВыпускаИзделий" 

	Дано Я открываю основную форму списка регистра накопления "ПланыВыпускаИзделий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыВыпускаИзделий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыВыпускаИзделий"

	Дано Я открываю основную форму регистра накопления "ПланыВыпускаИзделий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыВыпускаИзделий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыЗакупок" 

	Дано Я открываю основную форму списка регистра накопления "ПланыЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыЗакупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыЗакупок"

	Дано Я открываю основную форму регистра накопления "ПланыЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыЗакупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыЗанятостиВидовРабочихЦентров" 

	Дано Я открываю основную форму списка регистра накопления "ПланыЗанятостиВидовРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыЗанятостиВидовРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыЗанятостиВидовРабочихЦентров"

	Дано Я открываю основную форму регистра накопления "ПланыЗанятостиВидовРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыЗанятостиВидовРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыЗанятостиТрудовыхРесурсов" 

	Дано Я открываю основную форму списка регистра накопления "ПланыЗанятостиТрудовыхРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыЗанятостиТрудовыхРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыЗанятостиТрудовыхРесурсов"

	Дано Я открываю основную форму регистра накопления "ПланыЗанятостиТрудовыхРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыЗанятостиТрудовыхРесурсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыОплатКлиентов" 

	Дано Я открываю основную форму списка регистра накопления "ПланыОплатКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОплатКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыОплатКлиентов"

	Дано Я открываю основную форму регистра накопления "ПланыОплатКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОплатКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыОплатПоставщикам" 

	Дано Я открываю основную форму списка регистра накопления "ПланыОплатПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОплатПоставщикам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыОплатПоставщикам"

	Дано Я открываю основную форму регистра накопления "ПланыОплатПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОплатПоставщикам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыОстатков" 

	Дано Я открываю основную форму списка регистра накопления "ПланыОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыОстатков"

	Дано Я открываю основную форму регистра накопления "ПланыОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыПотребленияКомплектующих" 

	Дано Я открываю основную форму списка регистра накопления "ПланыПотребленияКомплектующих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПотребленияКомплектующих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыПотребленияКомплектующих"

	Дано Я открываю основную форму регистра накопления "ПланыПотребленияКомплектующих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПотребленияКомплектующих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыПотребленияМатериалов" 

	Дано Я открываю основную форму списка регистра накопления "ПланыПотребленияМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПотребленияМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыПотребленияМатериалов"

	Дано Я открываю основную форму регистра накопления "ПланыПотребленияМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПотребленияМатериалов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыПродаж" 

	Дано Я открываю основную форму списка регистра накопления "ПланыПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыПродаж"

	Дано Я открываю основную форму регистра накопления "ПланыПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыПродажПоКатегориям" 

	Дано Я открываю основную форму списка регистра накопления "ПланыПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПродажПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыПродажПоКатегориям"

	Дано Я открываю основную форму регистра накопления "ПланыПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПродажПоКатегориям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыПроизводства" 

	Дано Я открываю основную форму списка регистра накопления "ПланыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыПроизводства"

	Дано Я открываю основную форму регистра накопления "ПланыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыСборкиРазборки" 

	Дано Я открываю основную форму списка регистра накопления "ПланыСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыСборкиРазборки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыСборкиРазборки"

	Дано Я открываю основную форму регистра накопления "ПланыСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыСборкиРазборки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодарочныеСертификаты" 

	Дано Я открываю основную форму списка регистра накопления "ПодарочныеСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПодарочныеСертификаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодарочныеСертификаты"

	Дано Я открываю основную форму регистра накопления "ПодарочныеСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПодарочныеСертификаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПособияПоСоциальномуСтрахованию" 

	Дано Я открываю основную форму списка регистра накопления "ПособияПоСоциальномуСтрахованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПособияПоСоциальномуСтрахованию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПособияПоСоциальномуСтрахованию"

	Дано Я открываю основную форму регистра накопления "ПособияПоСоциальномуСтрахованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПособияПоСоциальномуСтрахованию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПособияПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка регистра накопления "ПособияПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПособияПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПособияПоУходуЗаРебенком"

	Дано Я открываю основную форму регистра накопления "ПособияПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПособияПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПотребностьВМатериалахВПроизводстве" 

	Дано Я открываю основную форму списка регистра накопления "ПотребностьВМатериалахВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПотребностьВМатериалахВПроизводстве"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПотребностьВМатериалахВПроизводстве"

	Дано Я открываю основную форму регистра накопления "ПотребностьВМатериалахВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПотребностьВМатериалахВПроизводстве"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"

	Дано Я открываю основную форму регистра накопления "ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятаяВозвратнаяТара" 

	Дано Я открываю основную форму списка регистра накопления "ПринятаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПринятаяВозвратнаяТара"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятаяВозвратнаяТара"

	Дано Я открываю основную форму регистра накопления "ПринятаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПринятаяВозвратнаяТара"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрослеживаемыеТоварыВСоставеОС" 

	Дано Я открываю основную форму списка регистра накопления "ПрослеживаемыеТоварыВСоставеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрослеживаемыеТоварыВСоставеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрослеживаемыеТоварыВСоставеОС"

	Дано Я открываю основную форму регистра накопления "ПрослеживаемыеТоварыВСоставеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрослеживаемыеТоварыВСоставеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрослеживаемыеТоварыОтгруженныеВЕАЭС" 

	Дано Я открываю основную форму списка регистра накопления "ПрослеживаемыеТоварыОтгруженныеВЕАЭС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрослеживаемыеТоварыОтгруженныеВЕАЭС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрослеживаемыеТоварыОтгруженныеВЕАЭС"

	Дано Я открываю основную форму регистра накопления "ПрослеживаемыеТоварыОтгруженныеВЕАЭС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрослеживаемыеТоварыОтгруженныеВЕАЭС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцентныеРасходыДисконтирования" 

	Дано Я открываю основную форму списка регистра накопления "ПроцентныеРасходыДисконтирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПроцентныеРасходыДисконтирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцентныеРасходыДисконтирования"

	Дано Я открываю основную форму регистра накопления "ПроцентныеРасходыДисконтирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПроцентныеРасходыДисконтирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочаяВыручка" 

	Дано Я открываю основную форму списка регистра накопления "ПрочаяВыручка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочаяВыручка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочаяВыручка"

	Дано Я открываю основную форму регистра накопления "ПрочаяВыручка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочаяВыручка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеАктивыПассивы" 

	Дано Я открываю основную форму списка регистра накопления "ПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеАктивыПассивы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеАктивыПассивы"

	Дано Я открываю основную форму регистра накопления "ПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеАктивыПассивы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеДоходы" 

	Дано Я открываю основную форму списка регистра накопления "ПрочиеДоходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеДоходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеДоходы"

	Дано Я открываю основную форму регистра накопления "ПрочиеДоходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеДоходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеРасходы" 

	Дано Я открываю основную форму списка регистра накопления "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеРасходы"

	Дано Я открываю основную форму регистра накопления "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеРасходыНезавершенногоПроизводства" 

	Дано Я открываю основную форму списка регистра накопления "ПрочиеРасходыНезавершенногоПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеРасходыНезавершенногоПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеРасходыНезавершенногоПроизводства"

	Дано Я открываю основную форму регистра накопления "ПрочиеРасходыНезавершенногоПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеРасходыНезавершенногоПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспоряженияНаВыпускПродукции" 

	Дано Я открываю основную форму списка регистра накопления "РаспоряженияНаВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РаспоряженияНаВыпускПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспоряженияНаВыпускПродукции"

	Дано Я открываю основную форму регистра накопления "РаспоряженияНаВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РаспоряженияНаВыпускПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспоряженияНаПередачуИзПроизводства" 

	Дано Я открываю основную форму списка регистра накопления "РаспоряженияНаПередачуИзПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РаспоряженияНаПередачуИзПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспоряженияНаПередачуИзПроизводства"

	Дано Я открываю основную форму регистра накопления "РаспоряженияНаПередачуИзПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РаспоряженияНаПередачуИзПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспоряженияНаСписаниеПоНормативам" 

	Дано Я открываю основную форму списка регистра накопления "РаспоряженияНаСписаниеПоНормативам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РаспоряженияНаСписаниеПоНормативам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспоряженияНаСписаниеПоНормативам"

	Дано Я открываю основную форму регистра накопления "РаспоряженияНаСписаниеПоНормативам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РаспоряженияНаСписаниеПоНормативам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеЗапасовДвижения" 

	Дано Я открываю основную форму списка регистра накопления "РаспределениеЗапасовДвижения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РаспределениеЗапасовДвижения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеЗапасовДвижения"

	Дано Я открываю основную форму регистра накопления "РаспределениеЗапасовДвижения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РаспределениеЗапасовДвижения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходыПриУСН" 

	Дано Я открываю основную форму списка регистра накопления "РасходыПриУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасходыПриУСН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходыПриУСН"

	Дано Я открываю основную форму регистра накопления "РасходыПриУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасходыПриУСН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходыПриУСНМатериалы" 

	Дано Я открываю основную форму списка регистра накопления "РасходыПриУСНМатериалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасходыПриУСНМатериалы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходыПриУСНМатериалы"

	Дано Я открываю основную форму регистра накопления "РасходыПриУСНМатериалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасходыПриУСНМатериалы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходыПриУСНОСиНМА" 

	Дано Я открываю основную форму списка регистра накопления "РасходыПриУСНОСиНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасходыПриУСНОСиНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходыПриУСНОСиНМА"

	Дано Я открываю основную форму регистра накопления "РасходыПриУСНОСиНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасходыПриУСНОСиНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходыПриУСНТовары" 

	Дано Я открываю основную форму списка регистра накопления "РасходыПриУСНТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасходыПриУСНТовары"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходыПриУСНТовары"

	Дано Я открываю основную форму регистра накопления "РасходыПриУСНТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасходыПриУСНТовары"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыНалогоплательщиковСБюджетомПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыНалогоплательщиковСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыНалогоплательщиковСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыНалогоплательщиковСБюджетомПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "РасчетыНалогоплательщиковСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыНалогоплательщиковСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыПоФинансовымИнструментам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыПоФинансовымИнструментам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыПоФинансовымИнструментам"

	Дано Я открываю основную форму регистра накопления "РасчетыПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыПоФинансовымИнструментам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыПоЭквайрингу" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыПоЭквайрингу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыПоЭквайрингу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыПоЭквайрингу"

	Дано Я открываю основную форму регистра накопления "РасчетыПоЭквайрингу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыПоЭквайрингу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентами" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентами"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентамиПланОплат" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентамиПланОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПланОплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентамиПланОплат"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентамиПланОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПланОплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентамиПланОтгрузок" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентамиПланОтгрузок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПланОтгрузок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентамиПланОтгрузок"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентамиПланОтгрузок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПланОтгрузок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентамиПоДокументам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентамиПоДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПоДокументам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентамиПоДокументам"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентамиПоДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПоДокументам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентамиПоСрокам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентамиПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПоСрокам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентамиПоСрокам"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентамиПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПоСрокам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщиками" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщиками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщиками"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщиками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщикамиПланОплат" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщикамиПланОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПланОплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщикамиПланОплат"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщикамиПланОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПланОплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщикамиПланПоставок" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщикамиПланПоставок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПланПоставок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщикамиПланПоставок"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщикамиПланПоставок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПланПоставок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщикамиПоДокументам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщикамиПоДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПоДокументам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщикамиПоДокументам"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщикамиПоДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПоДокументам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщикамиПоСрокам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщикамиПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПоСрокам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщикамиПоСрокам"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщикамиПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПоСрокам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСФондамиПоСтраховымВзносам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСФондамиПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСФондамиПоСтраховымВзносам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСФондамиПоСтраховымВзносам"

	Дано Я открываю основную форму регистра накопления "РасчетыСФондамиПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСФондамиПоСтраховымВзносам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезервыПоСомнительнымДолгам" 

	Дано Я открываю основную форму списка регистра накопления "РезервыПоСомнительнымДолгам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РезервыПоСомнительнымДолгам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезервыПоСомнительнымДолгам"

	Дано Я открываю основную форму регистра накопления "РезервыПоСомнительнымДолгам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РезервыПоСомнительнымДолгам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезервыПредстоящихРасходов" 

	Дано Я открываю основную форму списка регистра накопления "РезервыПредстоящихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РезервыПредстоящихРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезервыПредстоящихРасходов"

	Дано Я открываю основную форму регистра накопления "РезервыПредстоящихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РезервыПредстоящихРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезервыТоваровОрганизаций" 

	Дано Я открываю основную форму списка регистра накопления "РезервыТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РезервыТоваровОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезервыТоваровОрганизаций"

	Дано Я открываю основную форму регистра накопления "РезервыТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РезервыТоваровОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОДоходахНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "СведенияОДоходахНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СведенияОДоходахНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОДоходахНДФЛ"

	Дано Я открываю основную форму регистра накопления "СведенияОДоходахНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СведенияОДоходахНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОДоходахСтраховыеВзносы" 

	Дано Я открываю основную форму списка регистра накопления "СведенияОДоходахСтраховыеВзносы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СведенияОДоходахСтраховыеВзносы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОДоходахСтраховыеВзносы"

	Дано Я открываю основную форму регистра накопления "СведенияОДоходахСтраховыеВзносы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СведенияОДоходахСтраховыеВзносы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СебестоимостьТоваров" 

	Дано Я открываю основную форму списка регистра накопления "СебестоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СебестоимостьТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СебестоимостьТоваров"

	Дано Я открываю основную форму регистра накопления "СебестоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СебестоимостьТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияРабочихЦентров" 

	Дано Я открываю основную форму списка регистра накопления "СостоянияРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СостоянияРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияРабочихЦентров"

	Дано Я открываю основную форму регистра накопления "СостоянияРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СостоянияРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтоимостьНМА" 

	Дано Я открываю основную форму списка регистра накопления "СтоимостьНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтоимостьНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтоимостьНМА"

	Дано Я открываю основную форму регистра накопления "СтоимостьНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтоимостьНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтоимостьОС" 

	Дано Я открываю основную форму списка регистра накопления "СтоимостьОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтоимостьОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтоимостьОС"

	Дано Я открываю основную форму регистра накопления "СтоимостьОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтоимостьОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраховыеВзносыПереданныеВПФР" 

	Дано Я открываю основную форму списка регистра накопления "СтраховыеВзносыПереданныеВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтраховыеВзносыПереданныеВПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраховыеВзносыПереданныеВПФР"

	Дано Я открываю основную форму регистра накопления "СтраховыеВзносыПереданныеВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтраховыеВзносыПереданныеВПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраховыеВзносыПоФизическимЛицам" 

	Дано Я открываю основную форму списка регистра накопления "СтраховыеВзносыПоФизическимЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтраховыеВзносыПоФизическимЛицам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраховыеВзносыПоФизическимЛицам"

	Дано Я открываю основную форму регистра накопления "СтраховыеВзносыПоФизическимЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтраховыеВзносыПоФизическимЛицам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка регистра накопления "ТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТМЦВЭксплуатации"

	Дано Я открываю основную форму регистра накопления "ТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварныеМестаКОтражениюИзлишковНедостач" 

	Дано Я открываю основную форму списка регистра накопления "ТоварныеМестаКОтражениюИзлишковНедостач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварныеМестаКОтражениюИзлишковНедостач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварныеМестаКОтражениюИзлишковНедостач"

	Дано Я открываю основную форму регистра накопления "ТоварныеМестаКОтражениюИзлишковНедостач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварныеМестаКОтражениюИзлишковНедостач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыВЯчейках" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыВЯчейках"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыВЯчейках"

	Дано Я открываю основную форму регистра накопления "ТоварыВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыВЯчейках"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОтбору" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОтбору"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОтбору"

	Дано Я открываю основную форму регистра накопления "ТоварыКОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОтбору"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОтгрузке" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОтгрузке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОтгрузке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОтгрузке"

	Дано Я открываю основную форму регистра накопления "ТоварыКОтгрузке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОтгрузке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОформлениюДокументовИмпорта" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОформлениюДокументовИмпорта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюДокументовИмпорта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОформлениюДокументовИмпорта"

	Дано Я открываю основную форму регистра накопления "ТоварыКОформлениюДокументовИмпорта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюДокументовИмпорта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОформлениюЗаявленийОВвозе" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОформлениюЗаявленийОВвозе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюЗаявленийОВвозе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОформлениюЗаявленийОВвозе"

	Дано Я открываю основную форму регистра накопления "ТоварыКОформлениюЗаявленийОВвозе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюЗаявленийОВвозе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОформлениюИзлишковНедостач" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОформлениюИзлишковНедостач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюИзлишковНедостач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОформлениюИзлишковНедостач"

	Дано Я открываю основную форму регистра накопления "ТоварыКОформлениюИзлишковНедостач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюИзлишковНедостач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОформлениюОтчетовКомитенту" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОформлениюОтчетовКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюОтчетовКомитенту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОформлениюОтчетовКомитенту"

	Дано Я открываю основную форму регистра накопления "ТоварыКОформлениюОтчетовКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюОтчетовКомитенту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКПоступлению" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКПоступлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКПоступлению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКПоступлению"

	Дано Я открываю основную форму регистра накопления "ТоварыКПоступлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКПоступлению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыНаСкладах" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыНаСкладах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыНаСкладах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыНаСкладах"

	Дано Я открываю основную форму регистра накопления "ТоварыНаСкладах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыНаСкладах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыОрганизаций" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыОрганизаций"

	Дано Я открываю основную форму регистра накопления "ТоварыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыОрганизацийКПередаче" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыОрганизацийКПередаче"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыОрганизацийКПередаче"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыОрганизацийКПередаче"

	Дано Я открываю основную форму регистра накопления "ТоварыОрганизацийКПередаче"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыОрганизацийКПередаче"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыПереданныеНаКомиссию" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыПереданныеНаКомиссию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыПереданныеНаКомиссию"

	Дано Я открываю основную форму регистра накопления "ТоварыПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыПереданныеНаКомиссию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыПереданныеПереработчику" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыПереданныеПереработчику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыПереданныеПереработчику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыПереданныеПереработчику"

	Дано Я открываю основную форму регистра накопления "ТоварыПереданныеПереработчику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыПереданныеПереработчику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыПолученныеОтПереработчика" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыПолученныеОтПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыПолученныеОтПереработчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыПолученныеОтПереработчика"

	Дано Я открываю основную форму регистра накопления "ТоварыПолученныеОтПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыПолученныеОтПереработчика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках"

	Дано Я открываю основную форму регистра накопления "ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТрудозатратыКОформлению" 

	Дано Я открываю основную форму списка регистра накопления "ТрудозатратыКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТрудозатратыКОформлению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТрудозатратыКОформлению"

	Дано Я открываю основную форму регистра накопления "ТрудозатратыКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТрудозатратыКОформлению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТрудозатратыНезавершенногоПроизводства" 

	Дано Я открываю основную форму списка регистра накопления "ТрудозатратыНезавершенногоПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТрудозатратыНезавершенногоПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТрудозатратыНезавершенногоПроизводства"

	Дано Я открываю основную форму регистра накопления "ТрудозатратыНезавершенногоПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТрудозатратыНезавершенногоПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВыполненныеРаботыСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "УдалитьВыполненныеРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдалитьВыполненныеРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВыполненныеРаботыСотрудников"

	Дано Я открываю основную форму регистра накопления "УдалитьВыполненныеРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдалитьВыполненныеРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗанятыеПозицииШтатногоРасписания" 

	Дано Я открываю основную форму списка регистра накопления "УдалитьЗанятыеПозицииШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдалитьЗанятыеПозицииШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗанятыеПозицииШтатногоРасписания"

	Дано Я открываю основную форму регистра накопления "УдалитьЗанятыеПозицииШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдалитьЗанятыеПозицииШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка регистра накопления "УдалитьТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдалитьТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьТМЦВЭксплуатации"

	Дано Я открываю основную форму регистра накопления "УдалитьТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдалитьТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержанияДоПределаПоСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "УдержанияДоПределаПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдержанияДоПределаПоСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержанияДоПределаПоСотрудникам"

	Дано Я открываю основную форму регистра накопления "УдержанияДоПределаПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдержанияДоПределаПоСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержанияПоИсполнительнымДокументам" 

	Дано Я открываю основную форму списка регистра накопления "УдержанияПоИсполнительнымДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдержанияПоИсполнительнымДокументам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержанияПоИсполнительнымДокументам"

	Дано Я открываю основную форму регистра накопления "УдержанияПоИсполнительнымДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдержанияПоИсполнительнымДокументам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УплатаНДФЛНалоговымиАгентамиКРаспределению" 

	Дано Я открываю основную форму списка регистра накопления "УплатаНДФЛНалоговымиАгентамиКРаспределению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УплатаНДФЛНалоговымиАгентамиКРаспределению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УплатаНДФЛНалоговымиАгентамиКРаспределению"

	Дано Я открываю основную форму регистра накопления "УплатаНДФЛНалоговымиАгентамиКРаспределению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УплатаНДФЛНалоговымиАгентамиКРаспределению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УслугиДавальцуКОформлению" 

	Дано Я открываю основную форму списка регистра накопления "УслугиДавальцуКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УслугиДавальцуКОформлению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УслугиДавальцуКОформлению"

	Дано Я открываю основную форму регистра накопления "УслугиДавальцуКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УслугиДавальцуКОформлению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УслугиКОформлениюОтчетовПринципалу" 

	Дано Я открываю основную форму списка регистра накопления "УслугиКОформлениюОтчетовПринципалу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УслугиКОформлениюОтчетовПринципалу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УслугиКОформлениюОтчетовПринципалу"

	Дано Я открываю основную форму регистра накопления "УслугиКОформлениюОтчетовПринципалу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УслугиКОформлениюОтчетовПринципалу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УслугиПереработчиковКОформлению" 

	Дано Я открываю основную форму списка регистра накопления "УслугиПереработчиковКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УслугиПереработчиковКОформлению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УслугиПереработчиковКОформлению"

	Дано Я открываю основную форму регистра накопления "УслугиПереработчиковКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УслугиПереработчиковКОформлению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФактическиеДанныеБюджетирования" 

	Дано Я открываю основную форму списка регистра накопления "ФактическиеДанныеБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФактическиеДанныеБюджетирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФактическиеДанныеБюджетирования"

	Дано Я открываю основную форму регистра накопления "ФактическиеДанныеБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФактическиеДанныеБюджетирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФактическиеОтпуска" 

	Дано Я открываю основную форму списка регистра накопления "ФактическиеОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФактическиеОтпуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФактическиеОтпуска"

	Дано Я открываю основную форму регистра накопления "ФактическиеОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФактическиеОтпуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФинансовыеРезультаты" 

	Дано Я открываю основную форму списка регистра накопления "ФинансовыеРезультаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФинансовыеРезультаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФинансовыеРезультаты"

	Дано Я открываю основную форму регистра накопления "ФинансовыеРезультаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФинансовыеРезультаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭтапыПроизводства" 

	Дано Я открываю основную форму списка регистра накопления "ЭтапыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЭтапыПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭтапыПроизводства"

	Дано Я открываю основную форму регистра накопления "ЭтапыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЭтапыПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Международный" 

	Дано Я открываю основную форму списка регистра бухгалтерии "Международный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра бухгалтерии Международный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Международный"

	Дано Я открываю основную форму регистра бухгалтерии "Международный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра бухгалтерии Международный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Хозрасчетный" 

	Дано Я открываю основную форму списка регистра бухгалтерии "Хозрасчетный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра бухгалтерии Хозрасчетный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Хозрасчетный"

	Дано Я открываю основную форму регистра бухгалтерии "Хозрасчетный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра бухгалтерии Хозрасчетный"
	И Я закрываю текущее окно

