#language: ru

@tree
@быстрые проврки


Функциональность: Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "АвансовыйОтчетПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АвансовыйОтчетПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АвансовыйОтчетПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйОтчетПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АвансовыйОтчетПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АвансовыйОтчетПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктВыполненныхВнутреннихРаботПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктВыполненныхВнутреннихРаботПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктВыполненныхВнутреннихРаботПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктВыполненныхВнутреннихРаботПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктВыполненныхВнутреннихРаботПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктВыполненныхВнутреннихРаботПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктВыполненныхРаботПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктВыполненныхРаботПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктВыполненныхРаботПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктВыполненныхРаботПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктВыполненныхРаботПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктВыполненныхРаботПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПроверкиСтраховыхВзносовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктПроверкиСтраховыхВзносовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктПроверкиСтраховыхВзносовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПроверкиСтраховыхВзносовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктПроверкиСтраховыхВзносовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктПроверкиСтраховыхВзносовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БанкиУниверсальногоОбмена" 

	Дано Я открываю основную форму списка справочника "БанкиУниверсальногоОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанкиУниверсальногоОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БанкиУниверсальногоОбмена"

	Дано Я открываю основную форму справочника "БанкиУниверсальногоОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанкиУниверсальногоОбмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БанковскиеКартыКонтрагентов" 

	Дано Я открываю основную форму списка справочника "БанковскиеКартыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеКартыКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БанковскиеКартыКонтрагентов"

	Дано Я открываю основную форму справочника "БанковскиеКартыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеКартыКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БанковскиеСчетаКонтрагентов" 

	Дано Я открываю основную форму списка справочника "БанковскиеСчетаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БанковскиеСчетаКонтрагентов"

	Дано Я открываю основную форму справочника "БанковскиеСчетаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БанковскиеСчетаОрганизаций" 

	Дано Я открываю основную форму списка справочника "БанковскиеСчетаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БанковскиеСчетаОрганизаций"

	Дано Я открываю основную форму справочника "БанковскиеСчетаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БизнесРегионы" 

	Дано Я открываю основную форму списка справочника "БизнесРегионы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БизнесРегионы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БизнесРегионы"

	Дано Я открываю основную форму справочника "БизнесРегионы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БизнесРегионы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БланкиСтрогойОтчетности" 

	Дано Я открываю основную форму списка справочника "БланкиСтрогойОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БланкиСтрогойОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БланкиСтрогойОтчетности"

	Дано Я открываю основную форму справочника "БланкиСтрогойОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БланкиСтрогойОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БольничныйЛистПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "БольничныйЛистПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БольничныйЛистПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БольничныйЛистПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "БольничныйЛистПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БольничныйЛистПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БонусныеПрограммыЛояльности" 

	Дано Я открываю основную форму списка справочника "БонусныеПрограммыЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БонусныеПрограммыЛояльности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БонусныеПрограммыЛояльности"

	Дано Я открываю основную форму справочника "БонусныеПрограммыЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БонусныеПрограммыЛояльности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Бригады" 

	Дано Я открываю основную форму списка справочника "Бригады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Бригады"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Бригады"

	Дано Я открываю основную форму справочника "Бригады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Бригады"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БронированиеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "БронированиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БронированиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БронированиеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "БронированиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БронированиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетНачисленийСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "БухучетНачисленийСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БухучетНачисленийСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетНачисленийСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "БухучетНачисленийСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БухучетНачисленийСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Валюты" 

	Дано Я открываю основную форму списка справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Валюты"

	Дано Я открываю основную форму справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыАнализаЦелевыхПоказателей" 

	Дано Я открываю основную форму списка справочника "ВариантыАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыАнализаЦелевыхПоказателей"

	Дано Я открываю основную форму справочника "ВариантыАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыГрафиковКредитовИДепозитов" 

	Дано Я открываю основную форму списка справочника "ВариантыГрафиковКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыГрафиковКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыГрафиковКредитовИДепозитов"

	Дано Я открываю основную форму справочника "ВариантыГрафиковКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыГрафиковКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыКлассификацииЗадолженности" 

	Дано Я открываю основную форму списка справочника "ВариантыКлассификацииЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыКлассификацииЗадолженности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыКлассификацииЗадолженности"

	Дано Я открываю основную форму справочника "ВариантыКлассификацииЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыКлассификацииЗадолженности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыКомплектацииНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ВариантыКомплектацииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыКомплектацииНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыКомплектацииНоменклатуры"

	Дано Я открываю основную форму справочника "ВариантыКомплектацииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыКомплектацииНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыНаладки" 

	Дано Я открываю основную форму списка справочника "ВариантыНаладки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыНаладки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыНаладки"

	Дано Я открываю основную форму справочника "ВариантыНаладки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыНаладки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОтветовАнкет" 

	Дано Я открываю основную форму списка справочника "ВариантыОтветовАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОтветовАнкет"

	Дано Я открываю основную форму справочника "ВариантыОтветовАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОтчетов"

	Дано Я открываю основную форму справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводНачальныхОстатковОтпусковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВводНачальныхОстатковОтпусковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВводНачальныхОстатковОтпусковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводНачальныхОстатковОтпусковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВводНачальныхОстатковОтпусковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВводНачальныхОстатковОтпусковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьУплатыАДВ_11ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВедомостьУплатыАДВ_11ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьУплатыАДВ_11ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьУплатыАДВ_11ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВедомостьУплатыАДВ_11ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВедомостьУплатыАДВ_11ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииМобильныхПриложений" 

	Дано Я открываю основную форму списка справочника "ВерсииМобильныхПриложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииМобильныхПриложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииМобильныхПриложений"

	Дано Я открываю основную форму справочника "ВерсииМобильныхПриложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииМобильныхПриложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииРасширений" 

	Дано Я открываю основную форму списка справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииРасширений"

	Дано Я открываю основную форму справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииФайлов" 

	Дано Я открываю основную форму списка справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииФайлов"

	Дано Я открываю основную форму справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВетеринарноСопроводительныйДокументВЕТИС" 

	Дано Я открываю основную форму списка справочника "ВетеринарноСопроводительныйДокументВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВетеринарноСопроводительныйДокументВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВетеринарноСопроводительныйДокументВЕТИС"

	Дано Я открываю основную форму справочника "ВетеринарноСопроводительныйДокументВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВетеринарноСопроводительныйДокументВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВЕТИСПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВЕТИСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВЕТИСПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВЕТИСПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВЕТИСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВЕТИСПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаимозачетЗадолженностиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВзаимозачетЗадолженностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВзаимозачетЗадолженностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаимозачетЗадолженностиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВзаимозачетЗадолженностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВзаимозачетЗадолженностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыАлкогольнойПродукции" 

	Дано Я открываю основную форму списка справочника "ВидыАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыАлкогольнойПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыАлкогольнойПродукции"

	Дано Я открываю основную форму справочника "ВидыАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыАлкогольнойПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыБюджетов" 

	Дано Я открываю основную форму списка справочника "ВидыБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыБюджетов"

	Дано Я открываю основную форму справочника "ВидыБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыВыплатБывшимСотрудникам" 

	Дано Я открываю основную форму списка справочника "ВидыВыплатБывшимСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыВыплатБывшимСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыВыплатБывшимСотрудникам"

	Дано Я открываю основную форму справочника "ВидыВыплатБывшимСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыВыплатБывшимСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыВычетовНДФЛ" 

	Дано Я открываю основную форму списка справочника "ВидыВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыВычетовНДФЛ"

	Дано Я открываю основную форму справочника "ВидыВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыВычетовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДефектов" 

	Дано Я открываю основную форму списка справочника "ВидыДефектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДефектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДефектов"

	Дано Я открываю основную форму справочника "ВидыДефектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДефектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДефектовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВидыДефектовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДефектовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДефектовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВидыДефектовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДефектовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДоговоровАвторскогоЗаказа" 

	Дано Я открываю основную форму списка справочника "ВидыДоговоровАвторскогоЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоговоровАвторскогоЗаказа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДоговоровАвторскогоЗаказа"

	Дано Я открываю основную форму справочника "ВидыДоговоровАвторскогоЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоговоровАвторскогоЗаказа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДокументовВводДанныхДляРасчетаЗарплаты" 

	Дано Я открываю основную форму списка справочника "ВидыДокументовВводДанныхДляРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовВводДанныхДляРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДокументовВводДанныхДляРасчетаЗарплаты"

	Дано Я открываю основную форму справочника "ВидыДокументовВводДанныхДляРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовВводДанныхДляРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДокументовОбОбразовании" 

	Дано Я открываю основную форму списка справочника "ВидыДокументовОбОбразовании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовОбОбразовании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДокументовОбОбразовании"

	Дано Я открываю основную форму справочника "ВидыДокументовОбОбразовании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовОбОбразовании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДокументовФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДокументовФизическихЛиц"

	Дано Я открываю основную форму справочника "ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДокументовЭДО" 

	Дано Я открываю основную форму списка справочника "ВидыДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДокументовЭДО"

	Дано Я открываю основную форму справочника "ВидыДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДоходовНДФЛ" 

	Дано Я открываю основную форму списка справочника "ВидыДоходовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДоходовНДФЛ"

	Дано Я открываю основную форму справочника "ВидыДоходовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДоходовПоСтраховымВзносам" 

	Дано Я открываю основную форму списка справочника "ВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДоходовПоСтраховымВзносам"

	Дано Я открываю основную форму справочника "ВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЗапасов" 

	Дано Я открываю основную форму списка справочника "ВидыЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЗапасов"

	Дано Я открываю основную форму справочника "ВидыЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыИспользованияРабочегоВремени" 

	Дано Я открываю основную форму списка справочника "ВидыИспользованияРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыИспользованияРабочегоВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыИспользованияРабочегоВремени"

	Дано Я открываю основную форму справочника "ВидыИспользованияРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыИспользованияРабочегоВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыКартЛояльности" 

	Дано Я открываю основную форму списка справочника "ВидыКартЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКартЛояльности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыКартЛояльности"

	Дано Я открываю основную форму справочника "ВидыКартЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКартЛояльности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыКонтактнойИнформации" 

	Дано Я открываю основную форму списка справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыКонтактнойИнформации"

	Дано Я открываю основную форму справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыМехаГИСМ" 

	Дано Я открываю основную форму списка справочника "ВидыМехаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыМехаГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыМехаГИСМ"

	Дано Я открываю основную форму справочника "ВидыМехаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыМехаГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНалоговВзносов" 

	Дано Я открываю основную форму списка справочника "ВидыНалоговВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалоговВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНалоговВзносов"

	Дано Я открываю основную форму справочника "ВидыНалоговВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалоговВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "ВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНалоговыхОрганов"

	Дано Я открываю основную форму справочника "ВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНачисленийУдержаний" 

	Дано Я открываю основную форму списка справочника "ВидыНачисленийУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНачисленийУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНачисленийУдержаний"

	Дано Я открываю основную форму справочника "ВидыНачисленийУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНачисленийУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ВидыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНоменклатуры"

	Дано Я открываю основную форму справочника "ВидыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНоменклатурыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВидыНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНоменклатурыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВидыНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОбразованияФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ВидыОбразованияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОбразованияФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОбразованияФизическихЛиц"

	Дано Я открываю основную форму справочника "ВидыОбразованияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОбразованияФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОбщественноПолезнойДеятельностиСЗВК" 

	Дано Я открываю основную форму списка справочника "ВидыОбщественноПолезнойДеятельностиСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОбщественноПолезнойДеятельностиСЗВК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОбщественноПолезнойДеятельностиСЗВК"

	Дано Я открываю основную форму справочника "ВидыОбщественноПолезнойДеятельностиСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОбщественноПолезнойДеятельностиСЗВК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОперацийРасчетаЗарплаты" 

	Дано Я открываю основную форму списка справочника "ВидыОперацийРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОперацийРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОперацийРасчетаЗарплаты"

	Дано Я открываю основную форму справочника "ВидыОперацийРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОперацийРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОповещенийКлиентам" 

	Дано Я открываю основную форму списка справочника "ВидыОповещенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОповещенийКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОповещенийКлиентам"

	Дано Я открываю основную форму справочника "ВидыОповещенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОповещенийКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОтправляемыхДокументов" 

	Дано Я открываю основную форму списка справочника "ВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОтправляемыхДокументов"

	Дано Я открываю основную форму справочника "ВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОтпусков" 

	Дано Я открываю основную форму списка справочника "ВидыОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОтпусков"

	Дано Я открываю основную форму справочника "ВидыОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПланов" 

	Дано Я открываю основную форму списка справочника "ВидыПланов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПланов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПланов"

	Дано Я открываю основную форму справочника "ВидыПланов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПланов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПодарочныхСертификатов" 

	Дано Я открываю основную форму списка справочника "ВидыПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПодарочныхСертификатов"

	Дано Я открываю основную форму справочника "ВидыПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПодтверждающихДокументов" 

	Дано Я открываю основную форму списка справочника "ВидыПодтверждающихДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПодтверждающихДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПодтверждающихДокументов"

	Дано Я открываю основную форму справочника "ВидыПодтверждающихДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПодтверждающихДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПрочихДоходовФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ВидыПрочихДоходовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПрочихДоходовФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПрочихДоходовФизическихЛиц"

	Дано Я открываю основную форму справочника "ВидыПрочихДоходовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПрочихДоходовФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРаботСотрудников" 

	Дано Я открываю основную форму списка справочника "ВидыРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРаботСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРаботСотрудников"

	Дано Я открываю основную форму справочника "ВидыРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРаботСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРабочихЦентров" 

	Дано Я открываю основную форму списка справочника "ВидыРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРабочихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРабочихЦентров"

	Дано Я открываю основную форму справочника "ВидыРабочихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРабочихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРасчетовССотрудниками" 

	Дано Я открываю основную форму списка справочника "ВидыРасчетовССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРасчетовССотрудниками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРасчетовССотрудниками"

	Дано Я открываю основную форму справочника "ВидыРасчетовССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРасчетовССотрудниками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРегистровУчета" 

	Дано Я открываю основную форму списка справочника "ВидыРегистровУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРегистровУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРегистровУчета"

	Дано Я открываю основную форму справочника "ВидыРегистровУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРегистровУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРемонтов" 

	Дано Я открываю основную форму списка справочника "ВидыРемонтов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРемонтов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРемонтов"

	Дано Я открываю основную форму справочника "ВидыРемонтов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРемонтов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРемонтовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВидыРемонтовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРемонтовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРемонтовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВидыРемонтовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРемонтовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСвязейМеждуПартнерами" 

	Дано Я открываю основную форму списка справочника "ВидыСвязейМеждуПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСвязейМеждуПартнерами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСвязейМеждуПартнерами"

	Дано Я открываю основную форму справочника "ВидыСвязейМеждуПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСвязейМеждуПартнерами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСвязейМеждуФизЛицами" 

	Дано Я открываю основную форму списка справочника "ВидыСвязейМеждуФизЛицами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСвязейМеждуФизЛицами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСвязейМеждуФизЛицами"

	Дано Я открываю основную форму справочника "ВидыСвязейМеждуФизЛицами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСвязейМеждуФизЛицами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСделокСКлиентами" 

	Дано Я открываю основную форму списка справочника "ВидыСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСделокСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСделокСКлиентами"

	Дано Я открываю основную форму справочника "ВидыСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСделокСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСделокСКлиентамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВидыСделокСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСделокСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСделокСКлиентамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВидыСделокСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСделокСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСправок" 

	Дано Я открываю основную форму списка справочника "ВидыСправок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСправок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСправок"

	Дано Я открываю основную форму справочника "ВидыСправок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСправок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСтажа" 

	Дано Я открываю основную форму списка справочника "ВидыСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСтажа"

	Дано Я открываю основную форму справочника "ВидыСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыТарифовСтраховыхВзносов" 

	Дано Я открываю основную форму списка справочника "ВидыТарифовСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыТарифовСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыТарифовСтраховыхВзносов"

	Дано Я открываю основную форму справочника "ВидыТарифовСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыТарифовСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыТехнологическихОпераций" 

	Дано Я открываю основную форму списка справочника "ВидыТехнологическихОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыТехнологическихОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыТехнологическихОпераций"

	Дано Я открываю основную форму справочника "ВидыТехнологическихОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыТехнологическихОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыФинансовыхОтчетов" 

	Дано Я открываю основную форму списка справочника "ВидыФинансовыхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыФинансовыхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыФинансовыхОтчетов"

	Дано Я открываю основную форму справочника "ВидыФинансовыхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыФинансовыхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЦен" 

	Дано Я открываю основную форму списка справочника "ВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦен"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЦен"

	Дано Я открываю основную форму справочника "ВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦен"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЦенПоставщиков" 

	Дано Я открываю основную форму списка справочника "ВидыЦенПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦенПоставщиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЦенПоставщиков"

	Дано Я открываю основную форму справочника "ВидыЦенПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦенПоставщиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеПользователи" 

	Дано Я открываю основную форму списка справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнешниеПользователи"

	Дано Я открываю основную форму справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнутреннееПотреблениеТоваровПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Военкоматы" 

	Дано Я открываю основную форму списка справочника "Военкоматы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Военкоматы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Военкоматы"

	Дано Я открываю основную форму справочника "Военкоматы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Военкоматы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратНДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратНДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратСырьяДавальцуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратСырьяДавальцуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратСырьяДавальцуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратСырьяДавальцуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратСырьяДавальцуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратСырьяДавальцуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратСырьяОтПереработчикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратСырьяОтПереработчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратСырьяОтПереработчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратСырьяОтПереработчикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратСырьяОтПереработчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратСырьяОтПереработчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровОтКлиентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровОтКлиентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровПоставщикуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратТоваровПоставщикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровПоставщикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровПоставщикуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратТоваровПоставщикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровПоставщикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВопросыШаблонаАнкеты" 

	Дано Я открываю основную форму списка справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВопросыШаблонаАнкеты"

	Дано Я открываю основную форму справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВосстановлениеВДолжностиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВосстановлениеВДолжностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВосстановлениеВДолжностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВосстановлениеВДолжностиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВосстановлениеВДолжностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВосстановлениеВДолжностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВстречаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВстречаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВстречаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВстречаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящийЗапросСведенийДляРасчетаПособияФССПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВходящийЗапросСведенийДляРасчетаПособияФССПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВходящийЗапросСведенийДляРасчетаПособияФССПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящийЗапросСведенийДляРасчетаПособияФССПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВходящийЗапросСведенийДляРасчетаПособияФССПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВходящийЗапросСведенийДляРасчетаПособияФССПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупТоваровХранителемПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВыкупТоваровХранителемПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупТоваровХранителемПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупТоваровХранителемПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВыкупТоваровХранителемПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупТоваровХранителемПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатаБывшимСотрудникамПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВыплатаБывшимСотрудникамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыплатаБывшимСотрудникамПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатаБывшимСотрудникамПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВыплатаБывшимСотрудникамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыплатаБывшимСотрудникамПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатыПоДоговорамОпекиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВыплатыПоДоговорамОпекиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыплатыПоДоговорамОпекиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатыПоДоговорамОпекиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВыплатыПоДоговорамОпекиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыплатыПоДоговорамОпекиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГИСМПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ГИСМПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГИСМПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГИСМПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ГИСМПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГИСМПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГодовыеГрафикиАмортизацииОС" 

	Дано Я открываю основную форму списка справочника "ГодовыеГрафикиАмортизацииОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГодовыеГрафикиАмортизацииОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГодовыеГрафикиАмортизацииОС"

	Дано Я открываю основную форму справочника "ГодовыеГрафикиАмортизацииОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГодовыеГрафикиАмортизацииОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГорячиеКлавиши" 

	Дано Я открываю основную форму списка справочника "ГорячиеКлавиши"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГорячиеКлавиши"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГорячиеКлавиши"

	Дано Я открываю основную форму справочника "ГорячиеКлавиши"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГорячиеКлавиши"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГосударственныеКонтракты" 

	Дано Я открываю основную форму списка справочника "ГосударственныеКонтракты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГосударственныеКонтракты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГосударственныеКонтракты"

	Дано Я открываю основную форму справочника "ГосударственныеКонтракты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГосударственныеКонтракты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикиОплаты" 

	Дано Я открываю основную форму списка справочника "ГрафикиОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиОплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиОплаты"

	Дано Я открываю основную форму справочника "ГрафикиОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиОплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикиРаботыСотрудников" 

	Дано Я открываю основную форму списка справочника "ГрафикиРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиРаботыСотрудников"

	Дано Я открываю основную форму справочника "ГрафикиРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикОтпусковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ГрафикОтпусковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикОтпусковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикОтпусковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ГрафикОтпусковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикОтпусковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппировкиТоварныхОграничений" 

	Дано Я открываю основную форму списка справочника "ГруппировкиТоварныхОграничений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппировкиТоварныхОграничений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппировкиТоварныхОграничений"

	Дано Я открываю основную форму справочника "ГруппировкиТоварныхОграничений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппировкиТоварныхОграничений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыАналитическогоУчетаНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ГруппыАналитическогоУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыАналитическогоУчетаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыАналитическогоУчетаНоменклатуры"

	Дано Я открываю основную форму справочника "ГруппыАналитическогоУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыАналитическогоУчетаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыВнешнихПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыВнешнихПользователей"

	Дано Я открываю основную форму справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступа" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступа"

	Дано Я открываю основную форму справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаВидовБюджетов" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаВидовБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаВидовБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаВидовБюджетов"

	Дано Я открываю основную форму справочника "ГруппыДоступаВидовБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаВидовБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаНоменклатуры"

	Дано Я открываю основную форму справочника "ГруппыДоступаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаПартнеров" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаПартнеров"

	Дано Я открываю основную форму справочника "ГруппыДоступаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаСтатейИПоказателейБюджетов" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаСтатейИПоказателейБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаСтатейИПоказателейБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаСтатейИПоказателейБюджетов"

	Дано Я открываю основную форму справочника "ГруппыДоступаСтатейИПоказателейБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаСтатейИПоказателейБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаФизическихЛиц"

	Дано Я открываю основную форму справочника "ГруппыДоступаФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыИсполнителейЗадач" 

	Дано Я открываю основную форму списка справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыИсполнителейЗадач"

	Дано Я открываю основную форму справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыНМАМеждународныйУчет" 

	Дано Я открываю основную форму списка справочника "ГруппыНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыНМАМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыНМАМеждународныйУчет"

	Дано Я открываю основную форму справочника "ГруппыНМАМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыНМАМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыОСМеждународныйУчет" 

	Дано Я открываю основную форму списка справочника "ГруппыОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыОСМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыОСМеждународныйУчет"

	Дано Я открываю основную форму справочника "ГруппыОСМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыОСМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыПользователей"

	Дано Я открываю основную форму справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыРассылокИОповещений" 

	Дано Я открываю основную форму списка справочника "ГруппыРассылокИОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыРассылокИОповещений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыРассылокИОповещений"

	Дано Я открываю основную форму справочника "ГруппыРассылокИОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыРассылокИОповещений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыСотрудников" 

	Дано Я открываю основную форму списка справочника "ГруппыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыСотрудников"

	Дано Я открываю основную форму справочника "ГруппыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыФинансовогоУчетаВнеоборотныхАктивов" 

	Дано Я открываю основную форму списка справочника "ГруппыФинансовогоУчетаВнеоборотныхАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаВнеоборотныхАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыФинансовогоУчетаВнеоборотныхАктивов"

	Дано Я открываю основную форму справочника "ГруппыФинансовогоУчетаВнеоборотныхАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаВнеоборотныхАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыФинансовогоУчетаДенежныхСредств" 

	Дано Я открываю основную форму списка справочника "ГруппыФинансовогоУчетаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыФинансовогоУчетаДенежныхСредств"

	Дано Я открываю основную форму справочника "ГруппыФинансовогоУчетаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыФинансовогоУчетаДоходовРасходов" 

	Дано Я открываю основную форму списка справочника "ГруппыФинансовогоУчетаДоходовРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаДоходовРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыФинансовогоУчетаДоходовРасходов"

	Дано Я открываю основную форму справочника "ГруппыФинансовогоУчетаДоходовРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаДоходовРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыФинансовогоУчетаНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ГруппыФинансовогоУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыФинансовогоУчетаНоменклатуры"

	Дано Я открываю основную форму справочника "ГруппыФинансовогоУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыФинансовогоУчетаРасчетов" 

	Дано Я открываю основную форму списка справочника "ГруппыФинансовогоУчетаРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаРасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыФинансовогоУчетаРасчетов"

	Дано Я открываю основную форму справочника "ГруппыФинансовогоУчетаРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаРасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеСервисовОбменаСБанками" 

	Дано Я открываю основную форму списка справочника "ДанныеСервисовОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДанныеСервисовОбменаСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеСервисовОбменаСБанками"

	Дано Я открываю основную форму справочника "ДанныеСервисовОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДанныеСервисовОбменаСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвижениеПродукцииИМатериаловПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДвижениеПродукцииИМатериаловПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДвижениеПродукцииИМатериаловПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвижениеПродукцииИМатериаловПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДвижениеПродукцииИМатериаловПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДвижениеПродукцииИМатериаловПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеДокументы" 

	Дано Я открываю основную форму списка справочника "ДенежныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДенежныеДокументы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеДокументы"

	Дано Я открываю основную форму справочника "ДенежныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДенежныеДокументы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоверенностиНалогоплательщика" 

	Дано Я открываю основную форму списка справочника "ДоверенностиНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоверенностиНалогоплательщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоверенностиНалогоплательщика"

	Дано Я открываю основную форму справочника "ДоверенностиНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоверенностиНалогоплательщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорАвторскогоЗаказаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорАвторскогоЗаказаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорАвторскогоЗаказаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорАвторскогоЗаказаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорАвторскогоЗаказаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорАвторскогоЗаказаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорЗаймаСотрудникуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорЗаймаСотрудникуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорЗаймаСотрудникуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорЗаймаСотрудникуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорЗаймаСотрудникуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорЗаймаСотрудникуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорРаботыУслугиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорРаботыУслугиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорРаботыУслугиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорРаботыУслугиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорРаботыУслугиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорРаботыУслугиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыАренды" 

	Дано Я открываю основную форму списка справочника "ДоговорыАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыАренды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыАренды"

	Дано Я открываю основную форму справочника "ДоговорыАренды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыАренды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыАрендыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорыАрендыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыАрендыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыАрендыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорыАрендыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыАрендыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыКонтрагентов" 

	Дано Я открываю основную форму списка справочника "ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКонтрагентов"

	Дано Я открываю основную форму справочника "ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыКонтрагентовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорыКонтрагентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКонтрагентовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорыКонтрагентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыКредитовИДепозитов" 

	Дано Я открываю основную форму списка справочника "ДоговорыКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКредитовИДепозитов"

	Дано Я открываю основную форму справочника "ДоговорыКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыКредитовИДепозитовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорыКредитовИДепозитовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКредитовИДепозитовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКредитовИДепозитовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорыКредитовИДепозитовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКредитовИДепозитовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыМеждуОрганизациями" 

	Дано Я открываю основную форму списка справочника "ДоговорыМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыМеждуОрганизациями"

	Дано Я открываю основную форму справочника "ДоговорыМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыМеждуОрганизациямиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыЭквайринга" 

	Дано Я открываю основную форму списка справочника "ДоговорыЭквайринга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыЭквайринга"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыЭквайринга"

	Дано Я открываю основную форму справочника "ДоговорыЭквайринга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыЭквайринга"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыЭквайрингаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорыЭквайрингаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыЭквайрингаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыЭквайрингаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорыЭквайрингаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыЭквайрингаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументКадровогоЭДОПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДокументКадровогоЭДОПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументКадровогоЭДОПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументКадровогоЭДОПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДокументКадровогоЭДОПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументКадровогоЭДОПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументооборотыОбменаСБанками" 

	Дано Я открываю основную форму списка справочника "ДокументооборотыОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументооборотыОбменаСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументооборотыОбменаСБанками"

	Дано Я открываю основную форму справочника "ДокументооборотыОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументооборотыОбменаСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыВНАПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДокументыВНАПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументыВНАПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыВНАПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДокументыВНАПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументыВНАПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "ДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыРеализацииПолномочийНалоговыхОрганов"

	Дано Я открываю основную форму справочника "ДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыРемонтыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДокументыРемонтыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументыРемонтыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыРемонтыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДокументыРемонтыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументыРемонтыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Должности" 

	Дано Я открываю основную форму списка справочника "Должности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Должности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Должности"

	Дано Я открываю основную форму справочника "Должности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Должности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоходВНатуральнойФормеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоходВНатуральнойФормеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоходВНатуральнойФормеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоходВНатуральнойФормеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоходВНатуральнойФормеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоходВНатуральнойФормеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоходыБудущихПериодов" 

	Дано Я открываю основную форму списка справочника "ДоходыБудущихПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоходыБудущихПериодов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоходыБудущихПериодов"

	Дано Я открываю основную форму справочника "ДоходыБудущихПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоходыБудущихПериодов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДрагоценныеМатериалы" 

	Дано Я открываю основную форму списка справочника "ДрагоценныеМатериалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрагоценныеМатериалы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДрагоценныеМатериалы"

	Дано Я открываю основную форму справочника "ДрагоценныеМатериалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрагоценныеМатериалы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДрайверыОборудования" 

	Дано Я открываю основную форму списка справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДрайверыОборудования"

	Дано Я открываю основную форму справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЕГАИСПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЕГАИСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕГАИСПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕГАИСПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЕГАИСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕГАИСПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЕдиницыГенерирующиеДенежныеСредства" 

	Дано Я открываю основную форму списка справочника "ЕдиницыГенерирующиеДенежныеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыГенерирующиеДенежныеСредства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕдиницыГенерирующиеДенежныеСредства"

	Дано Я открываю основную форму справочника "ЕдиницыГенерирующиеДенежныеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыГенерирующиеДенежныеСредства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЕдиницыИзмеренияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЕдиницыИзмеренияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыИзмеренияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕдиницыИзмеренияВЕТИС"

	Дано Я открываю основную форму справочника "ЕдиницыИзмеренияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыИзмеренияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов" 

	Дано Я открываю основную форму списка справочника "ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов"

	Дано Я открываю основную форму справочника "ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаболеванияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЗаболеванияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаболеванияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаболеванияВЕТИС"

	Дано Я открываю основную форму справочника "ЗаболеванияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаболеванияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданиеНаПеревозкуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаданиеНаПеревозкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаданиеНаПеревозкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданиеНаПеревозкуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаданиеНаПеревозкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаданиеНаПеревозкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданиеТорговомуПредставителюПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗадачиПроектов" 

	Дано Я открываю основную форму списка справочника "ЗадачиПроектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиПроектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗадачиПроектов"

	Дано Я открываю основную форму справочника "ЗадачиПроектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиПроектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказДавальцаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказДавальцаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказДавальцаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказДавальцаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказДавальцаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказДавальцаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказКлиентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказКлиентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказМатериаловВПроизводствоПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказМатериаловВПроизводствоПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказМатериаловВПроизводствоПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказМатериаловВПроизводствоПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказМатериаловВПроизводствоПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказМатериаловВПроизводствоПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаПеремещениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказНаПеремещениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаПеремещениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаПеремещениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказНаПеремещениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаПеремещениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаПроизводство2_2ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказНаПроизводство2_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаПроизводство2_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаПроизводство2_2ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказНаПроизводство2_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаПроизводство2_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаРемонтПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказНаРемонтПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаРемонтПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаРемонтПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказНаРемонтПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаРемонтПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаСборкуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказНаСборкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаСборкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаСборкуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказНаСборкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаСборкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПереработчикуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказПереработчикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказПереработчикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПереработчикуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказПереработчикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказПереработчикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПоставщикуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказПоставщикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказПоставщикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПоставщикуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказПоставщикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказПоставщикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакладкиВзаимодействий" 

	Дано Я открываю основную форму списка справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗакладкиВзаимодействий"

	Дано Я открываю основную форму справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Заметки" 

	Дано Я открываю основную форму списка справочника "Заметки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Заметки"

	Дано Я открываю основную форму справочника "Заметки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамещениеГосударственныхМуниципальныхДолжностейПФР" 

	Дано Я открываю основную форму списка справочника "ЗамещениеГосударственныхМуниципальныхДолжностейПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗамещениеГосударственныхМуниципальныхДолжностейПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамещениеГосударственныхМуниципальныхДолжностейПФР"

	Дано Я открываю основную форму справочника "ЗамещениеГосударственныхМуниципальныхДолжностейПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗамещениеГосударственныхМуниципальныхДолжностейПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиСкладскогоЖурналаВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЗаписиСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиСкладскогоЖурналаВЕТИС"

	Дано Я открываю основную форму справочника "ЗаписиСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействиеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗарплатныеПроекты" 

	Дано Я открываю основную форму списка справочника "ЗарплатныеПроекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗарплатныеПроекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗарплатныеПроекты"

	Дано Я открываю основную форму справочника "ЗарплатныеПроекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗарплатныеПроекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаКомандировкуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаНаКомандировкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаКомандировкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаКомандировкуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаНаКомандировкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаКомандировкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаСотрудникаДобровольныеСтраховыеВзносыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаСотрудникаДобровольныеСтраховыеВзносыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаДобровольныеСтраховыеВзносыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаСотрудникаДобровольныеСтраховыеВзносыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаСотрудникаДобровольныеСтраховыеВзносыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаДобровольныеСтраховыеВзносыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаСотрудникаИзменитьЛичныеДанныеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаСотрудникаИзменитьЛичныеДанныеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаИзменитьЛичныеДанныеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаСотрудникаИзменитьЛичныеДанныеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаСотрудникаИзменитьЛичныеДанныеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаИзменитьЛичныеДанныеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаСотрудникаНалоговыйВычетПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаСотрудникаНалоговыйВычетПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаНалоговыйВычетПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаСотрудникаНалоговыйВычетПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаСотрудникаНалоговыйВычетПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаНалоговыйВычетПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаСотрудникаОтпускПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаСотрудникаОтпускПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаОтпускПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаСотрудникаОтпускПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаСотрудникаОтпускПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаОтпускПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаСотрудникаОтсутствиеПоБолезниПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаСотрудникаОтсутствиеПоБолезниПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаОтсутствиеПоБолезниПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаСотрудникаОтсутствиеПоБолезниПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаСотрудникаОтсутствиеПоБолезниПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаОтсутствиеПоБолезниПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаСотрудникаОтсутствиеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаСотрудникаОтсутствиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаОтсутствиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаСотрудникаОтсутствиеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаСотрудникаОтсутствиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаОтсутствиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаСотрудникаСправка2НДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаСотрудникаСправка2НДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаСправка2НДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаСотрудникаСправка2НДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаСотрудникаСправка2НДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаСправка2НДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаСотрудникаСправкаОстаткиОтпусковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаСотрудникаСправкаОстаткиОтпусковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаСправкаОстаткиОтпусковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаСотрудникаСправкаОстаткиОтпусковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаСотрудникаСправкаОстаткиОтпусковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаСправкаОстаткиОтпусковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаСотрудникаСправкаСМестаРаботыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаСотрудникаСправкаСМестаРаботыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаСправкаСМестаРаботыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаСотрудникаСправкаСМестаРаботыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаСотрудникаСправкаСМестаРаботыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаСотрудникаСправкаСМестаРаботыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеАбонентаСпецоператораСвязиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеАбонентаСпецоператораСвязиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеАбонентаСпецоператораСвязиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеАбонентаСпецоператораСвязиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявлениеАбонентаСпецоператораСвязиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеАбонентаСпецоператораСвязиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеОНазначенииПенсии" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеОНазначенииПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеОНазначенииПенсии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеОНазначенииПенсии"

	Дано Я открываю основную форму справочника "ЗаявлениеОНазначенииПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеОНазначенииПенсии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеОНазначенииПенсииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеОНазначенииПенсииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеОНазначенииПенсииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеОНазначенииПенсииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявлениеОНазначенииПенсииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеОНазначенииПенсииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗванияГражданскогоВоинскогоУчета" 

	Дано Я открываю основную форму списка справочника "ЗванияГражданскогоВоинскогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗванияГражданскогоВоинскогоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗванияГражданскогоВоинскогоУчета"

	Дано Я открываю основную форму справочника "ЗванияГражданскогоВоинскогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗванияГражданскогоВоинскогоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияКатегорийНовостей" 

	Дано Я открываю основную форму списка справочника "ЗначенияКатегорийНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияКатегорийНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийНовостей"

	Дано Я открываю основную форму справочника "ЗначенияКатегорийНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияКатегорийНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектов" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектов"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектовИерархия" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектовИерархия"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗоныДоставки" 

	Дано Я открываю основную форму списка справочника "ЗоныДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗоныДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗоныДоставки"

	Дано Я открываю основную форму справочника "ЗоныДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗоныДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовМетаданных" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовМетаданных"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовРасширений" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовРасширений"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыСервисовСопровождения" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыСервисовСопровождения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыСервисовСопровождения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыСервисовСопровождения"

	Дано Я открываю основную форму справочника "ИдентификаторыСервисовСопровождения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыСервисовСопровождения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзвещениеФССПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзвещениеФССПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзвещениеФССПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзвещениеФССПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзвещениеФССПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзвещениеФССПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеАвансаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеАвансаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеАвансаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеАвансаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеАвансаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеАвансаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеМестРаботыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеМестРаботыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеМестРаботыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеМестРаботыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеМестРаботыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеМестРаботыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеОплатыТрудаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеОплатыТрудаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеОплатыТрудаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеОплатыТрудаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеОплатыТрудаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеОплатыТрудаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПлановыхНачисленийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеПлановыхНачисленийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеПлановыхНачисленийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПлановыхНачисленийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеПлановыхНачисленийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеПлановыхНачисленийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеШтатногоРасписанияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеШтатногоРасписанияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеШтатногоРасписанияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеШтатногоРасписанияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеШтатногоРасписанияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеШтатногоРасписанияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияРасчетовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИнвентаризацияРасчетовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнвентаризацияРасчетовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияРасчетовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИнвентаризацияРасчетовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнвентаризацияРасчетовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндексацияЗаработкаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИндексацияЗаработкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИндексацияЗаработкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндексацияЗаработкаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИндексацияЗаработкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИндексацияЗаработкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндексацияШтатногоРасписанияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИндексацияШтатногоРасписанияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИндексацияШтатногоРасписанияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндексацияШтатногоРасписанияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИндексацияШтатногоРасписанияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИндексацияШтатногоРасписанияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндивидуальныйГрафикПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИндивидуальныйГрафикПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИндивидуальныйГрафикПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндивидуальныйГрафикПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИндивидуальныйГрафикПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИндивидуальныйГрафикПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнойДокументПодтвержденияНДСПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнструкцииБанку" 

	Дано Я открываю основную форму списка справочника "ИнструкцииБанку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнструкцииБанку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнструкцииБанку"

	Дано Я открываю основную форму справочника "ИнструкцииБанку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнструкцииБанку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнформационныеСсылкиДляФорм" 

	Дано Я открываю основную форму списка справочника "ИнформационныеСсылкиДляФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнформационныеСсылкиДляФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнформационныеСсылкиДляФорм"

	Дано Я открываю основную форму справочника "ИнформационныеСсылкиДляФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнформационныеСсылкиДляФорм"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИСМППрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИСМППрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИСМППрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИСМППрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИСМППрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИСМППрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсполнительныйЛистПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИсполнительныйЛистПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсполнительныйЛистПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсполнительныйЛистПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИсполнительныйЛистПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсполнительныйЛистПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияПроверкиИКорректировкиДанных" 

	Дано Я открываю основную форму списка справочника "ИсторияПроверкиИКорректировкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияПроверкиИКорректировкиДанных"

	Дано Я открываю основную форму справочника "ИсторияПроверкиИКорректировкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсточникиДанныхПланирования" 

	Дано Я открываю основную форму списка справочника "ИсточникиДанныхПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсточникиДанныхПланирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсточникиДанныхПланирования"

	Дано Я открываю основную форму справочника "ИсточникиДанныхПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсточникиДанныхПланирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйПереводПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КадровыйПереводПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйПереводПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйПереводПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КадровыйПереводПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйПереводПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйПереводСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КадровыйПереводСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйПереводСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйПереводСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КадровыйПереводСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйПереводСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Календари" 

	Дано Я открываю основную форму списка справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Календари"

	Дано Я открываю основную форму справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КартыЛояльности" 

	Дано Я открываю основную форму списка справочника "КартыЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КартыЛояльности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КартыЛояльности"

	Дано Я открываю основную форму справочника "КартыЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КартыЛояльности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассовыеКниги" 

	Дано Я открываю основную форму списка справочника "КассовыеКниги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассовыеКниги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассовыеКниги"

	Дано Я открываю основную форму справочника "КассовыеКниги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассовыеКниги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Кассы" 

	Дано Я открываю основную форму списка справочника "Кассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Кассы"

	Дано Я открываю основную форму справочника "Кассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассыККМ" 

	Дано Я открываю основную форму списка справочника "КассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассыККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассыККМ"

	Дано Я открываю основную форму справочника "КассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассыККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииПолучателейСтимулирующихВыплатФСС" 

	Дано Я открываю основную форму списка справочника "КатегорииПолучателейСтимулирующихВыплатФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииПолучателейСтимулирующихВыплатФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииПолучателейСтимулирующихВыплатФСС"

	Дано Я открываю основную форму справочника "КатегорииПолучателейСтимулирующихВыплатФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииПолучателейСтимулирующихВыплатФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииЦелей" 

	Дано Я открываю основную форму списка справочника "КатегорииЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииЦелей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииЦелей"

	Дано Я открываю основную форму справочника "КатегорииЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииЦелей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииЭксплуатации" 

	Дано Я открываю основную форму списка справочника "КатегорииЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииЭксплуатации"

	Дано Я открываю основную форму справочника "КатегорииЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторАлкогольнойПродукцииЕГАИС" 

	Дано Я открываю основную форму списка справочника "КлассификаторАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму справочника "КлассификаторАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторБанков" 

	Дано Я открываю основную форму списка справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторБанков"

	Дано Я открываю основную форму справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторВидовЭкономическойДеятельности" 

	Дано Я открываю основную форму списка справочника "КлассификаторВидовЭкономическойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторВидовЭкономическойДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторВидовЭкономическойДеятельности"

	Дано Я открываю основную форму справочника "КлассификаторВидовЭкономическойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторВидовЭкономическойДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторЗанятий" 

	Дано Я открываю основную форму списка справочника "КлассификаторЗанятий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторЗанятий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторЗанятий"

	Дано Я открываю основную форму справочника "КлассификаторЗанятий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторЗанятий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторОКВЭД2" 

	Дано Я открываю основную форму списка справочника "КлассификаторОКВЭД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОКВЭД2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторОКВЭД2"

	Дано Я открываю основную форму справочника "КлассификаторОКВЭД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОКВЭД2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторОКПД2" 

	Дано Я открываю основную форму списка справочника "КлассификаторОКПД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОКПД2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторОКПД2"

	Дано Я открываю основную форму справочника "КлассификаторОКПД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОКПД2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторОрганизацийЕГАИС" 

	Дано Я открываю основную форму списка справочника "КлассификаторОрганизацийЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОрганизацийЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторОрганизацийЕГАИС"

	Дано Я открываю основную форму справочника "КлассификаторОрганизацийЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОрганизацийЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторПродукцииПоВидамДеятельности" 

	Дано Я открываю основную форму списка справочника "КлассификаторПродукцииПоВидамДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторПродукцииПоВидамДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторПродукцииПоВидамДеятельности"

	Дано Я открываю основную форму справочника "КлассификаторПродукцииПоВидамДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторПродукцииПоВидамДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторСпециальностейПоОбразованию" 

	Дано Я открываю основную форму списка справочника "КлассификаторСпециальностейПоОбразованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторСпециальностейПоОбразованию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторСпециальностейПоОбразованию"

	Дано Я открываю основную форму справочника "КлассификаторСпециальностейПоОбразованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторСпециальностейПоОбразованию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторТНВЭД" 

	Дано Я открываю основную форму списка справочника "КлассификаторТНВЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторТНВЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторТНВЭД"

	Дано Я открываю основную форму справочника "КлассификаторТНВЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторТНВЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторУслугНаселению" 

	Дано Я открываю основную форму списка справочника "КлассификаторУслугНаселению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторУслугНаселению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторУслугНаселению"

	Дано Я открываю основную форму справочника "КлассификаторУслугНаселению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторУслугНаселению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассыОбъектовЭксплуатации" 

	Дано Я открываю основную форму списка справочника "КлассыОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассыОбъектовЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассыОбъектовЭксплуатации"

	Дано Я открываю основную форму справочника "КлассыОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассыОбъектовЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючевыеОперации" 

	Дано Я открываю основную форму списка справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючевыеОперации"

	Дано Я открываю основную форму справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиАналитикиУчетаНаборов" 

	Дано Я открываю основную форму списка справочника "КлючиАналитикиУчетаНаборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаНаборов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиАналитикиУчетаНаборов"

	Дано Я открываю основную форму справочника "КлючиАналитикиУчетаНаборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаНаборов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиАналитикиУчетаНоменклатуры" 

	Дано Я открываю основную форму списка справочника "КлючиАналитикиУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиАналитикиУчетаНоменклатуры"

	Дано Я открываю основную форму справочника "КлючиАналитикиУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиАналитикиУчетаПартий" 

	Дано Я открываю основную форму списка справочника "КлючиАналитикиУчетаПартий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаПартий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиАналитикиУчетаПартий"

	Дано Я открываю основную форму справочника "КлючиАналитикиУчетаПартий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаПартий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиАналитикиУчетаПоПартнерам" 

	Дано Я открываю основную форму списка справочника "КлючиАналитикиУчетаПоПартнерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаПоПартнерам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиАналитикиУчетаПоПартнерам"

	Дано Я открываю основную форму справочника "КлючиАналитикиУчетаПоПартнерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаПоПартнерам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступа" 

	Дано Я открываю основную форму списка справочника "КлючиДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступа"

	Дано Я открываю основную форму справочника "КлючиДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиРеестраДокументов" 

	Дано Я открываю основную форму списка справочника "КлючиРеестраДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиРеестраДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиРеестраДокументов"

	Дано Я открываю основную форму справочника "КлючиРеестраДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиРеестраДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодыВалютныхОпераций" 

	Дано Я открываю основную форму списка справочника "КодыВалютныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыВалютныхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодыВалютныхОпераций"

	Дано Я открываю основную форму справочника "КодыВалютныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыВалютныхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодыОперацийПрослеживаемости" 

	Дано Я открываю основную форму списка справочника "КодыОперацийПрослеживаемости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыОперацийПрослеживаемости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодыОперацийПрослеживаемости"

	Дано Я открываю основную форму справочника "КодыОперацийПрослеживаемости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыОперацийПрослеживаемости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодыОперацийРаздела7ДекларацииПоНДС" 

	Дано Я открываю основную форму списка справочника "КодыОперацийРаздела7ДекларацииПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыОперацийРаздела7ДекларацииПоНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодыОперацийРаздела7ДекларацииПоНДС"

	Дано Я открываю основную форму справочника "КодыОперацийРаздела7ДекларацииПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыОперацийРаздела7ДекларацииПоНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоллекцииНоменклатуры" 

	Дано Я открываю основную форму списка справочника "КоллекцииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоллекцииНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоллекцииНоменклатуры"

	Дано Я открываю основную форму справочника "КоллекцииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоллекцииНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомандировкаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КомандировкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомандировкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомандировкаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КомандировкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомандировкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомандировкиСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КомандировкиСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомандировкиСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомандировкиСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КомандировкиСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомандировкиСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческоеПредложениеКлиентуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомплектыОтчетностиПерсУчета" 

	Дано Я открываю основную форму списка справочника "КомплектыОтчетностиПерсУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыОтчетностиПерсУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомплектыОтчетностиПерсУчета"

	Дано Я открываю основную форму справочника "КомплектыОтчетностиПерсУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыОтчетностиПерсУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомплектыОтчетностиПерсУчетаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КомплектыОтчетностиПерсУчетаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыОтчетностиПерсУчетаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомплектыОтчетностиПерсУчетаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КомплектыОтчетностиПерсУчетаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыОтчетностиПерсУчетаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомплектыФинансовыхОтчетов" 

	Дано Я открываю основную форму списка справочника "КомплектыФинансовыхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыФинансовыхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомплектыФинансовыхОтчетов"

	Дано Я открываю основную форму справочника "КомплектыФинансовыхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыФинансовыхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтактныеЛицаПартнеров" 

	Дано Я открываю основную форму списка справочника "КонтактныеЛицаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтактныеЛицаПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактныеЛицаПартнеров"

	Дано Я открываю основную форму справочника "КонтактныеЛицаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтактныеЛицаПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Контрагенты" 

	Дано Я открываю основную форму списка справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Контрагенты"

	Дано Я открываю основную форму справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПлановыхПотребностейПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КорректировкаПлановыхПотребностейПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаПлановыхПотребностейПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПлановыхПотребностейПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КорректировкаПлановыхПотребностейПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаПлановыхПотребностейПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПриобретенияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КорректировкаПриобретенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаПриобретенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПриобретенияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КорректировкаПриобретенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаПриобретенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРеализацииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КорректировкаРеализацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаРеализацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРеализацииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КорректировкаРеализацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаРеализацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛентыНовостей" 

	Дано Я открываю основную форму списка справочника "ЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛентыНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛентыНовостей"

	Дано Я открываю основную форму справочника "ЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛентыНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛицензииПоставщиковАлкогольнойПродукции" 

	Дано Я открываю основную форму списка справочника "ЛицензииПоставщиковАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛицензииПоставщиковАлкогольнойПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛицензииПоставщиковАлкогольнойПродукции"

	Дано Я открываю основную форму справочника "ЛицензииПоставщиковАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛицензииПоставщиковАлкогольнойПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МакетыПенсионныхДел" 

	Дано Я открываю основную форму списка справочника "МакетыПенсионныхДел"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МакетыПенсионныхДел"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МакетыПенсионныхДел"

	Дано Я открываю основную форму справочника "МакетыПенсионныхДел"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МакетыПенсионныхДел"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МакетыПенсионныхДелПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "МакетыПенсионныхДелПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МакетыПенсионныхДелПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МакетыПенсионныхДелПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "МакетыПенсионныхДелПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МакетыПенсионныхДелПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаркетинговыеМероприятия" 

	Дано Я открываю основную форму списка справочника "МаркетинговыеМероприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаркетинговыеМероприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаркетинговыеМероприятия"

	Дано Я открываю основную форму справочника "МаркетинговыеМероприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаркетинговыеМероприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаркетинговыеМероприятияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "МаркетинговыеМероприятияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаркетинговыеМероприятияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаркетинговыеМероприятияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "МаркетинговыеМероприятияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаркетинговыеМероприятияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Марки" 

	Дано Я открываю основную форму списка справочника "Марки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Марки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Марки"

	Дано Я открываю основную форму справочника "Марки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Марки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаршрутныеКарты" 

	Дано Я открываю основную форму списка справочника "МаршрутныеКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутныеКарты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаршрутныеКарты"

	Дано Я открываю основную форму справочника "МаршрутныеКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутныеКарты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаршрутныеКартыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "МаршрутныеКартыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутныеКартыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаршрутныеКартыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "МаршрутныеКартыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутныеКартыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаршрутыПодписания" 

	Дано Я открываю основную форму списка справочника "МаршрутыПодписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутыПодписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаршрутыПодписания"

	Дано Я открываю основную форму справочника "МаршрутыПодписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутыПодписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МатериальнаяПомощьПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "МатериальнаяПомощьПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МатериальнаяПомощьПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МатериальнаяПомощьПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "МатериальнаяПомощьПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МатериальнаяПомощьПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МашиночитаемыеДоверенностиФНС" 

	Дано Я открываю основную форму списка справочника "МашиночитаемыеДоверенностиФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МашиночитаемыеДоверенностиФНС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МашиночитаемыеДоверенностиФНС"

	Дано Я открываю основную форму справочника "МашиночитаемыеДоверенностиФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МашиночитаемыеДоверенностиФНС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МедицинскиеОрганизации" 

	Дано Я открываю основную форму списка справочника "МедицинскиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МедицинскиеОрганизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МедицинскиеОрганизации"

	Дано Я открываю основную форму справочника "МедицинскиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МедицинскиеОрганизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестаРаботы" 

	Дано Я открываю основную форму списка справочника "МестаРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МестаРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестаРаботы"

	Дано Я открываю основную форму справочника "МестаРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МестаРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МобильныеКомпьютеры" 

	Дано Я открываю основную форму списка справочника "МобильныеКомпьютеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МобильныеКомпьютеры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МобильныеКомпьютеры"

	Дано Я открываю основную форму справочника "МобильныеКомпьютеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МобильныеКомпьютеры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МоделиБюджетирования" 

	Дано Я открываю основную форму списка справочника "МоделиБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МоделиБюджетирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МоделиБюджетирования"

	Дано Я открываю основную форму справочника "МоделиБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МоделиБюджетирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МоделиБюджетированияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "МоделиБюджетированияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МоделиБюджетированияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МоделиБюджетированияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "МоделиБюджетированияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МоделиБюджетированияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МоделиПооперационногоПланирования" 

	Дано Я открываю основную форму списка справочника "МоделиПооперационногоПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МоделиПооперационногоПланирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МоделиПооперационногоПланирования"

	Дано Я открываю основную форму справочника "МоделиПооперационногоПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МоделиПооперационногоПланирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыГруппДоступа" 

	Дано Я открываю основную форму списка справочника "НаборыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыГруппДоступа"

	Дано Я открываю основную форму справочника "НаборыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыДополнительныхРеквизитовИСведений" 

	Дано Я открываю основную форму списка справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыДополнительныхРеквизитовИСведений"

	Дано Я открываю основную форму справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыУпаковок" 

	Дано Я открываю основную форму списка справочника "НаборыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыУпаковок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыУпаковок"

	Дано Я открываю основную форму справочника "НаборыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыУпаковок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Награды" 

	Дано Я открываю основную форму списка справочника "Награды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Награды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Награды"

	Дано Я открываю основную форму справочника "Награды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Награды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеПлановогоНачисленияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НазначениеПлановогоНачисленияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НазначениеПлановогоНачисленияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеПлановогоНачисленияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НазначениеПлановогоНачисленияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НазначениеПлановогоНачисленияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеПодработкиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НазначениеПодработкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НазначениеПодработкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеПодработкиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НазначениеПодработкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НазначениеПодработкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Назначения" 

	Дано Я открываю основную форму списка справочника "Назначения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Назначения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Назначения"

	Дано Я открываю основную форму справочника "Назначения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Назначения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НалоговыеОрганы" 

	Дано Я открываю основную форму списка справочника "НалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НалоговыеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НалоговыеОрганы"

	Дано Я открываю основную форму справочника "НалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НалоговыеОрганы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаправленияДеятельности" 

	Дано Я открываю основную форму списка справочника "НаправленияДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаправленияДеятельности"

	Дано Я открываю основную форму справочника "НаправленияДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаправленияИспользованияПрибыли" 

	Дано Я открываю основную форму списка справочника "НаправленияИспользованияПрибыли"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияИспользованияПрибыли"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаправленияИспользованияПрибыли"

	Дано Я открываю основную форму справочника "НаправленияИспользованияПрибыли"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияИспользованияПрибыли"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаправленияСдачиОтчетности" 

	Дано Я открываю основную форму списка справочника "НаправленияСдачиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияСдачиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаправленияСдачиОтчетности"

	Дано Я открываю основную форму справочника "НаправленияСдачиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияСдачиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменСБанками" 

	Дано Я открываю основную форму списка справочника "НастройкиОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменСБанками"

	Дано Я открываю основную форму справочника "НастройкиОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПродажДляПользователей" 

	Дано Я открываю основную форму списка справочника "НастройкиПродажДляПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиПродажДляПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПродажДляПользователей"

	Дано Я открываю основную форму справочника "НастройкиПродажДляПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиПродажДляПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРМК" 

	Дано Я открываю основную форму списка справочника "НастройкиРМК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиРМК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРМК"

	Дано Я открываю основную форму справочника "НастройкиРМК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиРМК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСчетовУчетаПрочихОпераций" 

	Дано Я открываю основную форму списка справочника "НастройкиСчетовУчетаПрочихОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиСчетовУчетаПрочихОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСчетовУчетаПрочихОпераций"

	Дано Я открываю основную форму справочника "НастройкиСчетовУчетаПрочихОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиСчетовУчетаПрочихОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиФормированияПроводокМеждународногоУчета" 

	Дано Я открываю основную форму списка справочника "НастройкиФормированияПроводокМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиФормированияПроводокМеждународногоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиФормированияПроводокМеждународногоУчета"

	Дано Я открываю основную форму справочника "НастройкиФормированияПроводокМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиФормированияПроводокМеждународногоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиФормированияПроводокМеждународногоУчетаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НастройкиФормированияПроводокМеждународногоУчетаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиФормированияПроводокМеждународногоУчетаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиФормированияПроводокМеждународногоУчетаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НастройкиФормированияПроводокМеждународногоУчетаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиФормированияПроводокМеждународногоУчетаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиХозяйственныхОпераций" 

	Дано Я открываю основную форму списка справочника "НастройкиХозяйственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиХозяйственныхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиХозяйственныхОпераций"

	Дано Я открываю основную форму справочника "НастройкиХозяйственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиХозяйственныхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЭДО" 

	Дано Я открываю основную форму списка справочника "НастройкиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЭДО"

	Дано Я открываю основную форму справочника "НастройкиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЯндексКассы" 

	Дано Я открываю основную форму списка справочника "НастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЯндексКассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЯндексКассы"

	Дано Я открываю основную форму справочника "НастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЯндексКассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеЗарплатыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НачислениеЗарплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеЗарплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеЗарплатыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НачислениеЗарплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеЗарплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеПоДоговорамПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НачислениеПоДоговорамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеПоДоговорамПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеПоДоговорамПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НачислениеПоДоговорамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеПоДоговорамПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеСписаниеРезервовПоСомнительнымДолгамПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НачислениеСписаниеРезервовПоСомнительнымДолгамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеСписаниеРезервовПоСомнительнымДолгамПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеСписаниеРезервовПоСомнительнымДолгамПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НачислениеСписаниеРезервовПоСомнительнымДолгамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеСписаниеРезервовПоСомнительнымДолгамПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеСписаниеРезервовПредстоящихРасходовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НачислениеСписаниеРезервовПредстоящихРасходовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеСписаниеРезервовПредстоящихРасходовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеСписаниеРезервовПредстоящихРасходовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НачислениеСписаниеРезервовПредстоящихРасходовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НачислениеСписаниеРезервовПредстоящихРасходовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НематериальныеАктивы" 

	Дано Я открываю основную форму списка справочника "НематериальныеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НематериальныеАктивы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НематериальныеАктивы"

	Дано Я открываю основную форму справочника "НематериальныеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НематериальныеАктивы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НематериальныеАктивыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НематериальныеАктивыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НематериальныеАктивыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НематериальныеАктивыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НематериальныеАктивыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НематериальныеАктивыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НемонетарныеПоказатели" 

	Дано Я открываю основную форму списка справочника "НемонетарныеПоказатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НемонетарныеПоказатели"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НемонетарныеПоказатели"

	Дано Я открываю основную форму справочника "НемонетарныеПоказатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НемонетарныеПоказатели"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НефинансовыеПоказателиБюджетов" 

	Дано Я открываю основную форму списка справочника "НефинансовыеПоказателиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НефинансовыеПоказателиБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НефинансовыеПоказателиБюджетов"

	Дано Я открываю основную форму справочника "НефинансовыеПоказателиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НефинансовыеПоказателиБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Новости" 

	Дано Я открываю основную форму списка справочника "Новости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Новости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Новости"

	Дано Я открываю основную форму справочника "Новости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Новости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Номенклатура" 

	Дано Я открываю основную форму списка справочника "Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Номенклатура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Номенклатура"

	Дано Я открываю основную форму справочника "Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Номенклатура"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураКонтрагентов" 

	Дано Я открываю основную форму списка справочника "НоменклатураКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураКонтрагентов"

	Дано Я открываю основную форму справочника "НоменклатураКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураКонтрагентовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НоменклатураКонтрагентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураКонтрагентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураКонтрагентовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НоменклатураКонтрагентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураКонтрагентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НоменклатураПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НоменклатураПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НомераГТД" 

	Дано Я открываю основную форму списка справочника "НомераГТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НомераГТД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НомераГТД"

	Дано Я открываю основную форму справочника "НомераГТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НомераГТД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиХранения" 

	Дано Я открываю основную форму списка справочника "ОбластиХранения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбластиХранения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиХранения"

	Дано Я открываю основную форму справочника "ОбластиХранения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбластиХранения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиОчередиЗаданий" 

	Дано Я открываю основную форму списка справочника "ОбработчикиОчередиЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбработчикиОчередиЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиОчередиЗаданий"

	Дано Я открываю основную форму справочника "ОбработчикиОчередиЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбработчикиОчередиЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбразованиеФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ОбразованиеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбразованиеФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбразованиеФизическихЛиц"

	Дано Я открываю основную форму справочника "ОбразованиеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбразованиеФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщероссийскийКлассификаторОсновныхФондов" 

	Дано Я открываю основную форму списка справочника "ОбщероссийскийКлассификаторОсновныхФондов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщероссийскийКлассификаторОсновныхФондов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщероссийскийКлассификаторОсновныхФондов"

	Дано Я открываю основную форму справочника "ОбщероссийскийКлассификаторОсновныхФондов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщероссийскийКлассификаторОсновныхФондов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщероссийскийКлассификаторПродукции" 

	Дано Я открываю основную форму списка справочника "ОбщероссийскийКлассификаторПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщероссийскийКлассификаторПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщероссийскийКлассификаторПродукции"

	Дано Я открываю основную форму справочника "ОбщероссийскийКлассификаторПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщероссийскийКлассификаторПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеВидыРемонтов" 

	Дано Я открываю основную форму списка справочника "ОбщиеВидыРемонтов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВидыРемонтов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеВидыРемонтов"

	Дано Я открываю основную форму справочника "ОбщиеВидыРемонтов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВидыРемонтов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ОбщиеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ОбщиеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеДанныеИнформационногоЦентра" 

	Дано Я открываю основную форму списка справочника "ОбщиеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеДанныеИнформационногоЦентра"

	Дано Я открываю основную форму справочника "ОбщиеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыВозникновенияЗатрат" 

	Дано Я открываю основную форму списка справочника "ОбъектыВозникновенияЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыВозникновенияЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыВозникновенияЗатрат"

	Дано Я открываю основную форму справочника "ОбъектыВозникновенияЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыВозникновенияЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыРасчетов" 

	Дано Я открываю основную форму списка справочника "ОбъектыРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыРасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыРасчетов"

	Дано Я открываю основную форму справочника "ОбъектыРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыРасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыСтатистическогоНаблюдения" 

	Дано Я открываю основную форму списка справочника "ОбъектыСтатистическогоНаблюдения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыСтатистическогоНаблюдения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыСтатистическогоНаблюдения"

	Дано Я открываю основную форму справочника "ОбъектыСтатистическогоНаблюдения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыСтатистическогоНаблюдения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыСтроительства" 

	Дано Я открываю основную форму списка справочника "ОбъектыСтроительства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыСтроительства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыСтроительства"

	Дано Я открываю основную форму справочника "ОбъектыСтроительства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыСтроительства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыСтроительстваПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОбъектыСтроительстваПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыСтроительстваПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыСтроительстваПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОбъектыСтроительстваПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыСтроительстваПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыУчетаРезервовПредстоящихРасходов" 

	Дано Я открываю основную форму списка справочника "ОбъектыУчетаРезервовПредстоящихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыУчетаРезервовПредстоящихРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыУчетаРезервовПредстоящихРасходов"

	Дано Я открываю основную форму справочника "ОбъектыУчетаРезервовПредстоящихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыУчетаРезервовПредстоящихРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыЭксплуатации" 

	Дано Я открываю основную форму списка справочника "ОбъектыЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыЭксплуатации"

	Дано Я открываю основную форму справочника "ОбъектыЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыЭксплуатацииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОбъектыЭксплуатацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыЭксплуатацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыЭксплуатацииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОбъектыЭксплуатацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыЭксплуатацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОграничениеВзысканийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОграничениеВзысканийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОграничениеВзысканийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОграничениеВзысканийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОграничениеВзысканийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОграничениеВзысканийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписиВходящихДокументовИзНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "ОписиВходящихДокументовИзНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиВходящихДокументовИзНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписиВходящихДокументовИзНалоговыхОрганов"

	Дано Я открываю основную форму справочника "ОписиВходящихДокументовИзНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиВходящихДокументовИзНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписиИсходящихДокументовВНалоговыеОрганы" 

	Дано Я открываю основную форму списка справочника "ОписиИсходящихДокументовВНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиИсходящихДокументовВНалоговыеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписиИсходящихДокументовВНалоговыеОрганы"

	Дано Я открываю основную форму справочника "ОписиИсходящихДокументовВНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиИсходящихДокументовВНалоговыеОрганы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьОДВ_1ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОписьОДВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписьОДВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьОДВ_1ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОписьОДВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписьОДВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьПачекСЗВ_6ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОписьПачекСЗВ_6ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписьПачекСЗВ_6ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьПачекСЗВ_6ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОписьПачекСЗВ_6ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписьПачекСЗВ_6ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Организации" 

	Дано Я открываю основную форму списка справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Организации"

	Дано Я открываю основную форму справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганизацииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОрганизацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганизацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганизацииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОрганизацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганизацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганыПФР" 

	Дано Я открываю основную форму списка справочника "ОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганыПФР"

	Дано Я открываю основную форму справочника "ОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганыФСГС" 

	Дано Я открываю основную форму списка справочника "ОрганыФСГС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыФСГС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганыФСГС"

	Дано Я открываю основную форму справочника "ОрганыФСГС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыФСГС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияДосрочногоНазначенияПенсии" 

	Дано Я открываю основную форму списка справочника "ОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияДосрочногоНазначенияПенсии"

	Дано Я открываю основную форму справочника "ОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияДосрочногоНазначенияПенсииДляСЗВК" 

	Дано Я открываю основную форму списка справочника "ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияДосрочногоНазначенияПенсииДляСЗВК"

	Дано Я открываю основную форму справочника "ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияЗаключенияСрочныхТрудовыхДоговоров" 

	Дано Я открываю основную форму списка справочника "ОснованияЗаключенияСрочныхТрудовыхДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияЗаключенияСрочныхТрудовыхДоговоров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияЗаключенияСрочныхТрудовыхДоговоров"

	Дано Я открываю основную форму справочника "ОснованияЗаключенияСрочныхТрудовыхДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияЗаключенияСрочныхТрудовыхДоговоров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "ОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "ОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияУвольнения" 

	Дано Я открываю основную форму списка справочника "ОснованияУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияУвольнения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияУвольнения"

	Дано Я открываю основную форму справочника "ОснованияУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияУвольнения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияУвольненияПользовательские" 

	Дано Я открываю основную форму списка справочника "ОснованияУвольненияПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияУвольненияПользовательские"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияУвольненияПользовательские"

	Дано Я открываю основную форму справочника "ОснованияУвольненияПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияУвольненияПользовательские"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений" 

	Дано Я открываю основную форму списка справочника "ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"

	Дано Я открываю основную форму справочника "ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсобыеУсловияТрудаДляСЗВКПФР" 

	Дано Я открываю основную форму списка справочника "ОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсобыеУсловияТрудаДляСЗВКПФР"

	Дано Я открываю основную форму справочника "ОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсобыеУсловияТрудаПФР" 

	Дано Я открываю основную форму списка справочника "ОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсобыеУсловияТрудаПФР"

	Дано Я открываю основную форму справочника "ОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП" 

	Дано Я открываю основную форму списка справочника "ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП"

	Дано Я открываю основную форму справочника "ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветственныеЛицаОрганизаций" 

	Дано Я открываю основную форму списка справочника "ОтветственныеЛицаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтветственныеЛицаОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветственныеЛицаОрганизаций"

	Дано Я открываю основную форму справочника "ОтветственныеЛицаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтветственныеЛицаОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтгрузкаТоваровСХраненияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтгрузкаТоваровСХраненияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтгрузкаТоваровСХраненияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтгрузкаТоваровСХраненияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтгрузкаТоваровСХраненияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтгрузкаТоваровСХраненияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтгулПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтгулПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтгулПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтгулПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтгулПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтгулПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтгулСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтгулСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтгулСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтгулСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтгулСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтгулСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаСовмещенияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтменаСовмещенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтменаСовмещенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаСовмещенияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтменаСовмещенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтменаСовмещенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиМинобороны" 

	Дано Я открываю основную форму списка справочника "ОтправкиМинобороны"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиМинобороны"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиМинобороны"

	Дано Я открываю основную форму справочника "ОтправкиМинобороны"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиМинобороны"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиОтчетности" 

	Дано Я открываю основную форму списка справочника "ОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиОтчетности"

	Дано Я открываю основную форму справочника "ОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиРегистрацияЮЛ" 

	Дано Я открываю основную форму списка справочника "ОтправкиРегистрацияЮЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРегистрацияЮЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиРегистрацияЮЛ"

	Дано Я открываю основную форму справочника "ОтправкиРегистрацияЮЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРегистрацияЮЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиРегистрацияЮЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтправкиРегистрацияЮЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРегистрацияЮЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиРегистрацияЮЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтправкиРегистрацияЮЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРегистрацияЮЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиРПН" 

	Дано Я открываю основную форму списка справочника "ОтправкиРПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРПН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиРПН"

	Дано Я открываю основную форму справочника "ОтправкиРПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРПН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиРЭЦ" 

	Дано Я открываю основную форму списка справочника "ОтправкиРЭЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРЭЦ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиРЭЦ"

	Дано Я открываю основную форму справочника "ОтправкиРЭЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРЭЦ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиРЭЦПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтправкиРЭЦПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРЭЦПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиРЭЦПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтправкиРЭЦПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРЭЦПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиФСРАР" 

	Дано Я открываю основную форму списка справочника "ОтправкиФСРАР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСРАР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиФСРАР"

	Дано Я открываю основную форму справочника "ОтправкиФСРАР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСРАР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиФСС" 

	Дано Я открываю основную форму списка справочника "ОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиФСС"

	Дано Я открываю основную форму справочника "ОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиФТС" 

	Дано Я открываю основную форму списка справочника "ОтправкиФТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФТС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиФТС"

	Дано Я открываю основную форму справочника "ОтправкиФТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФТС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускаСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтпускаСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускаСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускаСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтпускаСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускаСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускБезСохраненияОплатыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтпускБезСохраненияОплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускБезСохраненияОплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускБезСохраненияОплатыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтпускБезСохраненияОплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускБезСохраненияОплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускБезСохраненияОплатыСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтпускБезСохраненияОплатыСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускБезСохраненияОплатыСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускБезСохраненияОплатыСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтпускБезСохраненияОплатыСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускБезСохраненияОплатыСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтпускПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтпускПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеЗарплатыВФинансовомУчете2_5ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтражениеЗарплатыВФинансовомУчете2_5ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтражениеЗарплатыВФинансовомУчете2_5ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеЗарплатыВФинансовомУчете2_5ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтражениеЗарплатыВФинансовомУчете2_5ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтражениеЗарплатыВФинансовомУчете2_5ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтраслиНауки" 

	Дано Я открываю основную форму списка справочника "ОтраслиНауки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтраслиНауки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтраслиНауки"

	Дано Я открываю основную форму справочника "ОтраслиНауки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтраслиНауки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетДавальцуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетДавальцуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетДавальцуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетДавальцуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетДавальцуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетДавальцуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомиссионераОСписанииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетКомиссионераОСписанииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомиссионераОСписанииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомиссионераОСписанииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетКомиссионераОСписанииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомиссионераОСписанииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомиссионераПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетКомиссионераПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомиссионераПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомиссионераПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетКомиссионераПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомиссионераПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитентуОЗакупкахПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетКомитентуОЗакупкахПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуОЗакупкахПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитентуОЗакупкахПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетКомитентуОЗакупкахПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуОЗакупкахПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитентуОСписанииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетКомитентуОСписанииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуОСписанииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитентуОСписанииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетКомитентуОСписанииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуОСписанииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитентуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетКомитентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитентуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетКомитентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетОператораСистемыПлатонПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетОператораСистемыПлатонПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетОператораСистемыПлатонПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетОператораСистемыПлатонПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетОператораСистемыПлатонПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетОператораСистемыПлатонПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетПереработчикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетПереработчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетПереработчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетПереработчикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетПереработчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетПереработчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаданий" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЗаданий"

	Дано Я открываю основную форму справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЭлектронныхЧековКОтправке" 

	Дано Я открываю основную форму списка справочника "ОчередьЭлектронныхЧековКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЭлектронныхЧековКОтправке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЭлектронныхЧековКОтправке"

	Дано Я открываю основную форму справочника "ОчередьЭлектронныхЧековКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЭлектронныхЧековКОтправке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетОбменСБанкамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПакетОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПакетОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетОбменСБанкамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПакетОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПакетОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПапкиФайлов" 

	Дано Я открываю основную форму списка справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПапкиФайлов"

	Дано Я открываю основную форму справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПапкиЭлектронныхПисем" 

	Дано Я открываю основную форму списка справочника "ПапкиЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПапкиЭлектронныхПисем"

	Дано Я открываю основную форму справочника "ПапкиЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "ПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "ПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыКонтекстныхФункциональныхОпций" 

	Дано Я открываю основную форму списка справочника "ПараметрыКонтекстныхФункциональныхОпций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыКонтекстныхФункциональныхОпций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыКонтекстныхФункциональныхОпций"

	Дано Я открываю основную форму справочника "ПараметрыКонтекстныхФункциональныхОпций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыКонтекстныхФункциональныхОпций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииПроизводства" 

	Дано Я открываю основную форму списка справочника "ПартииПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартииПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииПроизводства"

	Дано Я открываю основную форму справочника "ПартииПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартииПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка справочника "ПартииТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартииТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииТМЦВЭксплуатации"

	Дано Я открываю основную форму справочника "ПартииТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартииТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Партнеры" 

	Дано Я открываю основную форму списка справочника "Партнеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Партнеры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Партнеры"

	Дано Я открываю основную форму справочника "Партнеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Партнеры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартнерыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПартнерыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартнерыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартнерыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПартнерыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартнерыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Патенты" 

	Дано Я открываю основную форму списка справочника "Патенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Патенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Патенты"

	Дано Я открываю основную форму справочника "Патенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Патенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПатентыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПатентыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПатентыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПатентыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПатентыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПатентыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовАДВ_1ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовАДВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовАДВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовАДВ_1ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовАДВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовАДВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовАДВ_2ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовАДВ_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовАДВ_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовАДВ_2ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовАДВ_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовАДВ_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовАДВ_3ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовАДВ_3ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовАДВ_3ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовАДВ_3ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовАДВ_3ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовАДВ_3ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовДСВ_1ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовДСВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовДСВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовДСВ_1ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовДСВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовДСВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_1ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовСЗВ_6_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСЗВ_6_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_1ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовСЗВ_6_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСЗВ_6_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_3ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовСЗВ_6_3ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСЗВ_6_3ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_3ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовСЗВ_6_3ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСЗВ_6_3ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_4ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовСЗВ_6_4ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСЗВ_6_4ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_4ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовСЗВ_6_4ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСЗВ_6_4ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_КПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовСЗВ_КПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСЗВ_КПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_КПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовСЗВ_КПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСЗВ_КПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСПВ_1ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовСПВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСПВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСПВ_1ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовСПВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСПВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСПВ_2ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаДокументовСПВ_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСПВ_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСПВ_2ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаДокументовСПВ_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаДокументовСПВ_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаРазделов6РасчетаРСВ_1ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПачкаРазделов6РасчетаРСВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаРазделов6РасчетаРСВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаРазделов6РасчетаРСВ_1ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПачкаРазделов6РасчетаРСВ_1ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПачкаРазделов6РасчетаРСВ_1ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереводКДругомуРаботодателюПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПереводКДругомуРаботодателюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереводКДругомуРаботодателюПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереводКДругомуРаботодателюПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПереводКДругомуРаботодателюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереводКДругомуРаботодателюПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереводНаОплатуПоСреднемуЗаработкуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПереводНаОплатуПоСреднемуЗаработкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереводНаОплатуПоСреднемуЗаработкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереводНаОплатуПоСреднемуЗаработкуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПереводНаОплатуПоСреднемуЗаработкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереводНаОплатуПоСреднемуЗаработкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаДавальцуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПередачаДавальцуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаДавальцуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаДавальцуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПередачаДавальцуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаДавальцуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаМатериаловВПроизводствоПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПередачаМатериаловВПроизводствоПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаМатериаловВПроизводствоПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаМатериаловВПроизводствоПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПередачаМатериаловВПроизводствоПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаМатериаловВПроизводствоПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаСырьяПереработчикуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПередачаСырьяПереработчикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаСырьяПереработчикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаСырьяПереработчикуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПередачаСырьяПереработчикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаСырьяПереработчикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаТоваровХранителюПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПередачаТоваровХранителюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаТоваровХранителюПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаТоваровХранителюПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПередачаТоваровХранителюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаТоваровХранителюПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеМеждуТерриториямиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПеремещениеМеждуТерриториямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПеремещениеМеждуТерриториямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеМеждуТерриториямиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПеремещениеМеждуТерриториямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПеремещениеМеждуТерриториямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносДанныхПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПереносДанныхПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереносДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносДанныхПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПереносДанныхПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереносДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносОтпускаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПереносОтпускаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереносОтпускаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносОтпускаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПереносОтпускаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереносОтпускаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерепискаСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка справочника "ПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерепискаСКонтролирующимиОрганами"

	Дано Я открываю основную форму справочника "ПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерепискаСКонтролирующимиОрганамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПерепискаСКонтролирующимиОрганамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерепискаСКонтролирующимиОрганамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерепискаСКонтролирующимиОрганамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПерепискаСКонтролирующимиОрганамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерепискаСКонтролирующимиОрганамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетНДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПерерасчетНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерерасчетНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетНДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПерерасчетНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерерасчетНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетСтраховыхВзносовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПерерасчетСтраховыхВзносовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерерасчетСтраховыхВзносовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетСтраховыхВзносовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПерерасчетСтраховыхВзносовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерерасчетСтраховыхВзносовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереченьДолжностейДляБронированияГраждан" 

	Дано Я открываю основную форму списка справочника "ПереченьДолжностейДляБронированияГраждан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереченьДолжностейДляБронированияГраждан"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереченьДолжностейДляБронированияГраждан"

	Дано Я открываю основную форму справочника "ПереченьДолжностейДляБронированияГраждан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереченьДолжностейДляБронированияГраждан"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПисьмоОбменСБанкамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПисьмоОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПисьмоОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПисьмоОбменСБанкамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПисьмоОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПисьмоОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланВнутреннихПотребленийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланВнутреннихПотребленийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланВнутреннихПотребленийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланВнутреннихПотребленийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланВнутреннихПотребленийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланВнутреннихПотребленийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланЗакупокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланЗакупокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланЗакупокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланЗакупокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланЗакупокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланЗакупокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланОстатковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланОстатковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланОстатковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланОстатковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланОстатковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланОстатковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПродажПоКатегориямПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланПродажПоКатегориямПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПродажПоКатегориямПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПродажПоКатегориямПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланПродажПоКатегориямПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПродажПоКатегориямПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПродажПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланПродажПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПродажПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПродажПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланПродажПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПродажПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПроизводстваПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланПроизводстваПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПроизводстваПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПроизводстваПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланПроизводстваПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПроизводстваПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланСборкиРазборкиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланСборкиРазборкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланСборкиРазборкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланСборкиРазборкиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланСборкиРазборкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланСборкиРазборкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыСчетовМеждународногоУчета" 

	Дано Я открываю основную форму списка справочника "ПланыСчетовМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланыСчетовМеждународногоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыСчетовМеждународногоУчета"

	Дано Я открываю основную форму справочника "ПланыСчетовМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланыСчетовМеждународногоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодарочныеСертификаты" 

	Дано Я открываю основную форму списка справочника "ПодарочныеСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодарочныеСертификаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодарочныеСертификаты"

	Дано Я открываю основную форму справочника "ПодарочныеСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодарочныеСертификаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодклассыОбъектовЭксплуатации" 

	Дано Я открываю основную форму списка справочника "ПодклассыОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодклассыОбъектовЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодклассыОбъектовЭксплуатации"

	Дано Я открываю основную форму справочника "ПодклассыОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодклассыОбъектовЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодключаемоеОборудование" 

	Дано Я открываю основную форму списка справочника "ПодключаемоеОборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодключаемоеОборудование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодключаемоеОборудование"

	Дано Я открываю основную форму справочника "ПодключаемоеОборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодключаемоеОборудование"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодпискиНаРассылкиИОповещенияКлиентам" 

	Дано Я открываю основную форму списка справочника "ПодпискиНаРассылкиИОповещенияКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодпискиНаРассылкиИОповещенияКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодпискиНаРассылкиИОповещенияКлиентам"

	Дано Я открываю основную форму справочника "ПодпискиНаРассылкиИОповещенияКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодпискиНаРассылкиИОповещенияКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодразделенияОрганизаций" 

	Дано Я открываю основную форму списка справочника "ПодразделенияОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодразделенияОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодразделенияОрганизаций"

	Дано Я открываю основную форму справочника "ПодразделенияОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодразделенияОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоказателиБюджетов" 

	Дано Я открываю основную форму списка справочника "ПоказателиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоказателиБюджетов"

	Дано Я открываю основную форму справочника "ПоказателиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоказателиНаработки" 

	Дано Я открываю основную форму списка справочника "ПоказателиНаработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиНаработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоказателиНаработки"

	Дано Я открываю основную форму справочника "ПоказателиНаработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиНаработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоказателиПремирования" 

	Дано Я открываю основную форму списка справочника "ПоказателиПремирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиПремирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоказателиПремирования"

	Дано Я открываю основную форму справочника "ПоказателиПремирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиПремирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоказателиРасчетаЗарплаты" 

	Дано Я открываю основную форму списка справочника "ПоказателиРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоказателиРасчетаЗарплаты"

	Дано Я открываю основную форму справочника "ПоказателиРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПолитикиУчетаСерий" 

	Дано Я открываю основную форму списка справочника "ПолитикиУчетаСерий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолитикиУчетаСерий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПолитикиУчетаСерий"

	Дано Я открываю основную форму справочника "ПолитикиУчетаСерий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолитикиУчетаСерий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПолныеПутиКФормам" 

	Дано Я открываю основную форму списка справочника "ПолныеПутиКФормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолныеПутиКФормам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПолныеПутиКФормам"

	Дано Я открываю основную форму справочника "ПолныеПутиКФормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолныеПутиКФормам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Пользователи" 

	Дано Я открываю основную форму списка справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Пользователи"

	Дано Я открываю основную форму справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиВЕТИС" 

	Дано Я открываю основную форму списка справочника "ПользователиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиВЕТИС"

	Дано Я открываю основную форму справочника "ПользователиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиОтчетов" 

	Дано Я открываю основную форму списка справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиОтчетов"

	Дано Я открываю основную форму справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоляФормСтатистики" 

	Дано Я открываю основную форму списка справочника "ПоляФормСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоляФормСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоляФормСтатистики"

	Дано Я открываю основную форму справочника "ПоляФормСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоляФормСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДанные" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДанные"

	Дано Я открываю основную форму справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ПоставляемыеДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеРасширения" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеРасширения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеРасширения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеРасширения"

	Дано Я открываю основную форму справочника "ПоставляемыеРасширения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеРасширения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставщикиУслугСервиса" 

	Дано Я открываю основную форму списка справочника "ПоставщикиУслугСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставщикиУслугСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставщикиУслугСервиса"

	Дано Я открываю основную форму справочника "ПоставщикиУслугСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставщикиУслугСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеОтПереработчикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПоступлениеОтПереработчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеОтПереработчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеОтПереработчикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПоступлениеОтПереработчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеОтПереработчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеТоваровНаСкладПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПоступлениеТоваровНаСкладПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеТоваровНаСкладПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеТоваровНаСкладПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПоступлениеТоваровНаСкладПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеТоваровНаСкладПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеТоваровОтХранителяПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПоступлениеТоваровОтХранителяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеТоваровОтХранителяПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеТоваровОтХранителяПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПоступлениеТоваровОтХранителяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеТоваровОтХранителяПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеУслугПоАрендеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПоступлениеУслугПоАрендеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеУслугПоАрендеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеУслугПоАрендеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПоступлениеУслугПоАрендеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеУслугПоАрендеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаИнтеграцииС1СДокументооборотом" 

	Дано Я открываю основную форму списка справочника "ПравилаИнтеграцииС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаИнтеграцииС1СДокументооборотом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаИнтеграцииС1СДокументооборотом"

	Дано Я открываю основную форму справочника "ПравилаИнтеграцииС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаИнтеграцииС1СДокументооборотом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаЛимитовПоДаннымБюджетирования" 

	Дано Я открываю основную форму списка справочника "ПравилаЛимитовПоДаннымБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаЛимитовПоДаннымБюджетирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаЛимитовПоДаннымБюджетирования"

	Дано Я открываю основную форму справочника "ПравилаЛимитовПоДаннымБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаЛимитовПоДаннымБюджетирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаНачисленияИСписанияБонусныхБаллов" 

	Дано Я открываю основную форму списка справочника "ПравилаНачисленияИСписанияБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаНачисленияИСписанияБонусныхБаллов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаНачисленияИСписанияБонусныхБаллов"

	Дано Я открываю основную форму справочника "ПравилаНачисленияИСписанияБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаНачисленияИСписанияБонусныхБаллов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаОбменаСПодключаемымОборудованиемOffline" 

	Дано Я открываю основную форму списка справочника "ПравилаОбменаСПодключаемымОборудованиемOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбменаСПодключаемымОборудованиемOffline"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОбменаСПодключаемымОборудованиемOffline"

	Дано Я открываю основную форму справочника "ПравилаОбменаСПодключаемымОборудованиемOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбменаСПодключаемымОборудованиемOffline"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаОбработкиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "ПравилаОбработкиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОбработкиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "ПравилаОбработкиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаПолученияФактаПоПоказателямБюджетов" 

	Дано Я открываю основную форму списка справочника "ПравилаПолученияФактаПоПоказателямБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПолученияФактаПоПоказателямБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаПолученияФактаПоПоказателямБюджетов"

	Дано Я открываю основную форму справочника "ПравилаПолученияФактаПоПоказателямБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПолученияФактаПоПоказателямБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаПолученияФактаПоСтатьямБюджетов" 

	Дано Я открываю основную форму списка справочника "ПравилаПолученияФактаПоСтатьямБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПолученияФактаПоСтатьямБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаПолученияФактаПоСтатьямБюджетов"

	Дано Я открываю основную форму справочника "ПравилаПолученияФактаПоСтатьямБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПолученияФактаПоСтатьямБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаРаспределенияРасходов" 

	Дано Я открываю основную форму списка справочника "ПравилаРаспределенияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаРаспределенияРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаРаспределенияРасходов"

	Дано Я открываю основную форму справочника "ПравилаРаспределенияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаРаспределенияРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаФинОтчетности" 

	Дано Я открываю основную форму списка справочника "ПравилаФинОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаФинОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаФинОтчетности"

	Дано Я открываю основную форму справочника "ПравилаФинОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаФинОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаФормированияРезервовПодОбесценениеЗапасов" 

	Дано Я открываю основную форму списка справочника "ПравилаФормированияРезервовПодОбесценениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаФормированияРезервовПодОбесценениеЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаФормированияРезервовПодОбесценениеЗапасов"

	Дано Я открываю основную форму справочника "ПравилаФормированияРезервовПодОбесценениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаФормированияРезервовПодОбесценениеЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетов"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовРасширений" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовРасширений"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредприятияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ПредприятияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредприятияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредприятияВЕТИС"

	Дано Я открываю основную форму справочника "ПредприятияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредприятияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеПлановогоНачисленияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПрекращениеПлановогоНачисленияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрекращениеПлановогоНачисленияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеПлановогоНачисленияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПрекращениеПлановогоНачисленияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрекращениеПлановогоНачисленияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеПодработкиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПрекращениеПодработкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрекращениеПодработкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеПодработкиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПрекращениеПодработкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрекращениеПодработкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПремияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПремияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПремияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПремияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПремияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПремияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПретензииКлиентов" 

	Дано Я открываю основную форму списка справочника "ПретензииКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПретензииКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПретензииКлиентов"

	Дано Я открываю основную форму справочника "ПретензииКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПретензииКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПретензииКлиентовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПретензииКлиентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПретензииКлиентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПретензииКлиентовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПретензииКлиентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПретензииКлиентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемкаТоваровНаХранениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриемкаТоваровНаХранениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемкаТоваровНаХранениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемкаТоваровНаХранениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриемкаТоваровНаХранениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемкаТоваровНаХранениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриемНаРаботуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемНаРаботуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриемНаРаботуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемНаРаботуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботуСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриемНаРаботуСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемНаРаботуСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботуСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриемНаРаботуСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемНаРаботуСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПризПодарокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПризПодарокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПризПодарокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПризПодарокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПризПодарокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПризПодарокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеТоваровУслугПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриобретениеТоваровУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриобретениеТоваровУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеТоваровУслугПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриобретениеТоваровУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриобретениеТоваровУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Приоритеты" 

	Дано Я открываю основную форму списка справочника "Приоритеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Приоритеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Приоритеты"

	Дано Я открываю основную форму справочника "Приоритеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Приоритеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриоритетыОплаты" 

	Дано Я открываю основную форму списка справочника "ПриоритетыОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриоритетыОплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриоритетыОплаты"

	Дано Я открываю основную форму справочника "ПриоритетыОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриоритетыОплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныВозникновенияПретензий" 

	Дано Я открываю основную форму списка справочника "ПричиныВозникновенияПретензий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныВозникновенияПретензий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныВозникновенияПретензий"

	Дано Я открываю основную форму справочника "ПричиныВозникновенияПретензий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныВозникновенияПретензий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныЗадержкиВыполненияЭтаповПроизводства" 

	Дано Я открываю основную форму списка справочника "ПричиныЗадержкиВыполненияЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныЗадержкиВыполненияЭтаповПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныЗадержкиВыполненияЭтаповПроизводства"

	Дано Я открываю основную форму справочника "ПричиныЗадержкиВыполненияЭтаповПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныЗадержкиВыполненияЭтаповПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныНеудовлетворенияПервичногоСпроса" 

	Дано Я открываю основную форму списка справочника "ПричиныНеудовлетворенияПервичногоСпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныНеудовлетворенияПервичногоСпроса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныНеудовлетворенияПервичногоСпроса"

	Дано Я открываю основную форму справочника "ПричиныНеудовлетворенияПервичногоСпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныНеудовлетворенияПервичногоСпроса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныОтменыЗаказовКлиентов" 

	Дано Я открываю основную форму списка справочника "ПричиныОтменыЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказовКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныОтменыЗаказовКлиентов"

	Дано Я открываю основную форму справочника "ПричиныОтменыЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказовКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныОтменыЗаказовПоставщикам" 

	Дано Я открываю основную форму списка справочника "ПричиныОтменыЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказовПоставщикам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныОтменыЗаказовПоставщикам"

	Дано Я открываю основную форму справочника "ПричиныОтменыЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказовПоставщикам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныОтменыПроизводства" 

	Дано Я открываю основную форму списка справочника "ПричиныОтменыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныОтменыПроизводства"

	Дано Я открываю основную форму справочника "ПричиныОтменыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныПроигрышаСделок" 

	Дано Я открываю основную форму списка справочника "ПричиныПроигрышаСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныПроигрышаСделок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныПроигрышаСделок"

	Дано Я открываю основную форму справочника "ПричиныПроигрышаСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныПроигрышаСделок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныСписанияОС" 

	Дано Я открываю основную форму списка справочника "ПричиныСписанияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныСписанияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныСписанияОС"

	Дано Я открываю основную форму справочника "ПричиныСписанияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныСписанияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроверкиСостоянияСистемы" 

	Дано Я открываю основную форму списка справочника "ПроверкиСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроверкиСостоянияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроверкиСостоянияСистемы"

	Дано Я открываю основную форму справочника "ПроверкиСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроверкиСостоянияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрограммыЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрогулНеявкаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПрогулНеявкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрогулНеявкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрогулНеявкаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПрогулНеявкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрогулНеявкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрогулНеявкаСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПрогулНеявкаСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрогулНеявкаСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрогулНеявкаСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПрогулНеявкаСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрогулНеявкаСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПродлениеКонтрактаДоговораПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПродлениеКонтрактаДоговораПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПродлениеКонтрактаДоговораПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПродлениеКонтрактаДоговораПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПродлениеКонтрактаДоговораПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПродлениеКонтрактаДоговораПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПродукцияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ПродукцияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПродукцияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПродукцияВЕТИС"

	Дано Я открываю основную форму справочника "ПродукцияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПродукцияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Проекты" 

	Дано Я открываю основную форму списка справочника "Проекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Проекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Проекты"

	Дано Я открываю основную форму справочника "Проекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Проекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроектыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПроектыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроектыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроектыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПроектыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроектыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрожиточныеМинимумы" 

	Дано Я открываю основную форму списка справочника "ПрожиточныеМинимумы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрожиточныеМинимумы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрожиточныеМинимумы"

	Дано Я открываю основную форму справочника "ПрожиточныеМинимумы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрожиточныеМинимумы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Производители" 

	Дано Я открываю основную форму списка справочника "Производители"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Производители"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Производители"

	Дано Я открываю основную форму справочника "Производители"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Производители"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственнаяОперация2_2ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПроизводственнаяОперация2_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственнаяОперация2_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственнаяОперация2_2ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПроизводственнаяОперация2_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственнаяОперация2_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственныеКалендари" 

	Дано Я открываю основную форму списка справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственныеКалендари"

	Дано Я открываю основную форму справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственныеУчастки" 

	Дано Я открываю основную форму списка справочника "ПроизводственныеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеУчастки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственныеУчастки"

	Дано Я открываю основную форму справочника "ПроизводственныеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеУчастки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводствоБезЗаказаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПроизводствоБезЗаказаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводствоБезЗаказаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводствоБезЗаказаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПроизводствоБезЗаказаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводствоБезЗаказаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПростойСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПростойСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПростойСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПростойСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПростойСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПростойСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофессииРабочих" 

	Дано Я открываю основную форму списка справочника "ПрофессииРабочих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофессииРабочих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофессииРабочих"

	Дано Я открываю основную форму справочника "ПрофессииРабочих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофессииРабочих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиГруппДоступа" 

	Дано Я открываю основную форму списка справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиГруппДоступа"

	Дано Я открываю основную форму справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиКлючевыхОпераций" 

	Дано Я открываю основную форму списка справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиКлючевыхОпераций"

	Дано Я открываю основную форму справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеАктивыПассивы" 

	Дано Я открываю основную форму списка справочника "ПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеАктивыПассивы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеАктивыПассивы"

	Дано Я открываю основную форму справочника "ПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеАктивыПассивы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеДоходыРасходыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПрочиеДоходыРасходыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеДоходыРасходыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеДоходыРасходыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПрочиеДоходыРасходыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеДоходыРасходыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеРасходы" 

	Дано Я открываю основную форму списка справочника "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеРасходы"

	Дано Я открываю основную форму справочника "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаботаСверхурочноПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РаботаСверхурочноПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаботаСверхурочноПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаботаСверхурочноПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РаботаСверхурочноПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаботаСверхурочноПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Работодатели" 

	Дано Я открываю основную форму списка справочника "Работодатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Работодатели"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Работодатели"

	Дано Я открываю основную форму справочника "Работодатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Работодатели"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеМеста" 

	Дано Я открываю основную форму списка справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеМеста"

	Дано Я открываю основную форму справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеУчастки" 

	Дано Я открываю основную форму списка справочника "РабочиеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеУчастки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеУчастки"

	Дано Я открываю основную форму справочника "РабочиеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеУчастки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеЦентры" 

	Дано Я открываю основную форму списка справочника "РабочиеЦентры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеЦентры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеЦентры"

	Дано Я открываю основную форму справочника "РабочиеЦентры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеЦентры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазовоеНачислениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РазовоеНачислениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РазовоеНачислениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазовоеНачислениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РазовоеНачислениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РазовоеНачислениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрядыКатегорииДолжностей" 

	Дано Я открываю основную форму списка справочника "РазрядыКатегорииДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РазрядыКатегорииДолжностей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрядыКатегорииДолжностей"

	Дано Я открываю основную форму справочника "РазрядыКатегорииДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РазрядыКатегорииДолжностей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеВозвратныхОтходовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РаспределениеВозвратныхОтходовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаспределениеВозвратныхОтходовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеВозвратныхОтходовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РаспределениеВозвратныхОтходовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаспределениеВозвратныхОтходовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеОсновногоЗаработкаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РаспределениеОсновногоЗаработкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаспределениеОсновногоЗаработкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеОсновногоЗаработкаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РаспределениеОсновногоЗаработкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаспределениеОсновногоЗаработкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкаКлиентамПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РассылкаКлиентамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкаКлиентамПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкаКлиентамПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РассылкаКлиентамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкаКлиентамПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкиОтчетов" 

	Дано Я открываю основную форму списка справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкиОтчетов"

	Дано Я открываю основную форму справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияТоваровУслугПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РеализацияТоваровУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеализацияТоваровУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияТоваровУслугПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РеализацияТоваровУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеализацияТоваровУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияУслугПрочихАктивовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РеализацияУслугПрочихАктивовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеализацияУслугПрочихАктивовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияУслугПрочихАктивовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РеализацияУслугПрочихАктивовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеализацияУслугПрочихАктивовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацииВНалоговомОргане" 

	Дано Я открываю основную форму списка справочника "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацииВНалоговомОргане"

	Дано Я открываю основную форму справочника "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияПереработокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РегистрацияПереработокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияПереработокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияПереработокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РегистрацияПереработокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияПереработокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияПрочихДоходовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РегистрацияПрочихДоходовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияПрочихДоходовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияПрочихДоходовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РегистрацияПрочихДоходовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияПрочихДоходовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияТрудовойДеятельностиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РегистрацияТрудовойДеятельностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияТрудовойДеятельностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияТрудовойДеятельностиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РегистрацияТрудовойДеятельностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияТрудовойДеятельностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрУчетаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РегистрУчетаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрУчетаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрУчетаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РегистрУчетаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрУчетаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентированныеОтчеты" 

	Дано Я открываю основную форму списка справочника "РегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегламентированныеОтчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентированныеОтчеты"

	Дано Я открываю основную форму справочника "РегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегламентированныеОтчеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентированныйОтчетПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РегламентированныйОтчетПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегламентированныйОтчетПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентированныйОтчетПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РегламентированныйОтчетПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегламентированныйОтчетПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрДСВ_3ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РеестрДСВ_3ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрДСВ_3ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрДСВ_3ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РеестрДСВ_3ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрДСВ_3ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСЗВ_6_2ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РеестрСЗВ_6_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрСЗВ_6_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСЗВ_6_2ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РеестрСЗВ_6_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрСЗВ_6_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыРаботыСотрудников" 

	Дано Я открываю основную форму списка справочника "РежимыРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РежимыРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыРаботыСотрудников"

	Дано Я открываю основную форму справочника "РежимыРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РежимыРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Резервы" 

	Дано Я открываю основную форму списка справочника "Резервы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Резервы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Резервы"

	Дано Я открываю основную форму справочника "Резервы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Резервы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РейтингиПродажНоменклатуры" 

	Дано Я открываю основную форму списка справочника "РейтингиПродажНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РейтингиПродажНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РейтингиПродажНоменклатуры"

	Дано Я открываю основную форму справочника "РейтингиПродажНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РейтингиПродажНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РемонтныеМероприятия" 

	Дано Я открываю основную форму списка справочника "РемонтныеМероприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РемонтныеМероприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РемонтныеМероприятия"

	Дано Я открываю основную форму справочника "РемонтныеМероприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РемонтныеМероприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РесурсныеСпецификации" 

	Дано Я открываю основную форму списка справочника "РесурсныеСпецификации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РесурсныеСпецификации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РесурсныеСпецификации"

	Дано Я открываю основную форму справочника "РесурсныеСпецификации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РесурсныеСпецификации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РесурсныеСпецификацииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РесурсныеСпецификацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РесурсныеСпецификацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РесурсныеСпецификацииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РесурсныеСпецификацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РесурсныеСпецификацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РодственникиФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "РодственникиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РодственникиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РодственникиФизическихЛиц"

	Дано Я открываю основную форму справочника "РодственникиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РодственникиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиИсполнителей" 

	Дано Я открываю основную форму списка справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиИсполнителей"

	Дано Я открываю основную форму справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиКонтактныхЛицВСделкахИПроектах" 

	Дано Я открываю основную форму списка справочника "РолиКонтактныхЛицВСделкахИПроектах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛицВСделкахИПроектах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиКонтактныхЛицВСделкахИПроектах"

	Дано Я открываю основную форму справочника "РолиКонтактныхЛицВСделкахИПроектах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛицВСделкахИПроектах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиКонтактныхЛицПартнеров" 

	Дано Я открываю основную форму списка справочника "РолиКонтактныхЛицПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛицПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиКонтактныхЛицПартнеров"

	Дано Я открываю основную форму справочника "РолиКонтактныхЛицПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛицПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиПартнеровВСделкахИПроектах" 

	Дано Я открываю основную форму списка справочника "РолиПартнеровВСделкахИПроектах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиПартнеровВСделкахИПроектах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиПартнеровВСделкахИПроектах"

	Дано Я открываю основную форму справочника "РолиПартнеровВСделкахИПроектах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиПартнеровВСделкахИПроектах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Сайты" 

	Дано Я открываю основную форму списка справочника "Сайты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сайты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Сайты"

	Дано Я открываю основную форму справочника "Сайты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сайты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СамостоятельныеКлассификационныеЕдиницы" 

	Дано Я открываю основную форму списка справочника "СамостоятельныеКлассификационныеЕдиницы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СамостоятельныеКлассификационныеЕдиницы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СамостоятельныеКлассификационныеЕдиницы"

	Дано Я открываю основную форму справочника "СамостоятельныеКлассификационныеЕдиницы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СамостоятельныеКлассификационныеЕдиницы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СверкаВзаиморасчетовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СверкаВзаиморасчетовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СверкаВзаиморасчетовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СверкаВзаиморасчетовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СверкаВзаиморасчетовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СверкаВзаиморасчетовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СделкиСКлиентами" 

	Дано Я открываю основную форму списка справочника "СделкиСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СделкиСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СделкиСКлиентами"

	Дано Я открываю основную форму справочника "СделкиСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СделкиСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СделкиСКлиентамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СделкиСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СделкиСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СделкиСКлиентамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СделкиСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СделкиСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СеансыСвязиСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка справочника "СеансыСвязиСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СеансыСвязиСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СеансыСвязиСКонтролирующимиОрганами"

	Дано Я открываю основную форму справочника "СеансыСвязиСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СеансыСвязиСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СегментыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СегментыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СегментыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СегментыНоменклатуры"

	Дано Я открываю основную форму справочника "СегментыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СегментыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СегментыПартнеров" 

	Дано Я открываю основную форму списка справочника "СегментыПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СегментыПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СегментыПартнеров"

	Дано Я открываю основную форму справочника "СегментыПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СегментыПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СезонныеГруппы" 

	Дано Я открываю основную форму списка справочника "СезонныеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СезонныеГруппы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СезонныеГруппы"

	Дано Я открываю основную форму справочника "СезонныеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СезонныеГруппы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СезонныеГруппыБизнесРегионов" 

	Дано Я открываю основную форму списка справочника "СезонныеГруппыБизнесРегионов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СезонныеГруппыБизнесРегионов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СезонныеГруппыБизнесРегионов"

	Дано Я открываю основную форму справочника "СезонныеГруппыБизнесРегионов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СезонныеГруппыБизнесРегионов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СерверыДокументооборота" 

	Дано Я открываю основную форму списка справочника "СерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерверыДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СерверыДокументооборота"

	Дано Я открываю основную форму справочника "СерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерверыДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СервисПровайдерыСУЗ" 

	Дано Я открываю основную форму списка справочника "СервисПровайдерыСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СервисПровайдерыСУЗ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СервисПровайдерыСУЗ"

	Дано Я открываю основную форму справочника "СервисПровайдерыСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СервисПровайдерыСУЗ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СерииНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерииНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СерииНоменклатуры"

	Дано Я открываю основную форму справочника "СерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерииНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СерииНоменклатурыДляЦенообразования" 

	Дано Я открываю основную форму списка справочника "СерииНоменклатурыДляЦенообразования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерииНоменклатурыДляЦенообразования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СерииНоменклатурыДляЦенообразования"

	Дано Я открываю основную форму справочника "СерииНоменклатурыДляЦенообразования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерииНоменклатурыДляЦенообразования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыКлючейЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыКлючейЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СертификатыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыНоменклатуры"

	Дано Я открываю основную форму справочника "СертификатыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыНоменклатурыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СертификатыНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыНоменклатурыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СертификатыНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СканированныеДокументыДляПередачиВЭлектронномВиде" 

	Дано Я открываю основную форму списка справочника "СканированныеДокументыДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СканированныеДокументыДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СканированныеДокументыДляПередачиВЭлектронномВиде"

	Дано Я открываю основную форму справочника "СканированныеДокументыДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СканированныеДокументыДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СканированныеДокументыДляПередачиВЭлектронномВидеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СканированныеДокументыДляПередачиВЭлектронномВидеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СканированныеДокументыДляПередачиВЭлектронномВидеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СканированныеДокументыДляПередачиВЭлектронномВидеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СканированныеДокументыДляПередачиВЭлектронномВидеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СканированныеДокументыДляПередачиВЭлектронномВидеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкидкиНаценки" 

	Дано Я открываю основную форму списка справочника "СкидкиНаценки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкидкиНаценки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкидкиНаценки"

	Дано Я открываю основную форму справочника "СкидкиНаценки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкидкиНаценки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкладскиеГруппыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СкладскиеГруппыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеГруппыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкладскиеГруппыНоменклатуры"

	Дано Я открываю основную форму справочника "СкладскиеГруппыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеГруппыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкладскиеГруппыУпаковок" 

	Дано Я открываю основную форму списка справочника "СкладскиеГруппыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеГруппыУпаковок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкладскиеГруппыУпаковок"

	Дано Я открываю основную форму справочника "СкладскиеГруппыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеГруппыУпаковок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкладскиеПомещения" 

	Дано Я открываю основную форму списка справочника "СкладскиеПомещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеПомещения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкладскиеПомещения"

	Дано Я открываю основную форму справочника "СкладскиеПомещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеПомещения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкладскиеЯчейки" 

	Дано Я открываю основную форму списка справочника "СкладскиеЯчейки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеЯчейки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкладскиеЯчейки"

	Дано Я открываю основную форму справочника "СкладскиеЯчейки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеЯчейки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Склады" 

	Дано Я открываю основную форму списка справочника "Склады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Склады"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Склады"

	Дано Я открываю основную форму справочника "Склады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Склады"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СменноеЗаданиеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СменноеЗаданиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СменноеЗаданиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СменноеЗаданиеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СменноеЗаданиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СменноеЗаданиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СменыРаботыСотрудников" 

	Дано Я открываю основную форму списка справочника "СменыРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СменыРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СменыРаботыСотрудников"

	Дано Я открываю основную форму справочника "СменыРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СменыРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СобытияОС" 

	Дано Я открываю основную форму списка справочника "СобытияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СобытияОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СобытияОС"

	Дано Я открываю основную форму справочника "СобытияОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СобытияОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СобытияОтправкиОтчетности" 

	Дано Я открываю основную форму списка справочника "СобытияОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СобытияОтправкиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СобытияОтправкиОтчетности"

	Дано Я открываю основную форму справочника "СобытияОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СобытияОтправкиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СовмещениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СовмещениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СовмещениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СовмещениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СовмещениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СовмещениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоглашенияСКлиентами" 

	Дано Я открываю основную форму списка справочника "СоглашенияСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоглашенияСКлиентами"

	Дано Я открываю основную форму справочника "СоглашенияСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоглашенияСКлиентамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СоглашенияСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоглашенияСКлиентамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СоглашенияСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоглашенияСПоставщиками" 

	Дано Я открываю основную форму списка справочника "СоглашенияСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСПоставщиками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоглашенияСПоставщиками"

	Дано Я открываю основную форму справочника "СоглашенияСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСПоставщиками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоглашенияСПоставщикамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СоглашенияСПоставщикамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСПоставщикамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоглашенияСПоставщикамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СоглашенияСПоставщикамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСПоставщикамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеSMSПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СообщениеSMSПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеSMSПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СообщениеSMSПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеОбменСБанкамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СообщениеОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеОбменСБанкамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СообщениеОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеЭДОПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СообщениеЭДОПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеЭДОПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеЭДОПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СообщениеЭДОПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеЭДОПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбластейДанных" 

	Дано Я открываю основную форму списка справочника "СообщенияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбластейДанных"

	Дано Я открываю основную форму справочника "СообщенияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияСистемы" 

	Дано Я открываю основную форму списка справочника "СообщенияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияСистемы"

	Дано Я открываю основную форму справочника "СообщенияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствияОборотовМеждународногоУчета" 

	Дано Я открываю основную форму списка справочника "СоответствияОборотовМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоответствияОборотовМеждународногоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствияОборотовМеждународногоУчета"

	Дано Я открываю основную форму справочника "СоответствияОборотовМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоответствияОборотовМеждународногоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствияСчетовМеждународногоУчета" 

	Дано Я открываю основную форму списка справочника "СоответствияСчетовМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоответствияСчетовМеждународногоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствияСчетовМеждународногоУчета"

	Дано Я открываю основную форму справочника "СоответствияСчетовМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоответствияСчетовМеждународногоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставыВоеннослужащих" 

	Дано Я открываю основную форму списка справочника "СоставыВоеннослужащих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоставыВоеннослужащих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставыВоеннослужащих"

	Дано Я открываю основную форму справочника "СоставыВоеннослужащих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоставыВоеннослужащих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеВБраке" 

	Дано Я открываю основную форму списка справочника "СостояниеВБраке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостояниеВБраке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеВБраке"

	Дано Я открываю основную форму справочника "СостояниеВБраке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостояниеВБраке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОригиналовПервичныхДокументов" 

	Дано Я открываю основную форму списка справочника "СостоянияОригиналовПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияОригиналовПервичныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОригиналовПервичныхДокументов"

	Дано Я открываю основную форму справочника "СостоянияОригиналовПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияОригиналовПервичныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПроцессов" 

	Дано Я открываю основную форму списка справочника "СостоянияПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияПроцессов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПроцессов"

	Дано Я открываю основную форму справочника "СостоянияПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияПроцессов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Сотрудники" 

	Дано Я открываю основную форму списка справочника "Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сотрудники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Сотрудники"

	Дано Я открываю основную форму справочника "Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сотрудники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеЗадолженностиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СписаниеЗадолженностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеЗадолженностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеЗадолженностиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СписаниеЗадолженностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеЗадолженностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеТоваровУХранителяПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СписаниеТоваровУХранителяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеТоваровУХранителяПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеТоваровУХранителяПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СписаниеТоваровУХранителяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеТоваровУХранителяПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения" 

	Дано Я открываю основную форму списка справочника "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"

	Дано Я открываю основную форму справочника "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыВыплатыЗарплаты" 

	Дано Я открываю основную форму списка справочника "СпособыВыплатыЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыВыплатыЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыВыплатыЗарплаты"

	Дано Я открываю основную форму справочника "СпособыВыплатыЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыВыплатыЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыОбеспеченияПотребностей" 

	Дано Я открываю основную форму списка справочника "СпособыОбеспеченияПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОбеспеченияПотребностей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыОбеспеченияПотребностей"

	Дано Я открываю основную форму справочника "СпособыОбеспеченияПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОбеспеченияПотребностей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыОкругленияПриРасчетеЗарплаты" 

	Дано Я открываю основную форму списка справочника "СпособыОкругленияПриРасчетеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОкругленияПриРасчетеЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыОкругленияПриРасчетеЗарплаты"

	Дано Я открываю основную форму справочника "СпособыОкругленияПриРасчетеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОкругленияПриРасчетеЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыОпределенияЦенКонтролируемыхСделок" 

	Дано Я открываю основную форму списка справочника "СпособыОпределенияЦенКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОпределенияЦенКонтролируемыхСделок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыОпределенияЦенКонтролируемыхСделок"

	Дано Я открываю основную форму справочника "СпособыОпределенияЦенКонтролируемыхСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОпределенияЦенКонтролируемыхСделок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыОтраженияЗарплатыВБухУчете" 

	Дано Я открываю основную форму списка справочника "СпособыОтраженияЗарплатыВБухУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОтраженияЗарплатыВБухУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыОтраженияЗарплатыВБухУчете"

	Дано Я открываю основную форму справочника "СпособыОтраженияЗарплатыВБухУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОтраженияЗарплатыВБухУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыРаспределенияПоНаправлениямДеятельности" 

	Дано Я открываю основную форму списка справочника "СпособыРаспределенияПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыРаспределенияПоНаправлениямДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыРаспределенияПоНаправлениямДеятельности"

	Дано Я открываю основную форму справочника "СпособыРаспределенияПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыРаспределенияПоНаправлениямДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкаНДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СправкаНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкаНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкаНДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СправкаНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкаНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкаОПодтверждающихДокументахПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СправкаОПодтверждающихДокументахПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкаОПодтверждающихДокументахПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкаОПодтверждающихДокументахПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СправкаОПодтверждающихДокументахПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкаОПодтверждающихДокументахПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Справки1ЕГАИС" 

	Дано Я открываю основную форму списка справочника "Справки1ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки1ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Справки1ЕГАИС"

	Дано Я открываю основную форму справочника "Справки1ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки1ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Справки2ЕГАИС" 

	Дано Я открываю основную форму списка справочника "Справки2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки2ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Справки2ЕГАИС"

	Дано Я открываю основную форму справочника "Справки2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки2ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиСПАРКРискиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СправкиСПАРКРискиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиСПАРКРискиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиСПАРКРискиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СправкиСПАРКРискиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиСПАРКРискиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "СправкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиФизическихЛиц"

	Дано Я открываю основную форму справочника "СправкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиФизическихЛицПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СправкиФизическихЛицПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиФизическихЛицПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиФизическихЛицПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СправкиФизическихЛицПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиФизическихЛицПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкиНДС" 

	Дано Я открываю основную форму списка справочника "СтавкиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтавкиНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкиНДС"

	Дано Я открываю основную форму справочника "СтавкиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтавкиНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтанцииУправленияЗаказамиИСМП" 

	Дано Я открываю основную форму списка справочника "СтанцииУправленияЗаказамиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтанцииУправленияЗаказамиИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтанцииУправленияЗаказамиИСМП"

	Дано Я открываю основную форму справочника "СтанцииУправленияЗаказамиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтанцииУправленияЗаказамиИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистическиеПоказатели" 

	Дано Я открываю основную форму списка справочника "СтатистическиеПоказатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатистическиеПоказатели"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистическиеПоказатели"

	Дано Я открываю основную форму справочника "СтатистическиеПоказатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатистическиеПоказатели"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыНалогоплательщиковПоНДФЛ" 

	Дано Я открываю основную форму списка справочника "СтатусыНалогоплательщиковПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатусыНалогоплательщиковПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыНалогоплательщиковПоНДФЛ"

	Дано Я открываю основную форму справочника "СтатусыНалогоплательщиковПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатусыНалогоплательщиковПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиБюджетов" 

	Дано Я открываю основную форму списка справочника "СтатьиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиБюджетов"

	Дано Я открываю основную форму справочника "СтатьиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиДвиженияДенежныхСредств" 

	Дано Я открываю основную форму списка справочника "СтатьиДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиДвиженияДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиДвиженияДенежныхСредств"

	Дано Я открываю основную форму справочника "СтатьиДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиДвиженияДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиКалькуляции" 

	Дано Я открываю основную форму списка справочника "СтатьиКалькуляции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиКалькуляции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиКалькуляции"

	Дано Я открываю основную форму справочника "СтатьиКалькуляции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиКалькуляции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиРасходовЗарплата" 

	Дано Я открываю основную форму списка справочника "СтатьиРасходовЗарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиРасходовЗарплата"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиРасходовЗарплата"

	Дано Я открываю основную форму справочника "СтатьиРасходовЗарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиРасходовЗарплата"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиФинансированияЗарплата" 

	Дано Я открываю основную форму списка справочника "СтатьиФинансированияЗарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиФинансированияЗарплата"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиФинансированияЗарплата"

	Дано Я открываю основную форму справочника "СтатьиФинансированияЗарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиФинансированияЗарплата"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтепениЗнанияЯзыка" 

	Дано Я открываю основную форму списка справочника "СтепениЗнанияЯзыка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениЗнанияЯзыка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтепениЗнанияЯзыка"

	Дано Я открываю основную форму справочника "СтепениЗнанияЯзыка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениЗнанияЯзыка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтепениРодстваФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "СтепениРодстваФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениРодстваФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтепениРодстваФизическихЛиц"

	Дано Я открываю основную форму справочника "СтепениРодстваФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениРодстваФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СторнированиеНачисленийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СторнированиеНачисленийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СторнированиеНачисленийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СторнированиеНачисленийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СторнированиеНачисленийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СторнированиеНачисленийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СторноПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СторноПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СторноПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СторноПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СторноПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СторноПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраныМира" 

	Дано Я открываю основную форму списка справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраныМира"

	Дано Я открываю основную форму справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы" 

	Дано Я открываю основную форму списка справочника "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"

	Дано Я открываю основную форму справочника "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов" 

	Дано Я открываю основную форму списка справочника "СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"

	Дано Я открываю основную форму справочника "СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтроковыеКонтактыВзаимодействий" 

	Дано Я открываю основную форму списка справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтроковыеКонтактыВзаимодействий"

	Дано Я открываю основную форму справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтруктураПредприятия" 

	Дано Я открываю основную форму списка справочника "СтруктураПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураПредприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтруктураПредприятия"

	Дано Я открываю основную форму справочника "СтруктураПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураПредприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтруктураЦелей" 

	Дано Я открываю основную форму списка справочника "СтруктураЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураЦелей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтруктураЦелей"

	Дано Я открываю основную форму справочника "СтруктураЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураЦелей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Субконто" 

	Дано Я открываю основную форму списка справочника "Субконто"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Субконто"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Субконто"

	Дано Я открываю основную форму справочника "Субконто"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Субконто"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СхемыОбеспечения" 

	Дано Я открываю основную форму списка справочника "СхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СхемыОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СхемыОбеспечения"

	Дано Я открываю основную форму справочника "СхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СхемыОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Сценарии" 

	Дано Я открываю основную форму списка справочника "Сценарии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сценарии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Сценарии"

	Дано Я открываю основную форму справочника "Сценарии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сценарии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииОбменовДанными" 

	Дано Я открываю основную форму списка справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СценарииОбменовДанными"

	Дано Я открываю основную форму справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииПооперационногоПланирования" 

	Дано Я открываю основную форму списка справочника "СценарииПооперационногоПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииПооперационногоПланирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СценарииПооперационногоПланирования"

	Дано Я открываю основную форму справочника "СценарииПооперационногоПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииПооперационногоПланирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииТоварногоПланирования" 

	Дано Я открываю основную форму списка справочника "СценарииТоварногоПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииТоварногоПланирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СценарииТоварногоПланирования"

	Дано Я открываю основную форму справочника "СценарииТоварногоПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииТоварногоПланирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетНаОплатуКлиентуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетНаОплатуКлиентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетНаОплатуКлиентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетНаОплатуКлиентуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетНаОплатуКлиентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетНаОплатуКлиентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданныйАвансПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураВыданныйАвансПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураВыданныйАвансПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданныйАвансПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураВыданныйАвансПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураВыданныйАвансПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданныйПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураВыданныйПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураВыданныйПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданныйПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураВыданныйПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураВыданныйПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураКомиссионеруПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураКомиссионеруПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураКомиссионеруПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураКомиссионеруПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураКомиссионеруПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураКомиссионеруПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураКомитентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураКомитентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураКомитентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураКомитентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураКомитентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураКомитентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйАвансПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураПолученныйАвансПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйАвансПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйАвансПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураПолученныйАвансПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйАвансПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураПолученныйПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураПолученныйПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТабельУчетаРабочегоВремениПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТабельУчетаРабочегоВремениПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТабельУчетаРабочегоВремениПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТабельУчетаРабочегоВремениПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТабельУчетаРабочегоВремениПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТабельУчетаРабочегоВремениПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаможеннаяДекларацияИмпортПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаможеннаяДекларацияЭкспортПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТаможеннаяДекларацияЭкспортПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТаможеннаяДекларацияЭкспортПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаможеннаяДекларацияЭкспортПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТаможеннаяДекларацияЭкспортПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТаможеннаяДекларацияЭкспортПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифныеСетки" 

	Дано Я открываю основную форму списка справочника "ТарифныеСетки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифныеСетки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифныеСетки"

	Дано Я открываю основную форму справочника "ТарифныеСетки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифныеСетки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифыПлатежныхАгентов" 

	Дано Я открываю основную форму списка справочника "ТарифыПлатежныхАгентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифыПлатежныхАгентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифыПлатежныхАгентов"

	Дано Я открываю основную форму справочника "ТарифыПлатежныхАгентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифыПлатежныхАгентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелефонныйЗвонокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелефонныйЗвонокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТемыЭтапыИсследованийИРазработок" 

	Дано Я открываю основную форму списка справочника "ТемыЭтапыИсследованийИРазработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТемыЭтапыИсследованийИРазработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТемыЭтапыИсследованийИРазработок"

	Дано Я открываю основную форму справочника "ТемыЭтапыИсследованийИРазработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТемыЭтапыИсследованийИРазработок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТемыЭтапыИсследованийИРазработокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТемыЭтапыИсследованийИРазработокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТемыЭтапыИсследованийИРазработокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТемыЭтапыИсследованийИРазработокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТемыЭтапыИсследованийИРазработокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТемыЭтапыИсследованийИРазработокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриториальныеУсловияПФР" 

	Дано Я открываю основную форму списка справочника "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриториальныеУсловияПФР"

	Дано Я открываю основную форму справочника "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииВыполненияРабот" 

	Дано Я открываю основную форму списка справочника "ТерриторииВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриторииВыполненияРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииВыполненияРабот"

	Дано Я открываю основную форму справочника "ТерриторииВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриторииВыполненияРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииОсуществленияТорговойДеятельности" 

	Дано Я открываю основную форму списка справочника "ТерриторииОсуществленияТорговойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриторииОсуществленияТорговойДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииОсуществленияТорговойДеятельности"

	Дано Я открываю основную форму справочника "ТерриторииОсуществленияТорговойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриторииОсуществленияТорговойДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииСПовышающимКоэффициентомПоКоронавирусу" 

	Дано Я открываю основную форму списка справочника "ТерриторииСПовышающимКоэффициентомПоКоронавирусу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриторииСПовышающимКоэффициентомПоКоронавирусу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииСПовышающимКоэффициентомПоКоронавирусу"

	Дано Я открываю основную форму справочника "ТерриторииСПовышающимКоэффициентомПоКоронавирусу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриторииСПовышающимКоэффициентомПоКоронавирусу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТехнологическиеОперации" 

	Дано Я открываю основную форму списка справочника "ТехнологическиеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТехнологическиеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТехнологическиеОперации"

	Дано Я открываю основную форму справочника "ТехнологическиеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТехнологическиеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТехнологическиеОперацииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТехнологическиеОперацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТехнологическиеОперацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТехнологическиеОперацииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТехнологическиеОперацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТехнологическиеОперацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТехнологическиеПроцессы" 

	Дано Я открываю основную форму списка справочника "ТехнологическиеПроцессы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТехнологическиеПроцессы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТехнологическиеПроцессы"

	Дано Я открываю основную форму справочника "ТехнологическиеПроцессы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТехнологическиеПроцессы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТехнологическиеПроцессыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТехнологическиеПроцессыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТехнологическиеПроцессыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТехнологическиеПроцессыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТехнологическиеПроцессыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТехнологическиеПроцессыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТиповыеОперацииМеждународныйУчет" 

	Дано Я открываю основную форму списка справочника "ТиповыеОперацииМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТиповыеОперацииМеждународныйУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТиповыеОперацииМеждународныйУчет"

	Дано Я открываю основную форму справочника "ТиповыеОперацииМеждународныйУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТиповыеОперацииМеждународныйУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипоразмерыУпаковок" 

	Дано Я открываю основную форму списка справочника "ТипоразмерыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипоразмерыУпаковок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипоразмерыУпаковок"

	Дано Я открываю основную форму справочника "ТипоразмерыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипоразмерыУпаковок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипоразмерыЯчеек" 

	Дано Я открываю основную форму списка справочника "ТипоразмерыЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипоразмерыЯчеек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипоразмерыЯчеек"

	Дано Я открываю основную форму справочника "ТипоразмерыЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипоразмерыЯчеек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыДокументов" 

	Дано Я открываю основную форму списка справочника "ТипыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыДокументов"

	Дано Я открываю основную форму справочника "ТипыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыИнформацииИнформационногоЦентра" 

	Дано Я открываю основную форму списка справочника "ТипыИнформацииИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыИнформацииИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыИнформацииИнформационногоЦентра"

	Дано Я открываю основную форму справочника "ТипыИнформацииИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыИнформацииИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыПисемОбменСБанками" 

	Дано Я открываю основную форму списка справочника "ТипыПисемОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыПисемОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыПисемОбменСБанками"

	Дано Я открываю основную форму справочника "ТипыПисемОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыПисемОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыПлатежейФЗ275" 

	Дано Я открываю основную форму списка справочника "ТипыПлатежейФЗ275"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыПлатежейФЗ275"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыПлатежейФЗ275"

	Дано Я открываю основную форму справочника "ТипыПлатежейФЗ275"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыПлатежейФЗ275"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыСобытийСПАРКРиски" 

	Дано Я открываю основную форму списка справочника "ТипыСобытийСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыСобытийСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыСобытийСПАРКРиски"

	Дано Я открываю основную форму справочника "ТипыСобытийСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыСобытийСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыТранспортныхСредств" 

	Дано Я открываю основную форму списка справочника "ТипыТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыТранспортныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыТранспортныхСредств"

	Дано Я открываю основную форму справочника "ТипыТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыТранспортныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварныеКатегории" 

	Дано Я открываю основную форму списка справочника "ТоварныеКатегории"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТоварныеКатегории"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварныеКатегории"

	Дано Я открываю основную форму справочника "ТоварныеКатегории"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТоварныеКатегории"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТомаХраненияФайлов" 

	Дано Я открываю основную форму списка справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТомаХраненияФайлов"

	Дано Я открываю основную форму справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТорговыеТочки" 

	Дано Я открываю основную форму списка справочника "ТорговыеТочки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТорговыеТочки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТорговыеТочки"

	Дано Я открываю основную форму справочника "ТорговыеТочки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТорговыеТочки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранзакцииОбменаСБанками" 

	Дано Я открываю основную форму списка справочника "ТранзакцииОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранзакцииОбменаСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранзакцииОбменаСБанками"

	Дано Я открываю основную форму справочника "ТранзакцииОбменаСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранзакцииОбменаСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранзакцииОбменаСБанкамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТранзакцииОбменаСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранзакцииОбменаСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранзакцииОбменаСБанкамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТранзакцииОбменаСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранзакцииОбменаСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранзакцииОбменаСБанкамиСодержимоеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТранзакцииОбменаСБанкамиСодержимоеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранзакцииОбменаСБанкамиСодержимоеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранзакцииОбменаСБанкамиСодержимоеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТранзакцииОбменаСБанкамиСодержимоеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранзакцииОбменаСБанкамиСодержимоеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортнаяНакладнаяПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТранспортнаяНакладнаяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортнаяНакладнаяПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортнаяНакладнаяПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТранспортнаяНакладнаяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортнаяНакладнаяПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортноеСообщениеКонтейнерыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТранспортноеСообщениеКонтейнерыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортноеСообщениеКонтейнерыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортноеСообщениеКонтейнерыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТранспортноеСообщениеКонтейнерыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортноеСообщениеКонтейнерыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортноеСообщениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТранспортноеСообщениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортноеСообщениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортноеСообщениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТранспортноеСообщениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортноеСообщениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортныеСредства" 

	Дано Я открываю основную форму списка справочника "ТранспортныеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортныеСредства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортныеСредства"

	Дано Я открываю основную форму справочника "ТранспортныеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортныеСредства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортныйКонтейнерЭДОПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТранспортныйКонтейнерЭДОПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортныйКонтейнерЭДОПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортныйКонтейнерЭДОПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТранспортныйКонтейнерЭДОПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортныйКонтейнерЭДОПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТрудовыеФункции" 

	Дано Я открываю основную форму списка справочника "ТрудовыеФункции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТрудовыеФункции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТрудовыеФункции"

	Дано Я открываю основную форму справочника "ТрудовыеФункции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТрудовыеФункции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УбыткиПрошлыхЛет" 

	Дано Я открываю основную форму списка справочника "УбыткиПрошлыхЛет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УбыткиПрошлыхЛет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УбыткиПрошлыхЛет"

	Дано Я открываю основную форму справочника "УбыткиПрошлыхЛет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УбыткиПрошлыхЛет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОСпецрежимахНалогообложенияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УведомлениеОСпецрежимахНалогообложенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УведомлениеОСпецрежимахНалогообложенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОСпецрежимахНалогообложенияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УведомлениеОСпецрежимахНалогообложенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УведомлениеОСпецрежимахНалогообложенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УвольнениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УвольнениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УвольнениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УвольнениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УвольнениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УвольнениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УвольнениеСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УвольнениеСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УвольнениеСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УвольнениеСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УвольнениеСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УвольнениеСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВариантыГрафиковЛизинга" 

	Дано Я открываю основную форму списка справочника "УдалитьВариантыГрафиковЛизинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВариантыГрафиковЛизинга"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВариантыГрафиковЛизинга"

	Дано Я открываю основную форму справочника "УдалитьВариантыГрафиковЛизинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВариантыГрафиковЛизинга"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыВычетовНДФЛ" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыВычетовНДФЛ"

	Дано Я открываю основную форму справочника "УдалитьВидыВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыВычетовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыДоходовНДФЛ" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыДоходовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыДоходовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыДоходовНДФЛ"

	Дано Я открываю основную форму справочника "УдалитьВидыДоходовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыДоходовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыДоходовПоСтраховымВзносам" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыДоходовПоСтраховымВзносам"

	Дано Я открываю основную форму справочника "УдалитьВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыНалоговыхОрганов"

	Дано Я открываю основную форму справочника "УдалитьВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыОбщественноПолезнойДеятельностиСЗВК" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"

	Дано Я открываю основную форму справочника "УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыОбъектовЕГАИС" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыОбъектовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбъектовЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыОбъектовЕГАИС"

	Дано Я открываю основную форму справочника "УдалитьВидыОбъектовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбъектовЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыОтправляемыхДокументов" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыОтправляемыхДокументов"

	Дано Я открываю основную форму справочника "УдалитьВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьГосударственныеКонтрактыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УдалитьГосударственныеКонтрактыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьГосударственныеКонтрактыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьГосударственныеКонтрактыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УдалитьГосударственныеКонтрактыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьГосударственныеКонтрактыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"

	Дано Я открываю основную форму справочника "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКлассификаторВидовПредпринимательскойДеятельностиПСН" 

	Дано Я открываю основную форму списка справочника "УдалитьКлассификаторВидовПредпринимательскойДеятельностиПСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКлассификаторВидовПредпринимательскойДеятельностиПСН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКлассификаторВидовПредпринимательскойДеятельностиПСН"

	Дано Я открываю основную форму справочника "УдалитьКлассификаторВидовПредпринимательскойДеятельностиПСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКлассификаторВидовПредпринимательскойДеятельностиПСН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКлючиАналитикиУчетаПартийПроизводства" 

	Дано Я открываю основную форму списка справочника "УдалитьКлючиАналитикиУчетаПартийПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКлючиАналитикиУчетаПартийПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКлючиАналитикиУчетаПартийПроизводства"

	Дано Я открываю основную форму справочника "УдалитьКлючиАналитикиУчетаПартийПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКлючиАналитикиУчетаПартийПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк" 

	Дано Я открываю основную форму списка справочника "УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"

	Дано Я открываю основную форму справочника "УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНалоговыеОрганы" 

	Дано Я открываю основную форму списка справочника "УдалитьНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНалоговыеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНалоговыеОрганы"

	Дано Я открываю основную форму справочника "УдалитьНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНалоговыеОрганы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиЯндексКассы" 

	Дано Я открываю основную форму списка справочника "УдалитьНастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНастройкиЯндексКассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиЯндексКассы"

	Дано Я открываю основную форму справочника "УдалитьНастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНастройкиЯндексКассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОрганыПФР" 

	Дано Я открываю основную форму списка справочника "УдалитьОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОрганыПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОрганыПФР"

	Дано Я открываю основную форму справочника "УдалитьОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОрганыПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОснованияДосрочногоНазначенияПенсии" 

	Дано Я открываю основную форму списка справочника "УдалитьОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОснованияДосрочногоНазначенияПенсии"

	Дано Я открываю основную форму справочника "УдалитьОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК" 

	Дано Я открываю основную форму списка справочника "УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"

	Дано Я открываю основную форму справочника "УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОснованияИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "УдалитьОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОснованияИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "УдалитьОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОснованияУвольнения" 

	Дано Я открываю основную форму списка справочника "УдалитьОснованияУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияУвольнения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОснованияУвольнения"

	Дано Я открываю основную форму справочника "УдалитьОснованияУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияУвольнения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОсобыеУсловияТрудаДляСЗВКПФР" 

	Дано Я открываю основную форму списка справочника "УдалитьОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОсобыеУсловияТрудаДляСЗВКПФР"

	Дано Я открываю основную форму справочника "УдалитьОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОсобыеУсловияТрудаПФР" 

	Дано Я открываю основную форму списка справочника "УдалитьОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОсобыеУсловияТрудаПФР"

	Дано Я открываю основную форму справочника "УдалитьОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОтправкиФСС" 

	Дано Я открываю основную форму списка справочника "УдалитьОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОтправкиФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОтправкиФСС"

	Дано Я открываю основную форму справочника "УдалитьОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОтправкиФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОчередьЗаданий" 

	Дано Я открываю основную форму списка справочника "УдалитьОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОчередьЗаданий"

	Дано Я открываю основную форму справочника "УдалитьОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОчередьЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПараметрыИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "УдалитьПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПараметрыИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "УдалитьПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПерепискаСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка справочника "УдалитьПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПерепискаСКонтролирующимиОрганами"

	Дано Я открываю основную форму справочника "УдалитьПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПрофилиНастроекЭДО" 

	Дано Я открываю основную форму списка справочника "УдалитьПрофилиНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПрофилиНастроекЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПрофилиНастроекЭДО"

	Дано Я открываю основную форму справочника "УдалитьПрофилиНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПрофилиНастроекЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРегламентированныеОтчеты" 

	Дано Я открываю основную форму списка справочника "УдалитьРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьРегламентированныеОтчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРегламентированныеОтчеты"

	Дано Я открываю основную форму справочника "УдалитьРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьРегламентированныеОтчеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСерверыДокументооборота" 

	Дано Я открываю основную форму списка справочника "УдалитьСерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСерверыДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСерверыДокументооборота"

	Дано Я открываю основную форму справочника "УдалитьСерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСерверыДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСертификатыЭП" 

	Дано Я открываю основную форму списка справочника "УдалитьСертификатыЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСертификатыЭП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСертификатыЭП"

	Дано Я открываю основную форму справочника "УдалитьСертификатыЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСертификатыЭП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСоглашенияОбИспользованииЭД" 

	Дано Я открываю основную форму списка справочника "УдалитьСоглашенияОбИспользованииЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСоглашенияОбИспользованииЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСоглашенияОбИспользованииЭД"

	Дано Я открываю основную форму справочника "УдалитьСоглашенияОбИспользованииЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСоглашенияОбИспользованииЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьТерриториальныеУсловияПФР" 

	Дано Я открываю основную форму списка справочника "УдалитьТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьТерриториальныеУсловияПФР"

	Дано Я открываю основную форму справочника "УдалитьТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьУчетныеЗаписиДокументооборота" 

	Дано Я открываю основную форму списка справочника "УдалитьУчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьУчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьУчетныеЗаписиДокументооборота"

	Дано Я открываю основную форму справочника "УдалитьУчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьУчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьУчетныеПолитикиОрганизаций" 

	Дано Я открываю основную форму списка справочника "УдалитьУчетныеПолитикиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьУчетныеПолитикиОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьУчетныеПолитикиОрганизаций"

	Дано Я открываю основную форму справочника "УдалитьУчетныеПолитикиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьУчетныеПолитикиОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка справочника "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"

	Дано Я открываю основную форму справочника "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УзлыОбъектовЭксплуатации" 

	Дано Я открываю основную форму списка справочника "УзлыОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УзлыОбъектовЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УзлыОбъектовЭксплуатации"

	Дано Я открываю основную форму справочника "УзлыОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УзлыОбъектовЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УзлыОбъектовЭксплуатацииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УзлыОбъектовЭксплуатацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УзлыОбъектовЭксплуатацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УзлыОбъектовЭксплуатацииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УзлыОбъектовЭксплуатацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УзлыОбъектовЭксплуатацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УпаковкиВЕТИС" 

	Дано Я открываю основную форму списка справочника "УпаковкиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УпаковкиВЕТИС"

	Дано Я открываю основную форму справочника "УпаковкиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УпаковкиЕдиницыИзмерения" 

	Дано Я открываю основную форму списка справочника "УпаковкиЕдиницыИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиЕдиницыИзмерения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УпаковкиЕдиницыИзмерения"

	Дано Я открываю основную форму справочника "УпаковкиЕдиницыИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиЕдиницыИзмерения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияОбслуживанияПартнеровТорговымиПредставителями" 

	Дано Я открываю основную форму списка справочника "УсловияОбслуживанияПартнеровТорговымиПредставителями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияОбслуживанияПартнеровТорговымиПредставителями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияОбслуживанияПартнеровТорговымиПредставителями"

	Дано Я открываю основную форму справочника "УсловияОбслуживанияПартнеровТорговымиПредставителями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияОбслуживанияПартнеровТорговымиПредставителями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияПредоставленияСкидокНаценок" 

	Дано Я открываю основную форму списка справочника "УсловияПредоставленияСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияПредоставленияСкидокНаценок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияПредоставленияСкидокНаценок"

	Дано Я открываю основную форму справочника "УсловияПредоставленияСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияПредоставленияСкидокНаценок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияРегионализацииВЕТИС" 

	Дано Я открываю основную форму списка справочника "УсловияРегионализацииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияРегионализацииВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияРегионализацииВЕТИС"

	Дано Я открываю основную форму справочника "УсловияРегионализацииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияРегионализацииВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияТруда" 

	Дано Я открываю основную форму списка справочника "УсловияТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияТруда"

	Дано Я открываю основную форму справочника "УсловияТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УслугиБанков" 

	Дано Я открываю основную форму списка справочника "УслугиБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УслугиБанков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УслугиБанков"

	Дано Я открываю основную форму справочника "УслугиБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УслугиБанков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УслугиСервиса" 

	Дано Я открываю основную форму списка справочника "УслугиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УслугиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УслугиСервиса"

	Дано Я открываю основную форму справочника "УслугиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УслугиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаЦенНоменклатурыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УстановкаЦенНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УстановкаЦенНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаЦенНоменклатурыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УстановкаЦенНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УстановкаЦенНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УтверждениеТарифнойСеткиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УтверждениеТарифнойСеткиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УтверждениеТарифнойСеткиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УтверждениеТарифнойСеткиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УтверждениеТарифнойСеткиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УтверждениеТарифнойСеткиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УтверждениеШтатногоРасписанияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УтверждениеШтатногоРасписанияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УтверждениеШтатногоРасписанияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УтверждениеШтатногоРасписанияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УтверждениеШтатногоРасписанияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УтверждениеШтатногоРасписанияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчебныеЗаведения" 

	Дано Я открываю основную форму списка справочника "УчебныеЗаведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчебныеЗаведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчебныеЗаведения"

	Дано Я открываю основную форму справочника "УчебныеЗаведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчебныеЗаведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УченыеЗвания" 

	Дано Я открываю основную форму списка справочника "УченыеЗвания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченыеЗвания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченыеЗвания"

	Дано Я открываю основную форму справочника "УченыеЗвания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченыеЗвания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УченыеСтепени" 

	Дано Я открываю основную форму списка справочника "УченыеСтепени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченыеСтепени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченыеСтепени"

	Дано Я открываю основную форму справочника "УченыеСтепени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченыеСтепени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиDSS" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиDSS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиDSS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиDSS"

	Дано Я открываю основную форму справочника "УчетныеЗаписиDSS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиDSS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиДокументооборота" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиДокументооборота"

	Дано Я открываю основную форму справочника "УчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиСинхронизацииФайлов"

	Дано Я открываю основную форму справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Файлы" 

	Дано Я открываю основную форму списка справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Файлы"

	Дано Я открываю основную форму справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛица" 

	Дано Я открываю основную форму списка справочника "ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛица"

	Дано Я открываю основную форму справочника "ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛицаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ФизическиеЛицаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛицаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛицаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ФизическиеЛицаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛицаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФинОтчетВБанкПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ФинОтчетВБанкПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФинОтчетВБанкПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФинОтчетВБанкПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ФинОтчетВБанкПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФинОтчетВБанкПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФорматыМагазинов" 

	Дано Я открываю основную форму списка справочника "ФорматыМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФорматыМагазинов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФорматыМагазинов"

	Дано Я открываю основную форму справочника "ФорматыМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФорматыМагазинов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФормыСтатистики" 

	Дано Я открываю основную форму списка справочника "ФормыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФормыСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФормыСтатистики"

	Дано Я открываю основную форму справочника "ФормыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФормыСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХарактеристикиНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ХарактеристикиНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХарактеристикиНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХарактеристикиНоменклатуры"

	Дано Я открываю основную форму справочника "ХарактеристикиНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХарактеристикиНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХарактеристикиНоменклатурыДляЦенообразования" 

	Дано Я открываю основную форму списка справочника "ХарактеристикиНоменклатурыДляЦенообразования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХарактеристикиНоменклатурыДляЦенообразования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХарактеристикиНоменклатурыДляЦенообразования"

	Дано Я открываю основную форму справочника "ХарактеристикиНоменклатурыДляЦенообразования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХарактеристикиНоменклатурыДляЦенообразования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХозяйствующиеСубъектыВЕТИС" 

	Дано Я открываю основную форму списка справочника "ХозяйствующиеСубъектыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХозяйствующиеСубъектыВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХозяйствующиеСубъектыВЕТИС"

	Дано Я открываю основную форму справочника "ХозяйствующиеСубъектыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХозяйствующиеСубъектыВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦелевыеСредства" 

	Дано Я открываю основную форму списка справочника "ЦелевыеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦелевыеСредства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦелевыеСредства"

	Дано Я открываю основную форму справочника "ЦелевыеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦелевыеСредства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦелиВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЦелиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦелиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦелиВЕТИС"

	Дано Я открываю основную форму справочника "ЦелиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦелиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦенныеБумаги" 

	Дано Я открываю основную форму списка справочника "ЦенныеБумаги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦенныеБумаги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦенныеБумаги"

	Дано Я открываю основную форму справочника "ЦенныеБумаги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦенныеБумаги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеновыеГруппы" 

	Дано Я открываю основную форму списка справочника "ЦеновыеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦеновыеГруппы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеновыеГруппы"

	Дано Я открываю основную форму справочника "ЦеновыеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦеновыеГруппы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦиклыОбмена" 

	Дано Я открываю основную форму списка справочника "ЦиклыОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦиклыОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦиклыОбмена"

	Дано Я открываю основную форму справочника "ЦиклыОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦиклыОбмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныАнкет" 

	Дано Я открываю основную форму списка справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныАнкет"

	Дано Я открываю основную форму справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныВводаНефинансовыхПоказателей" 

	Дано Я открываю основную форму списка справочника "ШаблоныВводаНефинансовыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныВводаНефинансовыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныВводаНефинансовыхПоказателей"

	Дано Я открываю основную форму справочника "ШаблоныВводаНефинансовыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныВводаНефинансовыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныВыплатПоДоговорамОпеки" 

	Дано Я открываю основную форму списка справочника "ШаблоныВыплатПоДоговорамОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныВыплатПоДоговорамОпеки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныВыплатПоДоговорамОпеки"

	Дано Я открываю основную форму справочника "ШаблоныВыплатПоДоговорамОпеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныВыплатПоДоговорамОпеки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЗаданийОчереди" 

	Дано Я открываю основную форму списка справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЗаданийОчереди"

	Дано Я открываю основную форму справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныМагнитныхКарт" 

	Дано Я открываю основную форму списка справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныМагнитныхКарт"

	Дано Я открываю основную форму справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныОтветовНаЗаявкиКабинетСотрудника" 

	Дано Я открываю основную форму списка справочника "ШаблоныОтветовНаЗаявкиКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныОтветовНаЗаявкиКабинетСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныОтветовНаЗаявкиКабинетСотрудника"

	Дано Я открываю основную форму справочника "ШаблоныОтветовНаЗаявкиКабинетСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныОтветовНаЗаявкиКабинетСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныПроводокДляМеждународногоУчета" 

	Дано Я открываю основную форму списка справочника "ШаблоныПроводокДляМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныПроводокДляМеждународногоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныПроводокДляМеждународногоУчета"

	Дано Я открываю основную форму справочника "ШаблоныПроводокДляМеждународногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныПроводокДляМеждународногоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщений" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСообщений"

	Дано Я открываю основную форму справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщенийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСообщенийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЭтикетокИЦенников" 

	Дано Я открываю основную форму списка справочника "ШаблоныЭтикетокИЦенников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЭтикетокИЦенников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЭтикетокИЦенников"

	Дано Я открываю основную форму справочника "ШаблоныЭтикетокИЦенников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЭтикетокИЦенников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЭтикетокСУЗ" 

	Дано Я открываю основную форму списка справочника "ШаблоныЭтикетокСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЭтикетокСУЗ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЭтикетокСУЗ"

	Дано Я открываю основную форму справочника "ШаблоныЭтикетокСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЭтикетокСУЗ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШтатноеРасписание" 

	Дано Я открываю основную форму списка справочника "ШтатноеРасписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтатноеРасписание"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШтатноеРасписание"

	Дано Я открываю основную форму справочника "ШтатноеРасписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтатноеРасписание"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШтатноеРасписаниеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ШтатноеРасписаниеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтатноеРасписаниеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШтатноеРасписаниеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ШтатноеРасписаниеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтатноеРасписаниеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШтрихкодыУпаковокТоваров" 

	Дано Я открываю основную форму списка справочника "ШтрихкодыУпаковокТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтрихкодыУпаковокТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШтрихкодыУпаковокТоваров"

	Дано Я открываю основную форму справочника "ШтрихкодыУпаковокТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтрихкодыУпаковокТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭквайринговыеТерминалы" 

	Дано Я открываю основную форму списка справочника "ЭквайринговыеТерминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭквайринговыеТерминалы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭквайринговыеТерминалы"

	Дано Я открываю основную форму справочника "ЭквайринговыеТерминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭквайринговыеТерминалы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭкземплярБюджетаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭкземплярБюджетаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭкземплярБюджетаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭкземплярБюджетаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭкземплярБюджетаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭкземплярБюджетаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭкземплярыСервераDSS" 

	Дано Я открываю основную форму списка справочника "ЭкземплярыСервераDSS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭкземплярыСервераDSS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭкземплярыСервераDSS"

	Дано Я открываю основную форму справочника "ЭкземплярыСервераDSS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭкземплярыСервераDSS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныеПредставленияРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка справочника "ЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныеПредставленияРегламентированныхОтчетов"

	Дано Я открываю основную форму справочника "ЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлементыФинансовыхОтчетов" 

	Дано Я открываю основную форму списка справочника "ЭлементыФинансовыхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлементыФинансовыхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлементыФинансовыхОтчетов"

	Дано Я открываю основную форму справочника "ЭлементыФинансовыхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлементыФинансовыхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭтапПроизводства2_2ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭтапПроизводства2_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапПроизводства2_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭтапПроизводства2_2ПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭтапПроизводства2_2ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапПроизводства2_2ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭтапыПодготовкиБюджетов" 

	Дано Я открываю основную форму списка справочника "ЭтапыПодготовкиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыПодготовкиБюджетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭтапыПодготовкиБюджетов"

	Дано Я открываю основную форму справочника "ЭтапыПодготовкиБюджетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыПодготовкиБюджетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭтапыПодготовкиБюджетовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭтапыПодготовкиБюджетовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыПодготовкиБюджетовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭтапыПодготовкиБюджетовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭтапыПодготовкиБюджетовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыПодготовкиБюджетовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭтапыПроизводства" 

	Дано Я открываю основную форму списка справочника "ЭтапыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭтапыПроизводства"

	Дано Я открываю основную форму справочника "ЭтапыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЯзыкиНародовМира" 

	Дано Я открываю основную форму списка справочника "ЯзыкиНародовМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЯзыкиНародовМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЯзыкиНародовМира"

	Дано Я открываю основную форму справочника "ЯзыкиНародовМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЯзыкиНародовМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЯзыкиПечатныхФорм" 

	Дано Я открываю основную форму списка справочника "ЯзыкиПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЯзыкиПечатныхФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЯзыкиПечатныхФорм"

	Дано Я открываю основную форму справочника "ЯзыкиПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЯзыкиПечатныхФорм"
	И Я закрываю текущее окно

